{
   "intents": [
      {
         "tag": "hocbongkhuyenkhich",
         "patterns": [
            "điểm số để đủ điều kiện nhận học bổng khuyến khích cho sinh viên là gì?",
            "có thể cho em biết mức điểm tối thiểu cần đạt để được xét học bổng khuyến khích không?",
            "điểm chuẩn để được xem xét cho học bổng khuyến khích là bao nhiêu?",
            "ngưỡng điểm cần thiết để được xét học bổng khuyến khích là bao nhiêu?",
            "có thể chia sẻ về yêu cầu điểm số để được cấp học bổng khuyến khích không?",
            "Cho em hỏi về tiêu chí về điểm số khi xét học bổng khuyến khích với?",
            "có thể nói cho em biết về tiêu chí đánh giá điểm số để nhận học bổng khuyến khích không?",
            "Em quan tâm đến điểm số cần đạt để được xem xét cho học bổng khuyến khích, liệu có thể được giải đáp không?"
         ],
         "responses": [
            "Sinh viên phải đạt điểm trung bình học kì từ 7 điểm trở lên và không bị kỷ luật hoặc khiển trách trong học kỳ đó, có điểm rèn luyện loại khá trở lên là đủ tiêu chuẩn để xét học bổng."
         ]
      },
      {
         "tag": "nguyencuukhoahoc",
         "patterns": [
            "Khi SV khoa CNTT có tham gia đề tài NCKH tại khoa khác đã được hỗ trợ thì có được khoa CNTT hỗ trợ không?",
            "SV CNTT tham gia NCKH ở khoa khác có được khoa CNTT hỗ trợ không?",
            "Khoa CNTT có hỗ trợ cho SV tham gia đề tài NCKH ở các khoa khác không?",
            "Có thể nhận được hỗ trợ từ khoa CNTT nếu tham gia đề tài NCKH ở khoa khác không?",
            "SV khoa CNTT tham gia NCKH ở các khoa khác có được hỗ trợ từ khoa của mình không?"
         ],
         "responses": [
            "Khoa không hỗ trợ thêm, tuy nhiên khi đề tài quá lớn có thể tách riêng ra thành những đề tài nhỏ hơn liên quan trực tiếp đến ngành CNTT thì khoa có thể hỗ trợ."
         ]
      },
      {
         "tag": "bailuanchinhtri",
         "patterns": [
            "Nếu không hoàn thành 6 bài luận chính trị có bị treo bằng?",
            "Nếu không hoàn thành bài luận chính trị, có bị treo bằng không?",
            "Cho em hỏi, nếu thiếu bài luận chính trị, liệu có bị treo bằng không?",
            "Nếu không đạt yêu cầu về 6 bài luận chính trị, có thể bị treo bằng không?",
            "Thầy/ cô có thể giải đáp về việc không hoàn thành bài luận chính trị có ảnh hưởng đến bằng không?",
            "Về vấn đề không hoàn thành 6 bài luận chính trị, liệu có thể bị treo bằng không?",
            "Khi không đủ điều kiện về 6 bài luận chính trị, liệu có thể bị treo bằng không?"
         ],
         "responses": [
            "Theo thông tin chính thức từ phòng QLSV thì không có văn bản quy định việc không hoàn thành 6 bài lý luận chính trị thì bị treo bằng cả. 6 bài lý luận chính trị là một chứng nhận của hệ thống Đoàn với mục đích rèn luyện mục tiêu lý tưởng chính trị cho Đoàn viên, là điều kiện để xem xét thành tích của Đoàn viên, xét học bổng khuyến khích của hệ thống Đoàn"
         ]
      },
      {
         "tag": "diemchuan",
         "patterns": [
            "điểm chuẩn là bao nhiêu",
            "điểm chuẩn của từng ngành công nghệ thông tin",
            "điểm chuẩn của năm vừa qua",
            "ngành này tầm bao nhiêu điểm",
            "bao nhiêu điểm để đậu vào ngành này",
            "bao nhiêu điểm để đậu vào ngành này ở trường",
            "điểm trung bình bao nhiêu là đậu",
            "điểm đầu vào năm trước là bao nhiêu",
            "khoảng bao nhiêu điểm thì được đậu vậy ạ",
            "em xin tham khảo điểm xét tuyển CNTT những năm trước ạ",
            "em nhớ điểm chuẩn CNTT thi 24.5 đúng k ạ",
            "ngành cntt bao nhiêu điểm vậy",
            "bao nhiêu điểm thì đậu ngành cntt",
            "điểm đậu ngành cntt là bao nhiêu",
            "điểm thi năm 2023 ngành cntt",
            "điểm thi ngành cntt có cao không ạ",
            "điểm thi năm vừa rồi cần bao nhiêu để đậu cntt",
            "cntt năm vừa rồi lấy điểm có cao không",
            "điểm chuẩn tất cả các ngành",
            "diem chuan cua nganh ky thuat du lieu",
            "nganh ky thuat du lieu thi tot nghiep lay bao nhieu diem  ",
            "ky thuat du lieu nam nay xet hoc ba tam bao nhieu diem   ?",
            " xin tham khao diem xet tuyen ky thuat du lieu nhung nam truoc ",
            " nho diem chuan ky thuat du lieu thi 24.5 dung k ",
            "nganh ky thuat du lieu bao nhieu diem ",
            "bao nhieu diem thi dau nganh ky thuat du lieu",
            "diem dau nganh ky thuat du lieu la bao nhieu",
            "diem thi nam 2023 nganh ky thuat du lieu",
            "diem thi nganh ky thuat du lieu co cao khong ",
            "diem thi nam vua roi can bao nhieu de dau ky thuat du lieu",
            "ky thuat du lieu nam vua roi lay diem co cao khong",
            "diem chuan cua an toan thong tin",
            "xin tham khao diem xet tuyen an toan thong tin nhung nam truoc",
            " nho diem chuan ky thuat phan mem thi 26.9 dung k",
            "nganh an toan thong tin bao nhieu diem",
            "bao nhieu diem thi dau nganh an toan thong tin",
            "diem dau nganh an toan thong tin la bao nhieu",
            "diem thi nam 2023 nganh an toan thong tin",
            "diem thi nganh an toan thong tin co cao khong",
            "diem thi nam vua roi can bao nhieu de dau an toan thong tin",
            "an toan thong tin nam vua roi lay diem co cao khong",
            "diem chuan cua tung nganh an toan thong tin",
            "xin tham khao diem xet tuyen an toan thong tin nhung nam truoc",
            "he thong thong tin xet hoc ba bao nhieu diem thi an toan v",
            "nho diem chuan an toan thong tin thi 24.5 dung k",
            "bao nhieu diem thi dau nganh he thong thong tin",
            "diem thi nam 2023 nganh he thong thong tin",
            "diem thi nganh he thong thong tin co cao khong",
            "diem thi nam vua roi can bao nhieu de dau he thong thong tin",
            "he thong thong tin nam vua roi lay diem co cao khong",
            "diem chuan cong nghe thong tin",
            "điểm chuẩn công nghệ thông tin chất lượng cao bao nhiêu"
         ],
         "responses": [
            "Ngành công nghệ thông tin đại trà điểm thi trúng tuyển năm 2023 là 26.64, chất lượng cao tiếng anh 2023 là 25.98, chất lượng cao tiếng việt 2023 là 25.86 ",
            "Ngành Kỹ thuật dữ liệu điểm thi trúng tuyển năm 2023 là 26.81",
            "Ngành an toàn thông tin trúng tuyển năm 2023 là 26.9"
         ]
      },
      {
         "tag": "trinhdotienganh",
         "patterns": [
            "Khả năng tính toán và trình độ Tiếng Anh không tốt thi có ổn không",
            "không giỏi tiếng anh và sử dụng máy tính cũng không tốt lắm thì có hợp không",
            "Thầy cô cho em hỏi ngành công nghệ thông tin, có cần phải quan tâm nhiều đến tiếng anh không ạ"
         ],
         "responses": [
            "Trường sẽ đào tạo từ cơ bản đến nâng cao"
         ]
      },
      {
         "tag": "saudaihoc",
         "patterns": [
            "Ngành CNTT sau khi học xong đại học, có cơ hội học lên thạc sĩ hay tiến sĩ không ạ",
            "Điều kiện học lên thạc sĩ và tiến sĩ ngành CNTT như thế nào ạ",
            "học cntt có cơ hội học thạc sĩ không ạ",
            "Học xong e có thể học lên thạc sĩ được không ạ",
            "Khoa có đào tạo sau đại học không?"
         ],
         "responses": [
            "Bồi dưỡng trình độ ngoại ngữ tùy cấp độ để đạt trình độ theo quy định cho ứng viên và học viên sau đại học.Bồi dưỡng kiến thức cho ứng viên nghiên cứu sinh (tiền tiến sĩ).Bồi dưỡng chuyên môn trình độ sau đại học để nâng cao kiến thức, kỹ năng theo nhu cầu người học và địa phương."
         ]
      },
      {
         "tag": "kinangcanthiet",
         "patterns": [
            "Để theo đuổi ngành CNTT thì em cần chuẩn bị những gì cho bản thân,về kĩ năng ",
            "Cho em hỏi là CNTT có cần có kĩ năng đánh máy từ bây giờ không ạ?",
            "Em chưa tiếp xúc với máy tính nhiều có học được không ạ",
            "vậy làm thể nào để em có thể nắm bắt kiến thức của ngành này?"
         ],
         "responses": [
            "em cần chuẩn bị tốt kiến thức toán, ngoại ngữ, kỹ năng tư duy logic em nhé"
         ]
      },
      {
         "tag": "mucluong",
         "patterns": [
            "ra trường làm việc lương bao nhiêu",
            "Mức lương ra trường sao với các ngành khác",
            "tiền lương ngành này có ok không",
            "mức thu nhập bao nhiêu",
            "Lương trung bình của sinh viên sau khi ra trường",
            "Mức lương trung bình có thể nhận được khi làm ngành này là bao nhiêu",
            "Lương trung bình của sinh viên sau khi ra trường",
            "lương khỏi điểm đa số của ngành khi học xong",
            "lương trung bình cao không"
         ],
         "responses": [
            "không có con số thống kê cụ thể cho tỷ lệ việc làm sau khi ra trường-tùy vào khả năng và trình độ, mức lương sau khi ra trường có thể lên đến 30 triệu"
         ]
      },
      {
         "tag": "chuongtrinhtraodoi",
         "patterns": [
            "Sinh viên ngành CNTT có nhiều cơ hội tham gia các khóa học tập và trao đổi sinh viên quốc tế không",
            "Học ngành CNTT  có cơ hội đi trao đổi nước ngoài không ạ?",
            "Khi học em có thể đi trao đổi với các bạn sinh viên quốc tế không"
         ],
         "responses": [
            "Hằng năm, Trường Đại Học Sư Phạm Kỹ thuật TPHCM có tổ chức nhiều chương trình trao đổi sinh viên quốc tế."
         ]
      },
      {
         "tag": "chuongtrinhtraodoi",
         "patterns": [
            "Sinh viên ngành CNTT có nhiều cơ hội tham gia các khóa học tập và trao đổi sinh viên quốc tế không",
            "Học ngành CNTT  có cơ hội đi trao đổi nước ngoài không ạ?",
            "Khi học em có thể đi trao đổi với các bạn sinh viên quốc tế không"
         ],
         "responses": [
            "Hằng năm, Trường Đại Học Sư Phạm Kỹ thuật TPHCM có tổ chức nhiều chương trình trao đổi sinh viên quốc tế."
         ]
      },
      {
         "tag": "monhoctuongduong",
         "patterns": [
            "Khi hai môn học có mã môn khác nhau nhưng tương đương, sinh viên có cần phải làm đơn xin xét tương đương không?",
            "quy trình xin xét tương đương cho hai môn học có mã môn khác nhau nhưng tương đương không?",
            "Có cần phải nộp đơn xin xét tương đương khi hai môn học có mã môn khác nhau nhưng tương đương không?",
            "Quy định nào áp dụng cho trường hợp hai môn học có mã khác nhau nhưng tương đương?",
            "Sinh viên cần thực hiện thủ tục gì khi hai môn học có mã môn khác nhau nhưng tương đương?",
            "Thủ tục xin xét tương đương áp dụng khi nào cho các môn học có mã khác nhau nhưng tương đương?",
            "thông tin về việc cần làm đơn xin xét tương đương cho hai môn học có mã khác nhau nhưng tương đương không?",
            "Có cách nào khác để xác nhận tương đương cho hai môn học có mã khác nhau không?",
            "Sinh viên cần thực hiện thủ tục gì để xác nhận tương đương cho hai môn học có mã khác nhau?",
            "Quy trình xin xét tương đương áp dụng cho trường hợp môn học có mã khác nhau nhưng tương đương nhau là gì?"
         ],
         "responses": [
            "SV làm đơn và Khoa sẽ xác nhận."
         ]
      },
      {
         "tag": "monhocngoaikehoach",
         "patterns": [
            "Sinh viên hệ kỹ sư có được phép đăng ký học các môn về sư phạm không?",
            "Có cho phép sinh viên hệ kỹ sư tham gia các môn học về sư phạm không?",
            "Sinh viên hệ kỹ sư có được quyền đăng ký học các môn chuyên ngành sư phạm không?",
            "Có qui định gì về việc sinh viên hệ kỹ sư có thể đăng ký học môn sư phạm không?",
            "Quy định về việc sinh viên hệ kỹ sư đăng ký học các môn về sư phạm là gì?",
            "thông tin về khả năng đăng ký học các môn sư phạm của sinh viên hệ kỹ sư không?",
            "Em là sinh viên hệ kỹ sư, em có thể học các môn sư phạm được không?",
            "Ngoài các môn kỹ thuật, em có thể học thêm các môn về lĩnh vực nào khác?"
         ],
         "responses": [
            "SV có thể đăng ký học chứng chỉ sư phạm tại viện sư phạm kỹ thuật bất cứ khi nào. Chứng chỉ này độc lập với bằng tốt nghiệp kỹ sư."
         ]
      },
      {
         "tag": "huymonhoc",
         "patterns": [
            "Có cho phép sinh viên mở rộng thời hạn hủy môn học không?",
            "Sinh viên có được phép gia hạn thời gian hủy môn học không?",
            "Sinh viên có thể yêu cầu gia hạn thời gian hủy môn học không?",
            "Quy định về thời gian hủy môn học có linh động cho sinh viên không?",
            "Có quy định nào cho phép sinh viên kéo dài thời gian hủy môn học không?",
            "Có qui định nào về việc kéo dài thời gian hủy môn học cho sinh viên không?",
            "Sinh viên có thể yêu cầu kéo dài thời gian hủy môn học không?",
            "Có hạn chế nào đối với việc kéo dài thời gian hủy môn học của sinh viên không?"
         ],
         "responses": [
            "Thời gian hủy môn học là do nhà trường quy định phù hợp với quy trình quản lý chung."
         ]
      },
      {
         "tag": "luanvantotnghiep",
         "patterns": [
            "thời gian Khoa CNTT mở khóa luận tốt nghiệp là khi nào không?",
            "có thông tin về thời điểm Khoa CNTT mở đợt bảo vệ luận tốt nghiệp không?",
            "thời gian mà Khoa CNTT cho phép sinh viên mở khóa luận tốt nghiệp không?",
            "thời gian mở đợt bảo vệ luận tốt nghiệp tại Khoa CNTT không?",
            "Thời gian Khoa CNTT mở cửa cho sinh viên làm luận văn tốt nghiệp là khi nào?",
            "Khoa CNTT mở khóa luận tốt nghiệp vào thời điểm nào trong năm?",
            "thông tin về thời gian mở đợt bảo vệ luận tốt nghiệp tại Khoa CNTT không?",
            "thời điểm Khoa CNTT cho phép sinh viên bắt đầu làm luận văn tốt nghiệp không?",
            "Khi nào là thời gian mở khóa luận tốt nghiệp tại Khoa CNTT?",
            "Thời gian bắt đầu làm luận văn tốt nghiệp tại Khoa CNTT là khi nào?"
         ],
         "responses": [
            "Hiện tại khoa luôn mở đăng kí để làm khóa luận vào mỗi kì của năm học."
         ]
      },
      {
         "tag": "dieukienluanvantotnghiep",
         "patterns": [
            "điều kiện để được làm khóa luận tốt nghiệp không?",
            "Khi nào sinh viên được phép làm khóa luận tốt nghiệp?",
            "Quy định gì đối với sinh viên muốn làm khóa luận tốt nghiệp?",
            "Điều kiện nào cần thiết để sinh viên được làm khóa luận tốt nghiệp?",
            "Có qui định gì về điều kiện làm khóa luận tốt nghiệp không?",
            "Thủ tục nào cần thực hiện để đáp ứng điều kiện làm khóa luận tốt nghiệp?",
            "Sinh viên cần đáp ứng những yêu cầu gì để được làm khóa luận tốt nghiệp?",
            "thông tin về các điều kiện cần đạt để làm khóa luận tốt nghiệp không?",
            "Có những yêu cầu gì mà sinh viên cần tuân thủ để làm khóa luận tốt nghiệp?",
            "Quy trình nào sinh viên cần tuân thủ để được làm khóa luận tốt nghiệp?"
         ],
         "responses": [
            "Hằng năm, Khoa sẽ chọn các sinh viên đủ điều kiện làm khóa luận tốt nghiệp dựa trên điểm trung bình tích lũy và số tín chỉ tích lũy. Điều kiện sẽ thay đổi hàng năm tùy theo số lượng sinh viên và số lượng giảng viên."
         ]
      },
      {
         "tag": "congnghephanmem",
         "patterns": [
            "Chuyên ngành Công nghệ Phần mềm làm những gì?",
            "Em có thể làm những công việc Công nghệ Phần mềm?",
            "Em muốn tìm hiểu thêm về ngành Công nghệ Phần mềm",
            "Ngành Công nghệ Phần mềm có gì khác so với các ngành khác trong lĩnh vực CNTT?",
            "những kỹ năng và kiến thức nào được học trong chuyên ngành công nghệ phần mềm không?",
            "Có thể giới thiệu về chuyên ngành công nghệ phần mềm làm những gì không?",
            "Chuyên ngành công nghệ phần mềm đào tạo những kỹ năng và kiến thức gì?",
            "Có những nội dung học gì trong chuyên ngành công nghệ phần mềm?",
            "Có những ngành nghề nào liên quan đến chuyên ngành công nghệ phần mềm?"
         ],
         "responses": [
            "cung cấp cho sinh viên kiến thức chuyên sâu về lập trình (các công nghệ và môi trường lập trình, phương pháp lập trình, quy trình xây dựng phần mềm). Khi ra trường, SV có thể tham gia vào các dự án phần mềm với các vị trí khác nhau: developer, designer, tester,..."
         ]
      },
      {
         "tag": "chuyennganhcntt",
         "patterns": [
            "Có cách nào giúp em chọn được chuyên ngành phù hợp hay không?",
            "Em vẫn chưa định hướng được chuyên ngành, em phải làm sao?",
            "Làm thế nào để biết mình phù hợp với chuyên ngành nào?",
            "Nên chọn chuyên ngành theo sở thích hay theo khả năng?",
            "Có cách nào để em tìm ra định hướng chuyên ngành phù hợp với bản thân không?",
            "Em cần hỗ trợ định hướng chuyên ngành, liệu có ai có thể tư vấn giúp không?",
            "Làm thế nào để em có thể quyết định được chuyên ngành phù hợp với mình?",
            "Có cách nào để em có thể định hướng chuyên ngành mà không gặp khó khăn?",
            "Làm sao để em có thể tìm hiểu rõ hơn về các chuyên ngành để đưa ra quyết định?",
            "Quy trình nào giúp em xác định chuyên ngành mà em sẽ chọn?"
         ],
         "responses": [
            "Khi học công nghệ thông tin, sinh viên được chọn một trong 4 chuyên ngành: Công nghệ phần mềm, hệ thống thông tin, kĩ thuật dữ liệu và mạng máy tính .Trong 2.5 năm đầu, tất cả sinh viên đều được học chung chương trình. Trong thời gian này, sinh viên sẽ được cung cấp các kiến thức nền tảng cần thiết trong lĩnh vực công nghệ thông tin như: Kiến thức về lập trình, về cơ sở dữ liệu, mạngmáy tính,.."
         ]
      },
      {
         "tag": "tuvanchuyennganh",
         "patterns": [
            "sinh viên có tự do lựa chọn chuyên ngành theo ý thích không?",
            "quy định cho phép sinh viên học chuyên ngành tùy ý thích khi đăng ký không?",
            "Có qui định nào cho phép sinh viên tự do chọn chuyên ngành mình muốn khi đăng ký không?",
            "Khi đăng ký chuyên ngành sinh viên có được học chuyên ngành theo ý thích riêng không?",
            "sinh viên chọn bất kỳ chuyên ngành nào mình muốn khi đăng ký không?",
            "Thủ tục đăng ký chuyên ngành có cho phép sinh viên lựa chọn chuyên ngành theo sở thích không?",
            "Sinh viên có được quyền lựa chọn chuyên ngành tùy ý thích khi đăng ký không?",
            "thông tin về khả năng lựa chọn chuyên ngành theo ý thích khi đăng ký không?",
            "Có quy định nào về việc sinh viên học chuyên ngành tùy ý thích khi đăng ký không?",
            "Sinh viên có tự do chọn bất kỳ chuyên ngành nào mình muốn khi đăng ký không?"
         ],
         "responses": [
            "SV được tùy ý chọn chuyên ngành nhưng kết quả tùy thuộc vào số lượng SV đăng ký vào chuyên ngành và điểm TBTL của SV. Tuy nhiên, sinh viên được phép đăng ký học bất cứ môn học nào mà Khoa có mở ở tất cả các chuyên ngành."
         ]
      },
      {
         "tag": "dangkychuyennganh",
         "patterns": [
            "hướng dẫn về cách thức đăng ký chuyên ngành CNTT được không?",
            "thông tin về thủ tục đăng ký chuyên ngành CNTT không?",
            "Có cách nào để đăng ký chuyên ngành CNTT không?",
            "Làm thế nào để đăng ký vào chuyên ngành CNTT?",
            "quy trình đăng ký chuyên ngành CNTT không?",
            "Thủ tục đăng ký chuyên ngành CNTT như thế nào?",
            "Có cách nào đơn giản để đăng ký vào chuyên ngành CNTT không?",
            "cách đăng ký chuyên ngành CNTT được không?",
            "Làm sao để tôi có thể đăng ký vào chuyên ngành CNTT?",
            "Thủ tục đăng ký vào chuyên ngành CNTT là gì?"
         ],
         "responses": [
            "SV sẽ đăng ký chuyên ngành qua website của Khoa."
         ]
      },
      {
         "tag": "dieukienchuyennganh",
         "patterns": [
            "Nếu sinh viên học trễ một học kỳ thì thủ tục đăng ký chuyên ngành như thế nào?",
            "cách đăng ký chuyên ngành cho sinh viên học trễ một học kỳ không?",
            "Khi học trễ một học kỳ, sinh viên phải làm thủ tục đăng ký chuyên ngành như thế nào?",
            "Có quy định gì đặc biệt về đăng ký chuyên ngành cho sinh viên học trễ một học kỳ không?",
            "Thủ tục đăng ký chuyên ngành đối với sinh viên học trễ một học kỳ không?",
            "Làm sao để sinh viên học trễ một học kỳ có thể đăng ký chuyên ngành?",
            "Sinh viên học trễ một học kỳ cần làm gì để đăng ký chuyên ngành?",
            "Thủ tục đăng ký chuyên ngành thế nào cho sinh viên học trễ một học kỳ?",
            "quy trình đăng ký chuyên ngành cho sinh viên học trễ một học kỳ không?"
         ],
         "responses": [
            "SV phải đăng ký chuyên ngành vào đầu học kỳ 6 dù có học trễ hay không."
         ]
      },
      {
         "tag": "congtacxahoi",
         "patterns": [
            "Sinh viên cần thực hiện bao nhiêu buổi công tác xã hội để đủ điều kiện ra trường?",
            "số lượng buổi công tác xã hội mà sinh viên cần thực hiện trước khi ra trường không?",
            "Quy định về số buổi công tác xã hội cần thực hiện để đạt điều kiện ra trường là gì?",
            "Sinh viên cần hoàn thành bao nhiêu buổi công tác xã hội để được phép ra trường?",
            "Có qui định nào về số lượng buổi công tác xã hội mà sinh viên phải tham gia trước khi tốt nghiệp không?",
            "yêu cầu về công tác xã hội mà sinh viên cần thực hiện để ra trường không?",
            "Sinh viên cần hoàn thành bao nhiêu giờ công tác xã hội để đủ điều kiện tốt nghiệp?",
            "quy định nào về số buổi hoặc thời lượng công tác xã hội mà sinh viên cần thực hiện trước khi tốt nghiệp không?",
            "Sinh viên cần tham gia công tác xã hội trong bao lâu trước khi được phép ra trường?",
            "Thực tế về số buổi hoặc thời lượng công tác xã hội mà sinh viên cần hoàn thành để đạt điều kiện tốt nghiệp là gì?",
            "Xin cho biết, SV chính quy cần tích lũy bao nhiêu ngày Công tác xã hội (CTXH)?"
         ],
         "responses": [
            " Để tốt nghiệp, SV phải hoàn thành 8 buổi công tác xã hội qui đổi. Các hoạt động liên quan đến công tác xã hội như tham gia mùa hè xanh, chủ nhật xanh, tiếp sức mùa thi."
         ]
      },
      {
         "tag": "tichluychungchi",
         "patterns": [
            "Có quy định nào cho phép sinh viên tích lũy nhiều hơn 180 tín chỉ không?",
            "Thầy/cô có thông tin về việc sinh viên có thể tích lũy số tín chỉ vượt quá 180 không?",
            "Sinh viên có được phép tích lũy tín chỉ nhiều hơn 180 không?",
            "Có cho phép sinh viên tích lũy số tín chỉ lớn hơn 180 không?",
            "Quy định về tích lũy tín chỉ có giới hạn là bao nhiêu?",
            "Thầy/cô có thể giải thích về chính sách tích lũy tín chỉ vượt quá 180 của trường không?",
            "Sinh viên có thể tích lũy tín chỉ nhiều hơn 180TC được không?",
            "Có qui định gì về việc sinh viên có thể tích lũy nhiều hơn 180TC không?",
            "thông tin về việc tích lũy tín chỉ vượt quá 180 và cách xử lý môn rớt trong bảng điểm không?",
            "Nếu sinh viên tích lũy nhiều hơn 180 tín chỉ, thì những môn rớt có được ghi vào bảng điểm không?"
         ],
         "responses": [
            "SV có thể đăng ký học và tích lũy nhiều hơn 180TC, và điểm của các môn học thêm ngoài chương trình sẽ được tính vào điểm tích lũy. Khi in bảng điểm toàn khóa sẽ in điểm cao nhất trong các lần thi của môn đó, bảng điểm tốt nghiệp chỉ in những điểm đạt. "
         ]
      },
      {
         "tag": "chuongtrinhdaotao",
         "patterns": [
            "Sinh viên hệ sư phạm khi tốt nghiệp sẽ có những bằng gì?",
            "Sau khi tốt nghiệp sư phạm, em sẽ nhận được những bằng gì?",
            "Bằng cấp của SV hệ sư phạm sau khi tốt nghiệp có những loại nào?",
            "Em muốn biết thêm về các bằng cấp mà SV sư phạm nhận được sau khi tốt nghiệp.",
            "Bằng cấp của SV hệ sư phạm có gì khác so với SV hệ khác?",
            "Loại bằng nào quan trọng hơn đối với SV hệ sư phạm sau khi tốt nghiệp?",
            "Nếu em muốn học lên cao hơn sau khi tốt nghiệp sư phạm, em cần phải có những bằng gì?",
            "Nếu em muốn đi dạy học sau khi tốt nghiệp sư phạm, em cần phải có những bằng gì?"
         ],
         "responses": [
            "SV hệ sư phạm khi tốt nghiệp sẽ có bằng kỹ sư và chứng chỉ sư phạm bậc 2."
         ]
      },
      {
         "tag": "clbhocthuat",
         "patterns": [
            "Làm thế nào để tìm hiểu về các CLB học thuật của khoa?",
            "Có cách nào để biết thông tin về các CLB học thuật của khoa không?",
            "Làm thế nào để có thể tham gia các CLB học thuật của khoa?",
            "Có cách nào để tôi tìm hiểu về hội thi do các CLB học thuật của khoa tổ chức không?",
            "Em muốn tham gia vào CLB học thuật, em cần làm gì?",
            "Em muốn đề xuất tổ chức hội thi dành cho CLB học thuật, em cần làm gì?",
            "Khoa mình có thường xuyên tổ chức hội thi dành cho CLB học thuật hay không?",
            "Làm thế nào để tìm hiểu về các CLB học thuật của khoa?",
            "Em muốn tìm hiểu về các hoạt động của CLB học thuật khoa."
         ],
         "responses": [
            "Hiện tại Khoa cũng đã có CLB Tin học. Các hoạt động hàng năm của CLB là tổ chức các buổi hội thảo chuyên đề, cuộc thi Mastering IT"
         ]
      },
      {
         "tag": "hethongthongtin",
         "patterns": [
            "Chuyên ngành hệ thống thông tin làm những gì?",
            "Em có thể làm những công việc hệ thống thông tin",
            "Em muốn tìm hiểu thêm về ngành hệ thống thông tin",
            "Ngành hệ thống thông tin có gì khác so với các ngành khác trong lĩnh vực CNTT?",
            "những kỹ năng và kiến thức nào được học trong chuyên ngành hệ thống thông tin không?",
            "Có thể giới thiệu về chuyên ngành hệ thống thông tin làm những gì không?",
            "Chuyên ngành hệ thống thông tin đào tạo những kỹ năng và kiến thức gì?",
            "Có những nội dung học gì trong chuyên ngành hệ thống thông tin?",
            "Có những ngành nghề nào liên quan đến chuyên ngành hệ thống thông tin?"
         ],
         "responses": [
            "cung cấp cho viên viên kiến thức chuyên sâu hơn về cơ sở dữ liệu: phương pháp phân tích, thiết kế, quản trị dữ liệu, .... Khi ra trường các bạn có thể làm việc tại các công ty phần mềm ở các giai đoạn liên quan đến cơ sở dữ liệu, làm việc tại các công ty thuộc các lĩnh vực khác mà có nhu cầu quản trị dữ liệu,.."
         ]
      },
      {
         "tag": "mangmaytinh",
         "patterns": [
            "Chuyên ngành mạng máy tính làm những gì?",
            "Em có thể làm những công việc mạng máy tính",
            "Em muốn tìm hiểu thêm về ngành mạng máy tính",
            "Ngành mạng máy tính có gì khác so với các ngành khác trong lĩnh vực CNTT?",
            "những kỹ năng và kiến thức nào được học trong chuyên ngành mạng máy tính không?",
            "Có thể giới thiệu về chuyên ngành mạng máy tính làm những gì không?",
            "Chuyên ngành mạng máy tính đào tạo những kỹ năng và kiến thức gì?",
            "Có những nội dung học gì trong chuyên ngành mạng máy tính?",
            "Có những ngành nghề nào liên quan đến chuyên ngành mạng máy tính?",
            "Em rất thích an ninh mạng, khi học chuyên ngành Mạng máy tính, em có được học về lĩnh vực này hay không ?"
         ],
         "responses": [
            "Cung cấp cho sinh viên kiến thức chuyên sâu hơn về mạng máy tính. Cách thiết kế, cấu hình, triển khai hệ thống mạng.....Các bạn có thể làm việc tại các công ty cung cấp, triển khai hệ thống mạng, hoặc tham gia quản trị mạng ."
         ]
      },
      {
         "tag": "thuctap",
         "patterns": [
            "Em muốn đi thực tập tại các công ty bên ngoài, Khoa có thể hỗ trợ em như thế nào?",
            "Khoa có thể giới thiệu em với các công ty được không?",
            "Em muốn tìm hiểu về cơ hội thực tập tại các công ty ngoài, em có thể làm thế nào?",
            "Thầy/cô chỉ dẫn cho em về cách liên hệ hoặc nhận sự hỗ trợ từ Khoa để thực tập tại các công ty ngoài không?",
            "Có cơ hội nào cho sinh viên muốn thực tập tại các công ty do Khoa tổ chức không?",
            "Quy định của Khoa đối với việc hỗ trợ sinh viên thực tập tại các công ty là gì?",
            "Có ai trong Khoa có thể giúp sinh viên liên hệ hoặc tổ chức thực tập tại các công ty không?",
            "Sinh viên cần thực hiện thủ tục gì để nhận được sự hỗ trợ từ Khoa khi muốn đi thực tập tại các công ty không?",
            "Khoa có cung cấp hỗ trợ nào để sinh viên đi thực tập tại các công ty bên ngoài không?"
         ],
         "responses": [
            "Hàng năm, Khoa đều có liên hệ với các công ty tin học trên địa bàn thành phố HCM (TMA, Global Cybersoft, Lạc Việt, …) để gửi sinh viên đến thực tập. Vì vậy, nếu em có mong muốn đi thực tập, em theo dõi các thông báo của Khoa để khi nào đến đợt thì đăng ký."
         ]
      },
      {
         "tag": "nguyencuudetai",
         "patterns": [
            "Thời gian thực hiện đề tài NCKH của sinh viên là bao lâu?",
            "Thầy/cô có thể cho biết về thời gian cần thiết để thực hiện một đề tài NCKH của sinh viên không?",
            "Có qui định nào về thời gian thực hiện đề tài NCKH của sinh viên không?",
            "Sinh viên cần bao lâu để hoàn thành một đề tài NCKH?",
            "Quy định về thời gian thực hiện đề tài NCKH của sinh viên như thế nào?",
            "Thời gian đăng ký để thực hiện đề tài NCKH của sinh viên là khi nào?",
            "Có quy trình đăng ký đề tài NCKH cho sinh viên không?",
            "Sinh viên cần thực hiện thủ tục đăng ký vào thời điểm nào để thực hiện đề tài NCKH?",
            "Quy định về việc đăng ký thực hiện đề tài NCKH của sinh viên là gì?"
         ],
         "responses": [
            "Hiện nay, theo quy trình của nhà Trường, các đề tài NCKH được tiến hành đăng ký vào khoảng đầu học kỳ 2 hàng năm. Thời gian thực hiện cho mỗi đề tài là 1 năm."
         ]
      },
      {
         "tag": "truongkhoa",
         "patterns": [
            "Ai là trưởng khoa của bộ môn Công nghệ Thông tin?",
            "Có ai đảm nhiệm vai trò trưởng khoa trong bộ môn Công nghệ Thông tin không?",
            "Thầy/cô có thông tin về người đang giữ chức vụ trưởng khoa trong ngành Công nghệ Thông tin không?",
            "Trưởng khoa hiện tại của ngành Công nghệ Thông tin là ai?",
            "Ai là người trưởng khoa của khoa Công nghệ Thông tin?",
            "Thầy/cô nào là người đảm nhiệm vai trò trưởng khoa trong khoa Công nghệ Thông tin?",
            "Có ai được bổ nhiệm làm trưởng khoa của ngành Công nghệ Thông tin không?",
            "Trong khoa Công nghệ Thông tin, ai đang là người trưởng khoa?",
            "Thầy/cô có thể giới thiệu về trưởng khoa của khoa Công nghệ Thông tin không?",
            "Người đứng đầu của bộ môn Công nghệ Thông tin là ai?"
         ],
         "responses": [
            "Tiến sĩ Lê Văn Vinh thông tin liên hệ vinhlv@hcmute.edu.vn"
         ]
      },
      {
         "tag": "photruongkhoa",
         "patterns": [
            "Ai là phó khoa của bộ môn Công nghệ Thông tin?",
            "Có ai đảm nhiệm vai trò phó khoa trong bộ môn Công nghệ Thông tin không?",
            "Thầy/cô có thông tin về người đang giữ chức vụ phó khoa trong ngành Công nghệ Thông tin không?",
            "phó khoa hiện tại của ngành Công nghệ Thông tin là ai?",
            "Ai là người phó khoa của khoa Công nghệ Thông tin?",
            "Thầy/cô nào là người đảm nhiệm vai trò phó khoa trong khoa Công nghệ Thông tin?",
            "Có ai được bổ nhiệm làm phó khoa của ngành Công nghệ Thông tin không?",
            "Trong khoa Công nghệ Thông tin, ai đang là người phó khoa?",
            "Thầy/cô có thể giới thiệu về phó khoa của khoa Công nghệ Thông tin không?"
         ],
         "responses": [
            "Phó giáo sư Tiến sĩ Hoàng Văn Dũng với thông tin liên hệ dunghv@hcmute.edu.vn"
         ]
      },
      {
         "tag": "dethidapan",
         "patterns": [
            "Làm thế nào để có thể lấy được đề thi và đáp án của các năm trước?",
            "Thầy/cô có thể hướng dẫn cách lấy đề thi và đáp án của các năm trước không?",
            "Có cách nào để truy cập đến đề thi và đáp án của các năm trước không?",
            "Quy trình nào được sử dụng để thu thập đề thi và đáp án của các năm trước?",
            "Làm sao để có thể tìm được đề thi và đáp án từ các năm trước đối với một môn học cụ thể?",
            "Thầy/cô có thể chỉ cho em biết làm sao để tìm kiếm và lấy đề thi và đáp án của các năm trước không?",
            "Có trang web nào cung cấp đề thi và đáp án của các năm trước không?",
            "Thường người ta thường làm thế nào để thu thập đề thi và đáp án của các năm trước?",
            "Có nguồn thông tin nào mà em có thể sử dụng để tìm kiếm đề thi và đáp án của các năm trước không?",
            "Thầy/cô có thể chia sẻ kinh nghiệm về cách lấy đề thi và đáp án từ các năm trước không?"
         ],
         "responses": [
            "Vào trang khoa công nghệ thông tin với trang website fit.hcmute.edu.vn vào mục sinh viên "
         ]
      },
      {
         "tag": "giayto",
         "patterns": [
            "Phòng Tuyển sinh và công tác sinh viên có trách nhiệm cấp những loại giấy tờ nào cho sinh viên?",
            "các loại giấy tờ mà Phòng Tuyển sinh và công tác sinh viên cấp cho sinh viên không?",
            "Có những giấy tờ cụ thể nào mà sinh viên cần phải yêu cầu từ Phòng Tuyển sinh và công tác sinh viên?",
            "Quy trình nhận các loại giấy tờ từ Phòng Tuyển sinh và công tác sinh viên là như thế nào?",
            "Thầy/cô có thông tin về các hình thức giấy tờ mà sinh viên có thể yêu cầu từ Phòng Tuyển sinh và công tác sinh viên không?",
            "Có cách nào để biết được loại giấy tờ nào mà sinh viên có thể yêu cầu từ Phòng Tuyển sinh và công tác sinh viên không?",
            "Quy định về việc cấp giấy tờ từ Phòng Tuyển sinh và công tác sinh viên được quy định như thế nào?"
         ],
         "responses": [
            "Phòng Tuyển sinh và CTSV chịu trách nhiệm cấp các loại giấy tờ & giải quyết các yêu cầu sau đây cho SV: Giấy chứng nhận SV (v/v bổ túc hồ sơ tạm hoãn nghĩa vụ quân sự, xin việc làm, xin đi học, xin tạm trú, đi xe buýt, vay tín dụng ưu đãi (mẫu số 01/TDSV), bổ túc hồ sơ địa phương,…); xác nhận sổ ưu đãi giáo dục, đào tạo; giải quyết yêu cầu của SV về tạm dừng học tập, xin học tiếp sau tạm dừng, xin thôi học, xin chuyển trường; giấy giới thiệu,…"
         ]
      },
      {
         "tag": "SV_giayto",
         "patterns": [
            "Để được cấp giấy tờ, sinh viên phải thực hiện những thủ tục gì?",
            "Thầy/cô có thể chỉ dẫn về quy trình sinh viên cần thực hiện để được cấp giấy tờ không?",
            "Có những yêu cầu hoặc điều kiện gì mà sinh viên cần tuân theo để nhận giấy tờ từ phòng tuyển sinh không?",
            "Quy trình nhận giấy tờ từ phòng tuyển sinh và công tác sinh viên bao gồm những bước nào?",
            "Sinh viên phải chuẩn bị những giấy tờ hoặc thông tin gì khi muốn được cấp giấy tờ?",
            "Có các hình thức nào mà sinh viên cần tuân theo khi yêu cầu cấp giấy tờ từ phòng tuyển sinh và công tác sinh viên không?",
            "Thủ tục đăng ký hoặc nộp đơn yêu cầu cấp giấy tờ từ phòng tuyển sinh và công tác sinh viên là gì?",
            "Có yêu cầu cụ thể nào mà sinh viên cần tuân theo khi yêu cầu cấp giấy tờ không?",
            "Quy định về thủ tục cấp giấy tờ từ phòng tuyển sinh và công tác sinh viên được quy định như thế nào?"
         ],
         "responses": [
            "Phòng Tuyển sinh và CTSV triển khai đăng ký cấp giấy chứng nhận SV online trên trang online.hcmute.edu.vn, SV đăng ký online tại bất cứ đâu và nhận giấy đăng ký tại phòng Tuyển sinh và CTSV theo đúng thời gian hẹn."
         ]
      },
      {
         "tag": "tgian_giayto",
         "patterns": [
            "Thời gian cấp giấy tờ từ phòng tuyển sinh và công tác sinh viên là bao lâu?",
            "Thời gian xử lý yêu cầu cấp giấy tờ là bao lâu?",
            "Bình thường, thời gian từ yêu cầu đến nhận giấy tờ là bao lâu?",
            "Thời gian chờ đợi để nhận giấy tờ là bao lâu?",
            "Thời gian xử lý yêu cầu cấp giấy tờ từ phòng tuyển sinh và công tác sinh viên không?",
            "Thời gian chờ đợi để nhận được giấy tờ từ phòng tuyển sinh và công tác sinh viên có thể là bao lâu?",
            "Quy định về thời gian xử lý yêu cầu cấp giấy tờ từ phòng tuyển sinh và công tác sinh viên được quy định như thế nào?"
         ],
         "responses": [
            "Đối với giấy tờ do lãnh đạo phòng Tuyển sinh và CTSV ký: SV xin buổi sáng, nhận kết quả vào buổi chiều; SV xin buổi chiều, nhận kết quả vào sáng hôm sau (nếu xin vào sáng thứ 7, nhận kết quả vào sáng thứ 2 tuần kế tiếp). Đối với giấy tờ do Ban giám hiệu ký: SV nhận kết quả sau 03 ngày."
         ]
      },
      {
         "tag": "tgian_giayto",
         "patterns": [
            "Thời gian cấp giấy tờ từ phòng tuyển sinh và công tác sinh viên là bao lâu?",
            "Thời gian xử lý yêu cầu cấp giấy tờ là bao lâu?",
            "Bình thường, thời gian từ yêu cầu đến nhận giấy tờ là bao lâu?",
            "Thời gian chờ đợi để nhận giấy tờ là bao lâu?",
            "Thời gian xử lý yêu cầu cấp giấy tờ từ phòng tuyển sinh và công tác sinh viên không?",
            "Thời gian chờ đợi để nhận được giấy tờ từ phòng tuyển sinh và công tác sinh viên có thể là bao lâu?",
            "Quy định về thời gian xử lý yêu cầu cấp giấy tờ từ phòng tuyển sinh và công tác sinh viên được quy định như thế nào?"
         ],
         "responses": [
            "Đối với giấy tờ do lãnh đạo phòng Tuyển sinh và CTSV ký: SV xin buổi sáng, nhận kết quả vào buổi chiều; SV xin buổi chiều, nhận kết quả vào sáng hôm sau (nếu xin vào sáng thứ 7, nhận kết quả vào sáng thứ 2 tuần kế tiếp). Đối với giấy tờ do Ban giám hiệu ký: SV nhận kết quả sau 03 ngày."
         ]
      },
      {
         "tag": "inbangdiem",
         "patterns": [
            "Để in bảng điểm có xác nhận của trường, em phải thực hiện thủ tục gì?",
            "Thầy/cô có thể hướng dẫn cách in bảng điểm có xác nhận từ trường không?",
            "Quy trình in bảng điểm với xác nhận của trường là gì?",
            "Có cách nào để em có thể yêu cầu in bảng điểm với xác nhận từ trường không?",
            "Thủ tục yêu cầu in bảng điểm có xác nhận từ trường bao gồm những gì?",
            "Quy định về việc in bảng điểm có xác nhận từ trường được quy định như thế nào?"
         ],
         "responses": [
            "Nếu em có nhu cầu in bảng điểm thì em liên hệ Phòng Đào tạo, bộ phận tiếp sinh viên do Cô Hoa phụ trách (A1-202) để thực hiện việc đăng ký in. Thời gian trả bảng điểm sau đó 01 ngày"
         ]
      },
      {
         "tag": "inbangdiem",
         "patterns": [
            "Để in bảng điểm có xác nhận của trường, em phải thực hiện thủ tục gì?",
            "Thầy/cô có thể hướng dẫn cách in bảng điểm có xác nhận từ trường không?",
            "Quy trình in bảng điểm với xác nhận của trường là gì?",
            "Có cách nào để em có thể yêu cầu in bảng điểm với xác nhận từ trường không?",
            "Thủ tục yêu cầu in bảng điểm có xác nhận từ trường bao gồm những gì?",
            "Quy định về việc in bảng điểm có xác nhận từ trường được quy định như thế nào?"
         ],
         "responses": [
            "Nếu em có nhu cầu in bảng điểm thì em liên hệ Phòng Đào tạo, bộ phận tiếp sinh viên do Cô Hoa phụ trách (A1-202) để thực hiện việc đăng ký in. Thời gian trả bảng điểm sau đó 01 ngày"
         ]
      },
      {
         "tag": "congchung",
         "patterns": [
            "Để công chứng bằng tốt nghiệp và chứng chỉ sư phạm, em cần thực hiện thủ tục gì?",
            "Quy trình công chứng bằng tốt nghiệp và chứng chỉ sư phạm là gì?",
            "hướng dẫn cách công chứng bằng tốt nghiệp và chứng chỉ sư phạm không?",
            "Có cách nào để em có thể yêu cầu công chứng bằng tốt nghiệp và chứng chỉ sư phạm không?",
            "Thủ tục yêu cầu công chứng bằng tốt nghiệp và chứng chỉ sư phạm bao gồm những gì?",
            "Thời gian và cách thức nhận công chứng bằng tốt nghiệp và chứng chỉ sư phạm không?",
            "Quy định về việc công chứng bằng tốt nghiệp và chứng chỉ sư phạm được quy định như thế nào?"
         ],
         "responses": [
            "Em photo số bản cần công chứng. Sau đó, em nộp bản gốc kèm các bản photo tại Phòng Đào tạo, bộ phận tiếp sinh viên do Cô Hoa phụ trách (A1-202) và nhận kết quả sau đó."
         ]
      },
      {
         "tag": "hosonhaphoc",
         "patterns": [
            "Yêu cầu về hồ sơ khi sinh viên nhập học bao gồm những gì?",
            "Thầy/cô có thể liệt kê các tài liệu cần thiết trong hồ sơ khi sinh viên nhập học không?",
            "Quy định về hồ sơ cần chuẩn bị khi nhập học là gì?",
            "Có những giấy tờ cụ thể nào mà sinh viên cần đệ trình khi nhập học?",
            "Thủ tục hoàn thành hồ sơ khi nhập học bao gồm những bước nào?",
            "Thầy/cô có thông tin về các hình thức xác minh hồ sơ khi sinh viên nhập học không?",
            "Quy định về hồ sơ khi nhập học có được công bố công khai không?",
            "Có yêu cầu đặc biệt nào về hồ sơ khi sinh viên mới nhập học không?"
         ],
         "responses": [
            "Giấy báo nhập học (bản chính); Lý lịch SV (dán hình & xác nhận của chính quyền địa phương hoặc cơ quan quản lý); Bản sao bằng TN, chứng nhận TN (có thị thực); Bản sao học bạ (có thị thực); Bản sao giấy khai sinh; Bản sao hộ khẩu (hưởng ưu tiên theo hộ khẩu thường trú); Giấy chứnh nhận diện chính sách (diện ưu tiên theo đối tượng)."
         ]
      },
      {
         "tag": "kiemtravanbang",
         "patterns": [
            "Khi nhà tuyển dụng cần kiểm tra văn bằng của sinh viên đã tốt nghiệp có do trường cấp hay không, họ thực hiện thủ tục như thế nào?",
            "Quy trình kiểm tra văn bằng của sinh viên đã tốt nghiệp có đúng do trường cấp hay không không?",
            "Có cách nào để nhà tuyển dụng xác minh xem văn bằng của sinh viên có đúng do trường cấp hay không không?",
            "Người ta thực hiện thủ tục kiểm tra văn bằng của sinh viên như thế nào để đảm bảo tính chính xác?",
            "Quy trình kiểm tra văn bằng của sinh viên đã tốt nghiệp có phức tạp không?",
            "Có cách nào để nhà tuyển dụng có thể đảm bảo tính chính xác của văn bằng của sinh viên không?",
            "Quy định về việc kiểm tra văn bằng của sinh viên được quy định như thế nào?"
         ],
         "responses": [
            "Tra cứu trên web tại địa chỉ: http://online.hcmute.edu.vn/; Mục: Tra cứu văn bằng,Cần trả lời trực tiếp liên hệ số đt: 08 37221223 (sau khi nghe tiếng tổng đài nhấn số  48129)."
         ]
      },
      {
         "tag": "matbangtotnghiep",
         "patterns": [
            "Khi bị mất bằng tốt nghiệp hoặc bằng tốt nghiệp bị hỏng, phải thực hiện thủ tục gì?",
            "Hướng dẫn quy trình khi bị mất hoặc hỏng bằng tốt nghiệp không?",
            "Có cách nào để làm lại bằng tốt nghiệp khi bị mất hoặc hỏng không?",
            "Thủ tục khi bị mất hoặc hỏng bằng tốt nghiệp là gì?",
            "Có những bước cụ thể nào mà sinh viên cần tuân theo khi muốn làm lại bằng tốt nghiệp?",
            "Có cách nào để yêu cầu làm lại bằng tốt nghiệp một cách nhanh chóng không?",
            "Có yêu cầu đặc biệt nào khi làm lại bằng tốt nghiệp không?",
            "Quy định về việc làm lại bằng tốt nghiệp khi bị mất hoặc hỏng được quy định như thế nào?"
         ],
         "responses": [
            "Người học có thể trực tiếp yêu cầu cấp bản sao từ sổ gốc văn bằng, chứng chỉ hoặc ủy quyền hợp pháp cho người khác.Điện thoại: (08) 37221223 (chờ lời giới thiệu, nhấn tiếp số 4, sau đó nhấn số nội bộ 8129)  "
         ]
      },
      {
         "tag": "phatbangchinhthuc",
         "patterns": [
            "Sinh viên đã tốt nghiệp nhưng chưa nhận bằng vào đợt phát bằng chính thức sẽ nhận bằng vào ngày nào?",
            "thông tin về ngày dự kiến phát bằng chính thức cho sinh viên đã tốt nghiệp không?",
            "Quy định về ngày phát bằng chính thức cho sinh viên đã tốt nghiệp là gì?",
            "Sinh viên đã tốt nghiệp nhưng chưa nhận bằng sẽ có cơ hội nhận bằng vào thời gian nào?",
            "Quy định về ngày phát bằng chính thức cho sinh viên đã tốt nghiệp được quy định như thế nào?"
         ],
         "responses": [
            "Sinh viên liên hệ Phòng Đào tạo (A1-202) vào thứ 4 hàng tuần để nhận bằng tốt nghiệp (Sinh viên nhớ mang theo chứng minh nhân dân)."
         ]
      },
      {
         "tag": "phatbangchinhthuc",
         "patterns": [
            "Khi không thể trực tiếp đến nhận bằng tốt nghiệp, thủ tục làm sao?",
            "Thầy/cô có thể hướng dẫn cách xác nhận đại diện để nhận bằng tốt nghiệp không?",
            "Quy trình xác nhận đại diện để nhận bằng tốt nghiệp như thế nào?",
            "Có những bước cụ thể nào khi không thể đến trực tiếp nhận bằng tốt nghiệp?",
            "Thủ tục khi không có thể mặt trực tiếp để nhận bằng tốt nghiệp là gì?",
            "Có cách nào khác để nhận bằng tốt nghiệp khi không thể trực tiếp đến không?",
            "Thường người ta thực hiện thủ tục xác nhận đại diện để nhận bằng tốt nghiệp bằng cách nào?",
            "Có cần phải đáp ứng điều kiện nào khác ngoài việc xác nhận đại diện không?"
         ],
         "responses": [
            "Sinh viên có thể ủy quyền cho người khác đến nhận (giấy ủy quyền có xác nhận của địa phương nơi cư trú)"
         ]
      },
      {
         "tag": "tamdunghoctap",
         "patterns": [
            "Về việc tạm dừng học tập có thời hạn, thủ tục làm sao?",
            "Quy trình tạm dừng học tập có thời hạn không?",
            "Quy định về thời hạn khi tạm dừng học tập là gì?",
            "Có những bước cụ thể nào khi tạm dừng học tập có thời hạn?",
            "Thủ tục khi tạm dừng học tập với thời hạn là gì?",
            "Có cách nào khác để nhận bằng tốt nghiệp khi không thể trực tiếp đến không?",
            "Thường người ta thực hiện thủ tục tạm dừng học tập có thời hạn bằng cách nào?",
            "Có cách nào khác để tạm dừng học tập với thời hạn không?"
         ],
         "responses": [
            "SV được phép tạm dừng học tập khi có lý do chính đáng; Thời gian tạm dừng tính vào thời gian đào tạo (trừ trường hợp tạm dừng để thi hành nghĩa vụ quân sự, hoặc có lý do chính đáng theo quy định của quy chế); Thời gian tạm dừng tối đa bằng thời gian kéo dài của khóa học. Mỗi lần tạm dừng từ 1 đến 2 học kỳ. Hai lần tạm dừng không được liền kề nhau trừ các trường hợp đặc biệt, nhà trường sẽ xem xét cụ thể."
         ]
      },
      {
         "tag": "phitamdunghoctap",
         "patterns": [
            "Xin thông tin về quy định đóng học phí khi tạm dừng học tập?",
            "Quy trình đóng học phí khi sinh viên tạm dừng học không?",
            "Quy định về việc đóng học phí khi tạm dừng học tập là gì?",
            "Thủ tục đóng học phí khi tạm dừng học tập như thế nào?",
            "Quy định về thủ tục đóng học phí khi tạm dừng học tập được quy định như thế nào?",
            "Thầy/cô có thông tin về các yêu cầu cần thiết khi đóng học phí khi tạm dừng học không?"
         ],
         "responses": [
            "SV Nộp đơn trước khi học kỳ bắt đầu: Không phải đóng học phí; SV Nộp đơn trong tuần 1 & 2 mỗi học kỳ: Được rút môn học (RT), đóng 20% học phí học kỳ; Nộp đơn trong tuần 3 & 4 mỗi học kỳ: Được rút môn học (RT), đóng 50% học phí học kỳ; Nộp đơn sau tuần thứ 4 mỗi học kỳ: Được rút môn học (RT), đóng 100% học phí học kỳ."
         ]
      },
      {
         "tag": "quydinhhocphikythuat",
         "patterns": [
            "Xin thông tin về quy định mức thu học phí cho khối ngành kỹ thuật theo Nghị định?",
            "mức thu học phí cho các ngành kỹ thuật theo quy định của Nghị định không?",
            "Quy định về mức thu học phí cho khối ngành kỹ thuật được quy định như thế nào trong Nghị định?",
            "Thủ tục áp dụng để xác định mức thu học phí cho khối ngành kỹ thuật theo Nghị định là gì?",
            "Quy định về mức thu học phí cho khối ngành kỹ thuật trong Nghị định",
            "Thường người ta thực hiện thủ tục xác định mức thu học phí cho khối ngành kỹ thuật theo Nghị định như thế nào?"
         ],
         "responses": [
            "Đối với sinh viên đại trà thì học phí 693k cho 1 chỉ. Đối với sinh viên clc 800k đến 900k trên 1 tín chỉ "
         ]
      },
      {
         "tag": "quydinhhocphi",
         "patterns": [
            "Em muốn biết về mức thu học phí của trường, thông tin được cung cấp như thế nào?",
            "Thầy/cô có thể cho em biết về mức thu học phí của trường không?",
            "Quy định về mức thu học phí của trường là gì?",
            "Quy định về mức thu học phí của trường có được công bố công khai không?",
            "Thủ tục áp dụng để xác định mức thu học phí của trường là gì?"
         ],
         "responses": [
            "Vào đầu năm học, căn cứ quy định hiện hành của Nhà nước, Hiệu trưởng công bố mức thu học phí của các hệ, bậc đào tạo trong toàn trường. Trường ta thu học phí theo tín chỉ, nếu quy về hệ niên chế tương đương như mức thu theo Nghị định 49"
         ]
      },
      {
         "tag": "tgianhocphi",
         "patterns": [
            "Em muốn biết về quy định của nhà trường về thời gian thu học phí",
            "Quy định của nhà trường về thời gian thu học phí không?",
            "Quy định về mức thu học phí của trường là gì?",
            "Thầy/cô có thể cung cấp thông tin về lịch trình thu học phí của nhà trường không?",
            "Thời điểm nào trong năm học thường được chọn để thu học phí?"
         ],
         "responses": [
            "Mỗi học kỳ thu 2 đợt (trừ diện đăng ký nộp theo tháng). Đợt I: kéo dài 1,5 tháng tính từ đầu mỗi học kỳ; đợt II: kéo dài 1,5 tháng tính từ giữa học kỳ đến trước 01 tuần bắt đầu kỳ thi của mỗi học kỳ"
         ]
      },
      {
         "tag": "gianhanhocphi",
         "patterns": [
            "Liệu sinh viên có được phép gia hạn thời gian đóng học phí không?",
            "Quy định về việc gia hạn thời gian đóng học phí của sinh viên là gì?",
            "Thời gian gia hạn đóng học phí được quy định như thế nào?",
            "Sinh viên cần tuân theo những điều kiện nào để được phép gia hạn thời gian đóng học phí?",
            "Thầy/cô có thông tin về cách thức đăng ký gia hạn thời gian đóng học phí không?",
            "Thường người ta thực hiện thủ tục gia hạn thời gian đóng học phí của sinh viên như thế nào?"
         ],
         "responses": [
            "SV được phép gia hạn thời gian nộp học phí. Để được xét gia hạn, SV làm đơn theo mẫu nộp phòng Kế hoạch-Tài chính chậm nhất trước ngày hết hạn thu học phí một tuần (theo đợt)."
         ]
      },
      {
         "tag": "kyluathocphi",
         "patterns": [
            "Xin cho biết quy định của trường về xử lý kỷ luật đối với sinh viên vi phạm quy định đóng học phí?.",
            "Em muốn biết về quy định của trường về xử lý kỷ luật đối với sinh viên vi phạm quy định đóng học phí, thông tin được cung cấp như thế nào?",
            "Quy định về xử lý kỷ luật đối với sinh viên vi phạm quy định đóng học phí của trường là gì?",
            "Thủ tục áp dụng để xử lý kỷ luật đối với sinh viên vi phạm quy định đóng học phí là gì?",
            "Có những biện pháp kỷ luật nào được áp dụng khi sinh viên vi phạm quy định đóng học phí?",
            "Có những biện pháp nào được áp dụng khi sinh viên không tuân thủ quy định về đóng học phí của trường?"
         ],
         "responses": [
            "Khiển trách trước toàn trường đối với SV không đóng học phí đợt I đúng quy định (SV không đóng học phí hoặc đóng chưa đủ mức tối thiểu của đợt I do Hiệu trưởng quy định vào đầu mỗi năm học), hoặc đóng học phí đợt I nhưng không đóng học phí đợt II. Cảnh cáo trước toàn trường đối với SV không đóng học phí đợt I đúng quy định và không đóng học phí đợt II. Xóa tên khỏi danh sách SV đối với các trường hợp còn nợ học phí, nghỉ học không phép quá quy định (từ một học kỳ)."
         ]
      },
      {
         "tag": "dangkymonhoc",
         "patterns": [
            "sinh viên còn nợ học phí có được đăng ký môn học không?",
            "Quy định về việc đăng ký môn học đối với sinh viên còn nợ học phí là gì?",
            "Sinh viên còn nợ học phí cần tuân theo những điều kiện nào để được phép đăng ký môn học?",
            "Có thủ tục cụ thể nào khi sinh viên còn nợ học phí muốn đăng ký môn học không?",
            "thông tin về việc xử lý đăng ký môn học đối với sinh viên còn nợ học phí không?",
            "Quy định về việc đăng ký môn học của sinh viên còn nợ học phí được công bố công khai không?",
            "Quy định về đăng ký môn học của sinh viên còn nợ học phí được áp dụng như thế nào trong thực tế?",
            "Có những điều kiện gì khác mà sinh viên cần thực hiện khi muốn đăng ký môn học mặc dù còn nợ học phí?"
         ],
         "responses": [
            "SV không được ĐKMH nếu còn nợ học phí của học kỳ trước (đưa ra khỏi danh sách SV học kỳ). Trong tuần ĐKMH, SV hoàn tất học phí nợ, trường cho phép khôi phục tên và được ĐKMH. SV hoàn tất học phí nợ sau khi hết hạn ĐKMH, được phép làm đơn xin tạm dừng học tập bảo lưu kết quả. "
         ]
      },
      {
         "tag": "hocphimonngoaichinhtrinh",
         "patterns": [
            "Em muốn đăng ký học thêm các môn ngoài chương trình đào tạo thì em có được miễn học phí không?",
            "sinh viên muốn đăng ký học thêm các môn ngoài chương trình đào tạo có được miễn học phí không?",
            "Sinh viên muốn đăng ký học thêm các môn ngoài chương trình đào tạo cần tuân theo những điều kiện nào để được miễn học phí?",
            "Có thủ tục cụ thể nào khi sinh viên muốn đăng ký học thêm các môn ngoài chương trình đào tạo muốn được miễn học phí không?",
            "Có những điều kiện gì mà sinh viên cần thực hiện để được miễn học phí khi đăng ký học thêm các môn ngoài chương trình?",
            "Quy định về việc miễn học phí cho sinh viên đăng ký học thêm các môn ngoài chương trình được công bố công khai không?"
         ],
         "responses": [
            "Sinh viên thuộc hệ sư phạm sẽ được miễn học phí học lần đầu các môn học trong chương trình đào tạo. Nếu em đăng ký thêm các môn học khác ngoài chương trình thì em phải đóng học phí bằng mức phí học lại. Em có thể đăng ký học cùng lúc 2 chương trình đào tạo và khi ra trường thì nhận 2 bằng tốt nghiệp. Học ngành hai em phải đóng học phí, mức phí theo quy định của nhà trường"
         ]
      },
      {
         "tag": "vanbangiamhocphi",
         "patterns": [
            "Xin cho biết các văn bản pháp quy liên quan đến miễn, giảm học phí?.",
            "Thầy/cô có thể cho em biết về các văn bản pháp quy liên quan đến việc miễn, giảm học phí không?",
            "Những văn bản pháp quy nào định rõ các chính sách về miễn, giảm học phí của trường?",
            "Có thông tin về các quyết định, nghị định, hoặc thông tư nào mà sinh viên cần tham khảo về việc miễn, giảm học phí không?",
            "Thầy/cô có thể cung cấp danh sách các văn bản pháp quy liên quan đến miễn, giảm học phí không?",
            "Có quy định cụ thể nào trong các văn bản pháp quy mà sinh viên cần tuân theo khi xin miễn, giảm học phí không?"
         ],
         "responses": [
            "Nghị định số 49/2010/NĐ-CP ngày 14/5/2010 của Chính phủ quy định về miễn, giảm học phí, hỗ trợ chi phí học tập và cơ chế thu, sử dụng học phí đối với cơ sở giáo dục thuộc hệ thống giáo dục quốc dân từ năm học 2010-2011 đến năm học 2014-2015; Nghị định số 74/2013/NĐ-CP ngày 15/7/2013 của Chính phủ về sửa đổi, bổ sung một số điều của Nghị định số 49/2010/NĐ-CP; Thông tư Liên tịch số 20/2014/TTLT-BGDĐT-BTC-BLĐTBXH ngày 30/5/2014 Hướng dẫn thực hiện Nghị định 49/2010/NĐ-CP & Nghị định 74/2013/NĐ-CP."
         ]
      },
      {
         "tag": "miengiam100%",
         "patterns": [
            "Xin cho biết các đối tượng được miễn học phí?.",
            "Thầy/cô có thể cho em biết về các đối tượng được miễn học phí không?",
            "Quy định về các đối tượng được miễn học phí được áp dụng như thế nào?",
            "Có những đối tượng nào được ưu tiên được miễn học phí theo chính sách của trường?",
            "Thầy/cô có thông tin về các đối tượng được hưởng chính sách miễn học phí không?",
            "Có quy định cụ thể nào về các đối tượng được miễn học phí mà em cần phải biết không?",
            "Đối tượng nào được ưu tiên xét miễn học phí theo quy định của trường?",
            "Đối tượng nào thường được ưu tiên xét miễn học phí theo chính sách của trường?"
         ],
         "responses": [
            "Người có công với cách mạng và thân nhân của người có công với cách mạng,Anh hùng Lực lượng vũ trang nhân dân, Anh hùng Lao động trong kháng chiến; thương binh, người hưởng chính sách như thương binh, thương binh loại B; con của người hoạt động cách mạng trước ngày 01/01/1945,SV mồ côi cả cha lẫn mẹ không nơi nương tựa. SV bị tàn tật, khuyết tật có khó khăn về kinh tế. SV là người dân tộc thiểu số thuộc hộ nghèo hoặc hộ cận nghèo theo quy định của Thủ tướng Chính phủ. SV là người dân tộc thiểu số rất ít người, ở vùng có điều kiện kinh tế - xã hội khó khăn và đặc biệt khó khăn "
         ]
      },
      {
         "tag": "miengiam50%",
         "patterns": [
            "Xin cho biết các đối tượng được miễn 50% học phí?.",
            "Thầy/cô có thể cho em biết về các đối tượng được miễn 50% học phí không?",
            "Quy định về các đối tượng được miễn 50% học phí được áp dụng như thế nào?",
            "Có những đối tượng nào được ưu tiên được miễn 50% học phí theo chính sách của trường?",
            "Thầy/cô có thông tin về các đối tượng được hưởng chính sách miễn 50% học phí không?",
            "Có quy định cụ thể nào về các đối tượng được miễn 50% học phí mà em cần phải biết không?",
            "Đối tượng nào được ưu tiên xét miễn 50% học phí theo quy định của trường?",
            "Đối tượng nào thường được ưu tiên xét miễn 50% học phí theo chính sách của trường?"
         ],
         "responses": [
            "SV là con cán bộ, công nhân, viên chức mà cha hoặc mẹ bị tai nạn lao động hoặc mắc bệnh nghề nghiệp được hưởng trợ cấp thường xuyên"
         ]
      },
      {
         "tag": "miengiam70%",
         "patterns": [
            "Xin cho biết các đối tượng được miễn 70% học phí?.",
            "Thầy/cô có thể cho em biết về các đối tượng được miễn 70% học phí không?",
            "Quy định về các đối tượng được miễn 70% học phí được áp dụng như thế nào?",
            "Có những đối tượng nào được ưu tiên được miễn 70% học phí theo chính sách của trường?",
            "Thầy/cô có thông tin về các đối tượng được hưởng chính sách miễn 70% học phí không?",
            "Có quy định cụ thể nào về các đối tượng được miễn 70% học phí mà em cần phải biết không?",
            "Đối tượng nào được ưu tiên xét miễn 70% học phí theo quy định của trường?",
            "Đối tượng nào thường được ưu tiên xét miễn 70% học phí theo chính sách của trường?"
         ],
         "responses": [
            "Việc giảm 70% học phí cho học sinh học các nghề nặng nhọc, độc hại chỉ áp dụng cho hệ thống các trường nghề thuộc Bộ Lao động Thương binh & xã hội. SV học các ngành của trường Đại học SPKT Tp. Hồ Chí Minh không thuộc diện giảm 70% học phí"
         ]
      },
      {
         "tag": "trocapgiaoduc",
         "patterns": [
            "Xin cho biết các đối tượng được hưởng trợ cấp ưu đãi trong giáo dục, đào tạo?.",
            "Thầy/cô có thể cho em biết về các đối tượng được hưởng trợ cấp ưu đãi trong giáo dục, đào tạo không?",
            "Quy định về các đối tượng được hưởng trợ cấp ưu đãi trong lĩnh vực giáo dục, đào tạo được áp dụng như thế nào?",
            "Có những đối tượng nào được ưu tiên được hưởng các chính sách trợ cấp trong giáo dục, đào tạo?",
            "Thầy/cô có thông tin về các đối tượng được hưởng trợ cấp ưu đãi trong lĩnh vực giáo dục, đào tạo không?",
            "Có quy định cụ thể nào về các đối tượng được hưởng trợ cấp ưu đãi mà em cần phải biết không?",
            "Đối tượng nào được ưu tiên xét hưởng trợ cấp ưu đãi theo quy định của trường?",
            "Đối tượng nào thường được ưu tiên xét hưởng trợ cấp ưu đãi theo chính sách của trường?"
         ],
         "responses": [
            "Các đối tượng được hưởng trợ cấp ưu đãi trong giáo dục, đào tạo: SV là anh hùng lực lượng vũ trang, anh hùng lao động, thương binh, hưởng chính sách như thương binh; SV là con liệt sỹ, con thương binh, con của bệnh binh, con của người hưởng chính sách như thương binh…"
         ]
      },
      {
         "tag": "sotrocap",
         "patterns": [
            "Để được cấp sổ ưu đãi trong giáo dục, đào tạo, SV phải làm thủ tục gì?.",
            "thủ tục gì để được cấp sổ ưu đãi trong giáo dục, đào tạo không?",
            "Quy trình cụ thể nào mà sinh viên cần tuân theo khi muốn được cấp sổ ưu đãi trong lĩnh vực giáo dục, đào tạo?",
            "Có những bước nào SV cần thực hiện để xin được cấp sổ ưu đãi trong giáo dục, đào tạo?",
            "thông tin về thủ tục cụ thể mà sinh viên phải thực hiện để nhận được sổ ưu đãi không?",
            "Có quy định nào về việc làm thủ tục để được cấp sổ ưu đãi trong lĩnh vực giáo dục, đào tạo không?",
            "Quy trình xin cấp sổ ưu đãi trong giáo dục, đào tạo được thực hiện như thế nào?",
            "Có những giấy tờ cần thiết nào mà SV cần chuẩn bị khi làm thủ tục để được cấp sổ ưu đãi?",
            "Sổ ưu đãi trong giáo dục, đào tạo được cấp theo quy trình nào?"
         ],
         "responses": [
            "SV liên hệ Phòng Lao động Thương binh & Xã hội địa phương (nơi đăng ký hộ khẩu thường trú) để được hướng dẫn làm các thủ tục & nhận sổ ưu đãi giáo dục, đào tạo."
         ]
      },
      {
         "tag": "tientrocap",
         "patterns": [
            "Để được nhận tiền ưu đãi trong giáo dục, đào tạo, SV phải làm thủ tục gì?.",
            "thủ tục gì để được cấp nhận tiền ưu đãi trong giáo dục, đào tạo không?",
            "Quy trình cụ thể nào mà sinh viên cần tuân theo khi muốn được cấp nhận tiền ưu đãi trong lĩnh vực giáo dục, đào tạo?",
            "Có những bước nào SV cần thực hiện để xin được cấp nhận tiền ưu đãi trong giáo dục, đào tạo?",
            "thông tin về thủ tục cụ thể mà sinh viên phải thực hiện để nhận được nhận tiền ưu đãi không?",
            "Có quy định nào về việc làm thủ tục để được cấp nhận tiền ưu đãi trong lĩnh vực giáo dục, đào tạo không?",
            "Quy trình xin cấp nhận tiền ưu đãi trong giáo dục, đào tạo được thực hiện như thế nào?",
            "Có những giấy tờ cần thiết nào mà SV cần chuẩn bị khi làm thủ tục để được cấp nhận tiền ưu đãi?",
            "nhận tiền ưu đãi trong giáo dục, đào tạo được cấp theo quy trình nào?"
         ],
         "responses": [
            "SV liên hệ Phòng Lao động Thương binh & Xã hội địa phương (nơi đăng ký hộ khẩu thường trú) để được hướng dẫn làm các thủ tục & nhận sổ ưu đãi giáo dục, đào tạo."
         ]
      },
      {
         "tag": "trocapxahoi",
         "patterns": [
            "Xin cho biết các đối tượng được hưởng trợ cấp xã hội và mức trợ cấp hàng tháng?",
            "Thầy/cô có thể cho em biết về các đối tượng được trợ cấp xã hội và mức trợ cấp hàng tháng không?",
            "Quy định về các đối tượng được trợ cấp xã hội và mức trợ cấp hàng tháng được áp dụng như thế nào?",
            "Có những đối tượng nào được ưu tiên trợ cấp xã hội và mức trợ cấp hàng tháng theo chính sách của trường?",
            "Thầy/cô có thông tin về các đối tượng được hưởng chính sáchtrợ cấp xã hội và mức trợ cấp hàng tháng không?",
            "Có quy định cụ thể nào về các đối tượng được trợ cấp xã hội và mức trợ cấp hàng tháng mà em cần phải biết không?",
            "Đối tượng nào được ưu tiên xét trợ cấp xã hội và mức trợ cấp hàng tháng theo quy định của trường?",
            "Đối tượng nào thường được ưu tiên xét trợ cấp xã hội và mức trợ cấp hàng tháng theo chính sách của trường?"
         ],
         "responses": [
            "Có bốn đối tượng được hưởng trợ cấp xã hội với mức trợ cấp hàng tháng như sau: SV là người dân tộc thiểu số có hộ khẩu thường trú từ 3 năm trở lên tại vùng đặc biệt khó khăn theo quy định của Nhà nước (a), mức trợ cấp: 140.000đ/tháng; SV mồ côi cả cha lẫn mẹ, không nơi nương tựa và có hoàn cảnh kinh tế khó khăn (b); SV bị tàn tật giảm khả năng lao động từ 41% trở lên, có hoàn cảnh kinh tế khó khăn (C); SV thuộc gia đình hộ đói (d), mức trợ cấp đều là: 100.000đ/tháng"
         ]
      },
      {
         "tag": "quengiamhocphi",
         "patterns": [
            "Em thuộc diện được miễn giảm học phí, nhưng sao học kỳ hè em không được miễn giảm?",
            "Tại sao sinh viên thuộc diện được miễn giảm học phí không được miễn giảm trong học kỳ hè không?",
            "Tại sao sinh viên được miễn giảm học phí lại không được áp dụng chính sách miễn giảm trong học kỳ hè?",
            "Quy định về việc miễn giảm học phí trong học kỳ hè có áp dụng cho tất cả sinh viên được miễn giảm học phí không?",
            "Tại sao không áp dụng chính sách miễn giảm học phí trong học kỳ hè cho sinh viên thuộc diện được miễn giảm học phí?"
         ],
         "responses": [
            "Em nên liên hệ Phòng Công tác học sinh, sinh viên để được giải quyết. Những trường hợp bị sót, P.TS%CTSV và phòng Đào tạo sẽ phối hợp điều chỉnh học phí cho em"
         ]
      },
      {
         "tag": "giaytotrocap",
         "patterns": [
            "Để được hưởng trợ cấp xã hội, sinh viên phải nộp hồ sơ gồm các giấy tờ gì?.",
            "Thầy/cô có thể giúp em biết sinh viên cần nộp những giấy tờ gì khi muốn được hưởng trợ cấp xã hội không?",
            "Quy trình nộp hồ sơ để được hưởng trợ cấp xã hội bao gồm những bước nào và giấy tờ cần thiết là gì?",
            "Có những giấy tờ cụ thể nào mà sinh viên cần phải chuẩn bị khi nộp hồ sơ để đăng ký trợ cấp xã hội?",
            "các loại giấy tờ cần thiết mà sinh viên phải có khi làm thủ tục đăng ký trợ cấp xã hội không?",
            "Có quy định cụ thể nào về việc chuẩn bị hồ sơ và giấy tờ khi muốn đăng ký nhận trợ cấp xã hội không?",
            "Quy trình xác định giấy tờ cần thiết để đăng ký nhận trợ cấp xã hội như thế nào?"
         ],
         "responses": [
            "SV phải nộp hồ sơ, gồm: Đơn xét hưởng trợ cấp xã hội theo mẫu (nhận mẫu đơn tại phòng Tuyển sinh và CTSV hoặc downloat trên mạng của phòng); Bản sao giấy khai sinh;Bản sao hộ khẩu, giấy xác nhận của địa phương về thời gian thường trú (đối tượng mục a); giấy chứng tử của cha mẹ (đối tượng mục b); biên bản giám định của Hội đồng Y khoa cấp tỉnh, thành phố trực thuộc Trung ương (đối tượng mục c); giấy xác nhận của địa phương về hoàn cảnh kinh tế gia đình khó khăn (đối tượng mục b,c); sổ hộ đói (đối tượng mục d)."
         ]
      },
      {
         "tag": "tgiannoptrocap",
         "patterns": [
            "Xin cho biết địa điểm, thời gian nộp hồ sơ?",
            "Xin thông tin về nơi và thời gian nộp hồ sơ.",
            "Thầy/cô có thể chỉ dẫn về địa điểm và thời gian nộp hồ sơ không?",
            "Em cần biết địa chỉ và thời gian nộp hồ sơ.",
            "Thầy/cô có thông tin về địa điểm và thời gian nộp hồ sơ không?",
            "Cho em xin địa điểm và thời gian nộp hồ sơ.",
            "Em muốn biết nơi và thời gian nộp hồ sơ phù hợp.",
            "Thầy/cô có thể cung cấp thông tin về địa điểm và thời gian nộp hồ sơ không?",
            "Em đang tìm hiểu về địa điểm và thời gian nộp hồ sơ.",
            "Xin thông tin về địa điểm và thời gian nộp hồ sơ cho sinh viên.",
            "Thầy/cô có thể chia sẻ thông tin về nơi và thời gian nộp hồ sơ không?"
         ],
         "responses": [
            "SV nộp hồ sơ xét trợ cấp xã hội vào 02 tháng đầu mỗi học kỳ tại khoa/TT. Các khoa/TT xét, lập danh sách & chuyển hồ sơ về phòng Tuyển sinh và CTSV vào đầu tháng 3 và tháng 11 hàng năm. Việc nhận và xét hồ sơ hưởng trợ cấp xã hội cho SV được tiến hành theo từng học kỳ. SV hoàn tầt hồ sơ ở học kỳ nào, được hưởng trợ cấp xã hội từ học kỳ đó trở đi. Không giải quyết truy hưởng của học kỳ trước"
         ]
      },
      {
         "tag": "SVnhantientrocap",
         "patterns": [
            "Mỗi học kỳ, SV được nhận tiền hưởng trợ cấp xã hội là mấy tháng?.",
            "Trong một học kỳ, sinh viên thường nhận bao nhiêu tháng tiền trợ cấp xã hội?",
            "số tháng trợ cấp xã hội mà sinh viên thường được nhận trong mỗi kỳ học không?",
            "Mỗi học kỳ, bao nhiêu tháng tiền trợ cấp xã hội được cấp cho sinh viên?",
            "Trong một học kỳ học, sinh viên thường được nhận bao nhiêu tháng tiền trợ cấp xã hội?",
            "Sinh viên thường nhận được bao nhiêu tháng trợ cấp xã hội trong mỗi kỳ học?",
            "Trong mỗi kỳ học, số tháng tiền trợ cấp xã hội mà SV thường được nhận là bao nhiêu?",
            "Sinh viên thường được hưởng bao nhiêu tháng tiền trợ cấp xã hội trong mỗi học kỳ?",
            "Mỗi kỳ học, số tháng tiền trợ cấp xã hội mà sinh viên được nhận là bao nhiêu?",
            "Thầy/cô có thông tin về số tháng tiền trợ cấp xã hội mà sinh viên thường được nhận trong mỗi kỳ học không?"
         ],
         "responses": [
            "SV được nhận tiền hưởng trợ cấp xã hội 06 tháng/học kỳ; 12 tháng/năm. "
         ]
      },
      {
         "tag": "điaiemnhantrancap",
         "patterns": [
            "sinh viên nhận tiền trợ cấp xã hội tại trường hay ở địa phương?.",
            "Tiền trợ cấp xã hội dành cho sinh viên được nhận từ trường hay địa phương?",
            "Sinh viên nhận tiền trợ cấp xã hội từ trường học hay từ chính quyền địa phương?",
            "Tiền trợ cấp xã hội cho sinh viên được cấp ở trường hay ở địa phương?",
            "Sinh viên nhận tiền trợ cấp xã hội thông qua trường học hay ở địa phương?",
            "Tiền trợ cấp xã hội được ở trường học hay cở địa phương?",
            "Sinh viên được nhận tiền trợ cấp xã hội từ trường hay ở địa phương?"
         ],
         "responses": [
            "SV nhận trợ cấp xã hội tại Trường, không nhận ở địa phương. Phòng Kế hoạch Tài chính thực hiện việc chi trợ cấp xã hội qua tài khoản Ngân hàng của SV. "
         ]
      },
      {
         "tag": "trocapsinhvien",
         "patterns": [
            "Hàng năm trường có trợ cấp cho sinh viên ngoài trợ cấp của nhà nước không?.",
            "Hàng năm trường có cung cấp các loại hỗ trợ tài chính khác cho sinh viên ngoài trợ cấp chính phủ không?",
            "Trường có tổ chức các chương trình hỗ trợ tài chính đặc biệt cho sinh viên hàng năm không?",
            "Hàng năm, trường có tiến hành các biện pháp hỗ trợ tài chính cho sinh viên không",
            "Trường có cung cấp các khoản hỗ trợ tài chính bổ sung cho sinh viên mỗi năm không?",
            "Trường có tổ chức các chương trình hỗ trợ tài chính thường niên cho sinh viên không?",
            "Có bất kỳ hình thức hỗ trợ tài chính bổ sung nào được cung cấp cho sinh viên mỗi năm không?"
            
         ],
         "responses": [
            "Hàng năm Nhà trường dành khoảng năm trăm triệu đồng để trợ cấp cho SV có hoàn cảnh khó khăn, SV trong vùng bị thiên tai,…"
         ]
      },
      {
         "tag": "doituongkkhoctap",
         "patterns": [
            "Xin cho biết đối tượng, tiêu chuẩn xét cấp học bổng khuyến khích học tập?.",
            "Thầy/cô có thể chỉ rõ về đối tượng và tiêu chuẩn để được xét cấp học bổng khuyến khích học tập không?",
            "Xin thông tin về những ai và những điều kiện gì được xem xét để nhận học bổng khuyến khích học tập?",
            "Đối tượng và tiêu chuẩn để được xét cấp học bổng khuyến khích học tập là gì?",
            "Có những yếu tố nào quy định ai được cấp học bổng khuyến khích học tập không?",
            "Thầy/cô có thể giải thích về đối tượng và tiêu chuẩn xét cấp học bổng khuyến khích học tập không?",
            "Đối tượng và tiêu chuẩn để được xét cấp học bổng khuyến khích học tập như thế nào?",
            "Xin thông tin về các tiêu chí và nhóm đối tượng  để nhận học bổng khuyến khích học tập.",
            "Có quy định cụ thể nào về ai và điều kiện nào được xét cấp học bổng khuyến khích học tập không?",
            "Các yêu cầu và tiêu chí để được xem xét cấp học bổng khuyến khích học tập là gì?"
         ],
         "responses": [
            "SV hệ chính quy trình độ đại học, cao đẳng học đúng tiến độ; có số tín chỉ đăng ký học & dự thi học kỳ ≥ 15 (trường hợp vì lý do tổ chức đào tạo, cả lớp có số tín chỉ < 15; hoặc ở học kỳ cuối khóa, SV đăng ký hết các môn học mà số tín chỉ vẫn < 15, khoa/TT phối hợp với phòng Tuyển sinh và CTSV trình Hiệu trưởng xem xét quyết định); có kết quả học tập & rèn luyện học kỳ đạt từ loại khá trở lên; không có điểm tổng kết môn học trong học kỳ <5 (đối với các môn Giáo dục Thể chất và Giáo dục Quốc phòng không có điểm thi lần 1 <5); không bị kỷ luật từ mức khiển trách trở lên."
         ]
      },
      {
         "tag": "tienhocbong",
         "patterns": [
            "Xin cho biết mức (suất/tháng) học bổng khuyến khích học tập của từng loại là bao nhiêu?.",
            "số tiền học bổng khuyến khích học tập được cấp cho mỗi loại là bao nhiêu tiền mỗi tháng không?",
            "Xin thông tin về mức độ tiền học bổng khuyến khích học tập của từng loại được cấp mỗi tháng?",
            "Số tiền học bổng khuyến khích học tập được cung cấp cho từng loại là bao nhiêu tiền mỗi tháng?",
            "Thầy/cô có thông tin về số tiền học bổng khuyến khích học tập của từng loại không?",
            "Xin hỏi về mức học bổng khuyến khích học tập của từng loại là bao nhiêu tiền mỗi tháng?",
            "Có quy định cụ thể về số tiền học bổng khuyến khích học tập được cấp cho mỗi loại không?",
            "Mức độ tiền học bổng khuyến khích học tập được cấp cho từng loại là bao nhiêu tiền mỗi tháng?",
            "Xin thông tin về số tiền học bổng khuyến khích học tập mà từng loại được cấp mỗi tháng?",
            "Mỗi loại học bổng khuyến khích học tập được cấp mức độ tiền là bao nhiêu tiền mỗi tháng?"
         ],
         "responses": [
            "Mức học bổng đang áp dụng tại Trường như sau: loại khá: 650.000đ/tháng/suất với trình độ đào tạo đại học; 500.000đ/tháng/suất với trình độ đào tạo cao đẳng. Học bổng loại khá được cấp cho những SV có điểm trung bình chung học tập xếp hạng khá trở lên (từ 7,00 điểm trở lên), điểm rèn luyện đạt loại khá trở lên (từ 70 điểm trở lên) và nằm trong chỉ tiêu quỹ học bổng cho phép. Mức học bổng loại giỏi: 800.000đ/tháng/suất với trình độ đào tạo đại học; 650.000đ/tháng/suất với trình độ đào tạo cao đẳng. Học bổng loại giỏi được cấp cho những SV có điểm trung bình chung học tập xếp hạng giỏi (từ 8,50 đến 10 điểm), điểm rèn luyện đạt loại xuất sắc (từ 90 đến 100 điểm) và nằm trong chỉ tiêu quỹ học học bổng cho phép"
         ]
      },
      {
         "tag": "quytrinhxethocbong",
         "patterns": [
            "Xin cho biết đối tượng, tiêu chuẩn & quy trình xét cấp học bổng tài trợ?.",
            "Xin thông tin chi tiết về các tiêu chuẩn và quy trình xét cấp học bổng tài trợ?",
            "cung cấp thông tin về đối tượng và tiêu chuẩn để được xét cấp học bổng tài trợ không?",
            "Có quy định cụ thể về đối tượng và tiêu chuẩn để được xét cấp học bổng tài trợ không?",
            "Xin hỏi về đối tượng và tiêu chuẩn được sử dụng trong quá trình xét cấp học bổng tài trợ?",
            "Có quy định nào về đối tượng và tiêu chuẩn được áp dụng khi xét cấp học bổng tài trợ không?",
            "Xin thông tin về các tiêu chuẩn và quy trình mà sinh viên phải tuân thủ khi xin cấp học bổng tài trợ.",
            "Có điều kiện cụ thể nào mà sinh viên phải đáp ứng để được xem xét cấp học bổng tài trợ không?"
         ],
         "responses": [
            "Đối tượng xét cấp, ưu tiên SV có hoàn cảnh khó khăn, đạt kết quả cao trong học tập, rèn luyện. Tiêu chí cụ thể do đơn vị tài trợ học bổng đề xuất. Chỉ tiêu, cấp theo khoa/TT và yêu cầu của đơn vị tài trợ (nếu có). Quy trình: SV nộp hồ xin xét, cấp học bổng tài trợ tại khoa/TT; Các khoa/TT xét, lập danh sách & chuyển hồ sơ về phòng Tuyển sinh và CTSV trong thời gian quy định; Phòng Tuyển sinh và CTSV tổng hợp và trình Hiệu trưởng xem xét và ra quyết định cấp học bổng tài trợ cho SV."
         ]
      },
      {
         "tag": "hesupham",
         "patterns": [
            "Sinh viên hệ Sư phạm học môn tương đương lần đầu có phải đóng phí không?",
            "Sinh viên hệ Sư phạm khi học môn tương đương lần đầu liệu có phải nộp học phí không?",
            "Khi học môn tương đương lần đầu, sinh viên hệ Sư phạm có phải thanh toán học phí không?",
            "Đối với sinh viên hệ Sư phạm, khi học các môn tương đương lần đầu, liệu có yêu cầu đóng học phí không?",
            "Trong trường hợp học môn tương đương lần đầu, sinh viên hệ Sư phạm có được miễn học phí không?",
            "Liệu sinh viên hệ Sư phạm khi học các môn tương đương lần đầu có phải đóng học phí không?",
            "Khi bắt đầu học môn tương đương lần đầu, sinh viên hệ Sư phạm có yêu cầu phải đóng phí không?",
            "Có quy định nào về việc sinh viên hệ Sư phạm khi học môn tương đương lần đầu phải thanh toán học phí không?",
            "Xin thông tin về chính sách đóng học phí đối với sinh viên hệ Sư phạm khi học các môn tương đương lần đầu."
         ],
         "responses": [
            "Nếu môn học có trong danh mục môn tương đương của Khoa thì Sinh viên hệ sư phạm học môn tương đương lần đầu không phải đóng học phí.Trong trường hợp chương trình tính học phí môn học ngoài chương trình, Sinh viên liên hệ Phòng Đào tạo A1-202 làm đơn khiếu nại. Phòng Đào tạo sẽ xem xét lại môn học tương đương và trả lời theo đơn. Sinh viên nhận lại đơn trong vòng 01 ngày."
         ]
      },
      {
         "tag": "tgianctxh",
         "patterns": [
            "Thời gian để thực hiện tích lũy ngày CTXH trong khóa đào tạo như thế nào?.",
            "Có quy định gì về thời gian để sinh viên tích lũy ngày công tác xã hội trong quá trình học không?",
            "Làm thế nào để sinh viên có thể tích lũy ngày công tác xã hội trong khoảng thời gian đào tạo?",
            "quy trình tích lũy ngày công tác xã hội trong khóa đào tạo được không?",
            "Đối với sinh viên, có những hình thức nào để tích lũy ngày công tác xã hội trong thời gian học tập?",
            "Khi học tại trường, thời gian tích lũy ngày công tác xã hội được quy định như thế nào?",
            "Có những quy định gì về thời gian thực hiện công tác xã hội trong quá trình học không?",
            "Thầy/cô có thể hướng dẫn về cách tích lũy ngày công tác xã hội trong suốt quá trình đào tạo không?",
            "Xin thông tin về cách tính thời gian tích lũy ngày công tác xã hội trong chương trình đào tạo.",
            "Có những quy định nào về thời gian tích lũy ngày công tác xã hội mà sinh viên phải tuân theo?"
         ],
         "responses": [
            "Việc tích lũy ngày CTXH của SV được thực hiện trong suốt khóa học; SV tự quyết định thời gian hoàn tất việc tích lũy số ngày CTXH. Nhà trường khuyến cáo SV không nên để dồn vào cuối khóa.SV tích lũy đủ số ngày CTXH theo quy định, mới được xét công nhận tốt nghiệp."
         ]
      },
      {
         "tag": "quydoictxh",
         "patterns": [
            "Em thường xuyên tham gia các hoạt động CTXH tại địa phương. Vậy làm thể nào để em có thể có điểm CTXH của trường?",
            "cách sinh viên có thể đạt điểm công tác xã hội của trường từ việc tham gia các hoạt động tại địa phương không?",
            "sinh viên có thể kiếm điểm công tác xã hội từ các hoạt động thường xuyên tham gia ở địa phương?",
            "Cách sinh viên có thể thu thập điểm công tác xã hội từ các hoạt động địa phương không?",
            "Làm thế nào để sinh viên có thể ghi nhận điểm công tác xã hội từ các hoạt động tham gia ở địa phương?",
            "Xin hướng dẫn về cách sinh viên có thể kiếm điểm công tác xã hội từ các hoạt động tại địa phương.",
            "Làm sao để sinh viên kiếm điểm công tác xã hội của trường thông qua việc tham gia các hoạt động ở địa phương?"
         ],
         "responses": [
            "Trước khi tham gia hoạt động, đơn vị tổ chức hoạt động tại địa phương phải thông tin bằng văn bản (có chữ ký và đóng dấu) về nhà trường (đầu mối là P. TS&CTSV, Đoàn TN, Hội SV trường) xác nhận sẽ có những SV nào của trường tham gia hoạt động.Trong thời gian hoạt động, đơn vị tổ chức thực hiện chấm công cho SV tham gia hoạt động.Sau khi hoạt động kết thúc, trong thời gian 14 ngày (02 tuần) đơn vị tổ chức hoạt động phải gởi chứng nhận SV tham gia hoạt động (có đánh giá mức độ hoàn thành công việc) và bản chấm công về phòng Tuyển sinh và CTSV để ghi nhận điểm CTXH cho SV."
         ]
      },
      {
         "tag": "diemrenluyen",
         "patterns": [
            "Điểm rèn luyện dùng để làm gì?",
            "Mục đích sử dụng điểm rèn luyện là gì?",
            "Tại sao chúng ta cần có điểm rèn luyện?",
            "Điểm rèn luyện được sử dụng để đánh giá điều gì?",
            "Thầy/cô có thể giải thích ý nghĩa của điểm rèn luyện không?",
            "Điểm rèn luyện được dùng để đo lường và đánh giá những gì?",
            "Có ý nghĩa gì của điểm rèn luyện đối với sinh viên?",
            "Tại trường điểm rèn luyện được sử dụng để làm gì?",
            "Thầy/cô có thể nói về tầm quan trọng của điểm rèn luyện không?"
         ],
         "responses": [
            "Kết quả phân loại rèn luyện toàn khoá học của từng SV được lưu trong hồ sơ quản lý SV của trường và ghi vào bảng điểm kết quả học tập và rèn luyện của từng SV khi ra trường;Kết quả rèn luyện của học kỳ được sử dụng để xét học bổng khuyến khích học tập cho SV trong học kỳ đó;Kết quả rèn luyện của năm học, khóa học được sử dụng để xét khen thưởng năm học, khóa học cho SV;SV được cấp giấy chứng nhận kết quả rèn luyện theo yêu cầu;SV bị xếp loại rèn luyện kém trong cả năm học, phải tạm ngừng học tập một năm ở năm học tiếp theo và nếu bị xếp loại rèn luyện kém cả năm lần thứ hai thì sẽ bị buộc thôi học.."
         ]
      },
      {
         "tag": "donvidrl",
         "patterns": [
            "Những cá nhân, đơn vị nào được phân quyền đánh giá điểm rèn luyện SV?",
            "Ai hoặc đơn vị nào chịu trách nhiệm về việc xác định và ghi nhận điểm rèn luyện của sinh viên?",
            "Có ai hoặc tổ chức nào được giao trách nhiệm trong việc đánh giá và ghi nhận điểm rèn luyện của sinh viên không?",
            "Ai hoặc tổ chức nào có thẩm quyền trong việc xác định và ghi nhận điểm rèn luyện của sinh viên?",
            "Ai được ủy quyền để tiến hành đánh giá và ghi nhận điểm rèn luyện của sinh viên?",
            "Ai có thẩm quyền đánh giá và ghi nhận điểm rèn luyện của sinh viên?",
            "Ai hoặc những tổ chức nào được ủy quyền để thực hiện đánh giá điểm rèn luyện của sinh viên?"
         ],
         "responses": [
            "Các đơn vị quản lý SV và các đơn vị (Phòng, ban, khoa/TT, Đoàn thể) có liên quan đến các hoạt động học tập và rèn luyện của SV đều được phân quyền đánh giá rèn luyện của SV."
         ]
      },
      {
         "tag": "kiemdrl",
         "patterns": [
            "Em là lớp trưởng, em nên làm gì để điểm rèn luyện của em và lớp em được cao?",
            "Làm thế nào để em và lớp trưởng có thể tăng điểm rèn luyện?",
            "Em có thể thực hiện những hành động nào để nâng cao điểm rèn luyện của mình và của lớp?",
            "Những cách nào em có thể thực hiện để đạt điểm rèn luyện cao cho bản thân và cho toàn bộ lớp?",
            "Có gì em có thể thực hiện để đạt điểm rèn luyện cao hơn cho mình và cho toàn bộ lớp không?",
            "Thầy/cô có khuyến nghị nào để lớp trưởng và lớp cải thiện điểm rèn luyện không?",
            "Có cách nào để lớp trưởng cải thiện điểm rèn luyện cho bản thân và cho lớp không?"
         ],
         "responses": [
            "Em nên thường xuyên nắm bắt các thông tin từ các đơn vị trong trường có tổ chức các hoạt động, thông tin các hoạt động đến các bạn SV trong lớp để các bạn tham gia các hoạt động, tích luỹ điểm rèn luyện trong học kỳ.Em nên tham mưu với khoa tổ chức các hoạt động học thuật, phong trào, CTXH để SV tham gia.Quan tâm, phản hồi các hoạt động SV có tham gia mà các đơn vị chưa công nhận, qua đó bảo vệ quyền lợi của các bạn SV."
         ]
      },
      {
         "tag": "chuyennguyenvong",
         "patterns": [
            "Xin cho biết về việc chuyển ngành sau khi thí sinh trúng tuyển, nhập học?.",
            "Sau khi được nhận vào trường, thí sinh có thể thay đổi ngành học được không?",
            "Sau khi nhập học, có cơ hội nào cho thí sinh muốn thay đổi ngành học không?",
            "Người học có thể yêu cầu chuyển ngành sau khi đã đăng ký và bắt đầu học không?",
            "Có quy định gì về việc thí sinh trúng tuyển và nhập học sau đó muốn chuyển ngành không?" ,
            "Quy trình chuyển ngành sau khi thí sinh đã trúng tuyển và nhập học được thực hiện như thế nào?",
            "Thầy/cô có thể hướng dẫn về cách thí sinh có thể chuyển ngành sau khi đã trúng tuyển và nhập học không?",
            "Có qui định nào về việc thí sinh muốn thay đổi ngành học sau khi đã bắt đầu học tại trường không?",
            "Thầy/cô có thể nói về quy trình chuyển ngành sau khi thí sinh trúng tuyển và nhập học không?"
         ],
         "responses": [
            "Trường ĐHSPKT Tp. Hồ Chí Minh tuyển sinh theo ngành, nên không giải quyết cho chuyển ngành sau khi thí sinh trúng tuyển, nhập học. Trường hợp đặc biệt và xin chuyển ngành học tại khoa Đào tạo chất lượng cao, SV làm đơn trình Hiệu trưởng xem xét (với điều kiện cùng khối thi, ngành chuyển đến có điểm chuẩn ≤ điểm chuẩn ngành đã trúng tuyển và còn chỉ tiêu)."
         ]
      },
      {
         "tag": "hoc2chuongtrinh",
         "patterns": [
            "Xin cho biết về việc sinh viên theo học hai chương trình?.",
            "Có quy định nào về việc sinh viên tham gia hai chương trình học không?",
            "Sinh viên có thể tham gia đồng thời hai chương trình học được không?",
            "Có quy trình nào cho sinh viên muốn tham gia hai chương trình học không?",
            "Người học có thể tham gia hai chương trình học cùng một lúc không?",
            "Quy trình tham gia hai chương trình học được thực hiện như thế nào?",
            "Có cơ hội nào cho sinh viên tham gia đồng thời hai chương trình học không?",
            "Sinh viên muốn tham gia hai chương trình học có cần tuân theo các quy định cụ thể nào không?",
            "Thầy/cô có thể hướng dẫn về cách sinh viên có thể tham gia hai chương trình học không?"
         ],
         "responses": [
            "Điều 17, Quy chế 43 quy định chi tiết về việc học song song hai chương trình. Hiện tại, nhà trường áp dụng chế độ học cùng một lúc hai chương trình cho những SV có nhu cầu và hội đủ các điều kiện. SV có nhu cầu, liên hệ phòng Đào tạo để được hướng dẫn."
         ]
      },
      {
         "tag": "vanbang2",
         "patterns": [
            "Xin cho biết về việc sinh viên học văn bằng hai?",
            "Sinh viên có thể tham gia học hai văn bằng không?",
            "Có qui định gì về việc sinh viên theo học hai văn bằng không?",
            "Thầy/cô có thể giải thích về việc sinh viên tham gia học hai văn bằng không?",
            "Có quy trình nào cho sinh viên muốn tham gia học hai văn bằng không?",
            "Có qui định cụ thể nào về việc sinh viên tham gia học hai văn bằng không?",
            "Người học có thể tham gia học hai văn bằng cùng một lúc không?",
            "Quy trình tham gia học hai văn bằng được thực hiện như thế nào?",
            "Có cơ hội nào cho sinh viên tham gia học hai văn bằng không?",
            "Thầy/cô có thể hướng dẫn về cách sinh viên có thể tham gia học hai văn bằng không?" 
         ],
         "responses": [
            "Từ năm học 2008-2009, trường xin phép và được Bộ Giáo dục & Đào tạo chấp thuận cho đào tạo văn bằng hai ngành Công nghệ Thông tin. Các ngành khác chưa xin ý kiến của Bộ, nên chưa triển khai. Dự kiến kiến trong thời gian tới mở thêm một số ngành."
         ]
      },
      {
         "tag": "thithpt",
         "patterns": [
            "Thí sinh tốt nghiệp trước 2023 việc xét tuyển vào Đại học như thế nào?",
            "Quy trình xét tuyển vào Đại học với thí sinh tốt nghiệp trước năm 2023 như thế nào?",
            "Có những yêu cầu nào đối với thí sinh tốt nghiệp trước 2023 khi xét tuyển vào Đại học?",
            "Thí sinh tốt nghiệp trước 2023 khi tham gia quá trình xét tuyển vào Đại học như thế nào?",
            "Có những quy định cụ thể nào về việc xét tuyển vào Đại học đối với thí sinh tốt nghiệp trước năm 2023?",
            "Thí sinh tốt nghiệp trước năm 2023 phải làm gì trong quá trình xét tuyển vào Đại học?"
         ],
         "responses": [
            "Thí sinh đã tốt nghiệp THPT từ các năm trước phải dự thi kỳ thi THPT Quốc gia để được xét tuyển sinh ĐH, CĐ. Khi đăng ký dự thi,  phải thi đủ số môn theo yêu cầu tuyển vào ngành đào tạo do trường ĐH, CĐ quy định. Thí sinh tự do có thể dự thi dự thi vào bất kỳ cụm thi nào thuận tiện nơi mình sinh hoạt"
         ]
      },
      {
         "tag": "monthithpt",
         "patterns": [
            "Thí sinh phải dự thi bao nhiêu môn trong kỳ thi THPT quốc gia?",
            "Kỳ thi THPT quốc gia yêu cầu thí sinh phải tham gia bao nhiêu môn?",
            "Số môn thi mà thí sinh cần phải tham gia trong kỳ thi THPT quốc gia là bao nhiêu?",
            "Có bao nhiêu môn thi thí sinh phải dự trong kỳ thi quốc gia tại THPT?",
            "Trong kỳ thi THPT quốc gia, thí sinh cần phải tham dự bao nhiêu môn thi?",
            "Số lượng môn thi mà thí sinh phải dự trong kỳ thi quốc gia THPT là bao nhiêu?",
            "Thí sinh cần phải thi bao nhiêu môn trong kỳ thi quốc gia THPT?",
            "Số môn thi mà thí sinh cần phải tham gia trong kỳ thi quốc gia THPT là gì?",
            "Trong kỳ thi THPT quốc gia, thí sinh phải dự thi một số môn là bao nhiêu?"
         ],
         "responses": [
            "Để được xét công nhận tốt nghiệp THPT và xét tuyển sinh vào các trường ĐH, CĐ, thí sinh phải thi bốn môn (gọi là bốn môn thi tối thiểu) gồm ba môn bắt buộc là toán, ngữ văn, ngoại ngữ (Tiếng Anh, Tiếng Nga, Tiếng Pháp, Tiếng Trung, Tiếng Đức, Tiếng Nhật) và tổ hợp tự nhiên hoặc xã hội."
         ]
      },
      {
         "tag": "mienngoaingu",
         "patterns": [
            "Xin cho biết về việc miễn thi môn ngoại ngữ?",
            "Có quy định gì về việc được miễn thi môn ngoại ngữ không?",
            "Có những điều kiện nào để được miễn thi môn ngoại ngữ?",
            "Quy định về việc được miễn thi môn ngoại ngữ là gì?",
            "Có qui định cụ thể nào về việc miễn thi môn ngoại ngữ không?",
            "Quy định về việc được miễn thi môn ngoại ngữ áp dụng như thế nào?",
            "Có những trường hợp nào được miễn thi môn ngoại ngữ?",
            "Thầy/cô có thể hướng dẫn về quy trình miễn thi môn ngoại ngữ được không?"
         ],
         "responses": [
            "Thí sinh có chứng chỉ quốc tế có uy tín theo quy định tại Công văn số 6031/BGDĐT-KTKĐCLGD ngày 23/10/2014 (chứng chỉ tương đương với trình độ từ bậc 3, khung 6 bậc dùng cho Việt Nam) sẽ được miễn thi tốt nghiệp THPT môn ngoại ngữ. Các thí sinh được miễn thi môn ngoại ngữ sẽ được nhận điểm tối đa môn ngoại ngữ khi xét công nhận tốt nghiệp THPT, điểm quy đổi này được sử dụng để xét công nhận tốt nghiệp THPT."
         ]
      },
      {
         "tag": "hosoxettuyen",
         "patterns": [
            "Hồ sơ xét tuyển năm nay như thế nào?",
            "Quy trình nộp hồ sơ xét tuyển trong năm nay là gì?",
            "Có những bước nào cần tuân theo khi làm hồ sơ xét tuyển trong năm nay?",
            "Thầy/cô có thể giải thích về hồ sơ xét tuyển cho năm nay không?",
            "Hồ sơ xét tuyển trong năm nay cần bao gồm những thông tin và giấy tờ nào?",
            "Có điều gì đặc biệt trong quá trình nộp hồ sơ xét tuyển trong năm nay không?",
            "Quy trình nộp hồ sơ xét tuyển có thay đổi so với các năm trước không?",
            "Có những yêu cầu cụ thể nào đối với hồ sơ xét tuyển trong năm nay?",
            "Có các phương thức nào để gửi hồ sơ xét tuyển trong năm nay?"
         ],
         "responses": [
            "hồ sơ đăng ký xét tuyển của thí sinh bao gồm: Phiếu đăng ký xét tuyển có ghi rõ đợt xét tuyển, cho phép đăng ký tối đa bốn ngành (hoặc nhóm ngành) của một trường cho mỗi đợt xét tuyển (các nguyện vọng này được xếp theo thứ tự ưu tiên từ 1-4); giấy chứng nhận kết quả thi có đóng dấu đỏ của trường chủ trì cụm thi và mã vạch nhận dạng; một phong bì đã dán sẵn tem và ghi rõ địa chỉ liên lạc của thí sinh để trường thông báo kết quả xét tuyển.Thí sinh nộp hồ sơ đăng ký xét tuyển và lệ phí đăng ký xét tuyển cho trường có nguyện vọng vào học qua đường bưu điện theo hình thức chuyển phát nhanh hoặc nộp hồ sơ trực tiếp tại trường."
         ]
      },
      {
         "tag": "xetsotuyen",
         "patterns": [
            "Trường ĐHSPKT Tp. HCM xét sơ tuyển là thế nào",
            "Quy trình sơ tuyển tại Đại học Sư phạm Kỹ thuật Thành phố Hồ Chí Minh như thế nào?",
            "Quy trình sơ tuyển tại ĐHSPKT Tp. HCM như thế nào?",
            "Cách thức xét sơ tuyển tại Đại học Sư phạm Kỹ thuật Thành phố Hồ Chí Minh là gì?",
            "Cách thức xét sơ tuyển tại ĐHSPKT Tp. HCM là gì?",
            "cách thức xét sơ tuyển tại Đại học Sư phạm Kỹ thuật Thành phố Hồ Chí Minh không?",
            "Có những tiêu chí nào được áp dụng trong quá trình sơ tuyển tại ĐHSPKT Tp. HCM?"
         ],
         "responses": [
            "tất cả thí sinh xét tuyển vào trình độ đại học của Trường ĐHSPKT Tp. HCM đều phải qua vòng xét sơ tuyển. Tiêu chí là: Điểm trung bình học bạ 5 học kỳ (HKI, II lớp 10, 11 và HKI  lớp 12) của 02 môn Toán & Ngữ văn đạt từ 11, 0 điểm trở lên. Nhà trường tổ chức sơ tuyển từ 20/3/2015 cho đến ngày nhận hồ sơ xét tuyển. Thí sinh thực hiện việc sơ tuyển bằng online tại website của trường  (thí sinh tự khai và tự chịu trách về các thông tin khai của bản thân. Nhà trường hậu kiểm khi thí sinh nhập học)."
         ]
      },
      {
         "tag": "khongxetsotuyen",
         "patterns": [
            "Nếu không sơ tuyển có được nộp hồ sơ xét tuyển không?",
            "Nếu không tham gia sơ tuyển, có thể nộp hồ sơ xét tuyển không?",
            "Có cách nào khác để nộp hồ sơ xét tuyển nếu không tham gia sơ tuyển không?",
            "Thầy/cô có thể nộp hồ sơ xét tuyển trực tiếp mà không cần tham gia sơ tuyển được không?",
            "Có phương pháp nào để nộp hồ sơ xét tuyển nếu không muốn tham gia quá trình sơ tuyển không?",
            "Nếu không muốn tham gia sơ tuyển, có cách nào khác để nộp hồ sơ xét tuyển không?",
            "Thầy/cô có thể gửi hồ sơ xét tuyển mà không cần tham gia quá trình sơ tuyển được không?",
            "Có thể nộp hồ sơ xét tuyển trực tiếp tại văn phòng trường nếu không tham gia sơ tuyển không?",
            "Thầy/cô có thể làm hồ sơ xét tuyển mà không cần phải tham gia quá trình sơ tuyển không?"
         ],
         "responses": [
            "Thí sinh không thực hiện việc sơ tuyển trên trang website của trường vẫn nộp hồ sơ xét tuyển bình thường. Hồ sơ chỉ có giá trị xét tuyển khi thí sinh đã lọt qua vòng sơ tuyển (tức là có điểm trung bình học bạ 5 học kỳ (HKI, II lớp 10, 11 và HKI  lớp 12) của 02 môn Toán & Ngữ văn đạt từ 11, 0 điểm trở lên)"
         ]
      },
      {
         "tag": "diemsan",
         "patterns": [
            "Trường có điểm điểm sàn xét tuyển không?",
            "Trường có áp dụng điểm sàn trong quá trình xét tuyển không?",
            "Có quy định về điểm sàn xét tuyển tại trường không?",
            "Trường áp dụng điểm sàn xét tuyển như thế nào?",
            "Có cơ hội được nhận vào trường nếu điểm không đạt điểm sàn không?",
            "Có quy định cụ thể về việc áp dụng điểm sàn xét tuyển không?",
            "Thầy/cô có thể cho biết điểm sàn xét tuyển của trường là bao nhiêu không?",
            "Thầy/cô có thể giải thích về chính sách điểm sàn trong quá trình xét tuyển tại trường không?"
         ],
         "responses": [
            "Căn cứ kết quả thi, Bộ GD-ĐT công bố ngưỡng điểm xét tuyển tối thiểu đối với từng môn (còn gọi là điểm sàn hay tiêu chí đảm bảo chất lượng đầu vào). Các trường ĐH, CĐ sử dụng kết quả kỳ thi dựa trên ngưỡng điểm này để xây dựng điểm xét tuyển"
         ]
      },
      {
         "tag": "tuyenthang",
         "patterns": [
            "trường ĐHSPKT Tp.HCM có chính sách ưu tiên xét tuyển thẳng như thề nào?",
            "Trường ĐHSPKT Tp.HCM có áp dụng chính sách ưu tiên xét tuyển thẳng không?",
            "Có quy định cụ thể nào về chính sách ưu tiên xét tuyển thẳng tại trường không?",
            "Trường có đưa ra các điều kiện cụ thể để được ưu tiên xét tuyển thẳng không?",
            "Quy trình xét tuyển thẳng tại ĐHSPKT Tp.HCM như thế nào?",
            "Có những đối tượng nào được ưu tiên xét tuyển thẳng tại trường không?",
            "Nếu đạt các điều kiện ưu tiên, quy trình xét tuyển thẳng sẽ như thế nào?",
            "Có cơ hội cao được nhận vào trường thông qua chính sách ưu tiên xét tuyển thẳng không?",
            "Thầy/cô có thể thông tin chi tiết về các trường hợp được ưu tiên xét tuyển thẳng không?"
         ],
         "responses": [
            "Trường dành 20% chỉ tiêu ngành Sư phạm tiếng Anh để xét tuyển thẳng các thí sinh tốt nghiệp THPT 2018, đạt điểm IELTS quốc tế từ 6.0 trở lên hoặc tương đương, có ĐTBHB của môn Toán và môn Văn đạt từ 6.0 trở lên.Trường sử dụng tối đa 10% chỉ tiêu để xét tuyển thẳng hai loại đối tượng: (1) Thí sinh tốt nghiệp THPT 2018, học lớp chuyên (Toán học, Vật lý, Hóa học, tiếng Anh, Sinh học) của trường chuyên có ĐTBHB từng môn đăng ký theo khối xét tuyển (có môn chuyên) từ 8.0 trở lên và có thư giới thiệu của Hiệu trưởng trường chuyên đã học. (2) Thí sinh tốt nghiệp THPT 2018 loại giỏi trở lên "
         ]
      },
      {
         "tag": "uuaisvnu",
         "patterns": [
            "Với Sinh viên nữ, Nhà trường có ưu ái gì không?",
            "Trường có chính sách ưu tiên đối với sinh viên nữ không?",
            "Thầy/cô có thể giải thích về chính sách ưu ái đối với sinh viên nữ tại trường không?",
            "Có quy định cụ thể nào về ưu tiên đối với sinh viên nữ tại trường không?",
            "Trường có đưa ra các chương trình hỗ trợ riêng cho sinh viên nữ không?",
            "Có những lợi ích cụ thể nào được cung cấp cho sinh viên nữ tại trường?",
            "Thầy/cô có thể thông tin chi tiết về các chương trình ưu ái dành cho sinh viên nữ không?",
            "Chính sách ưu tiên đối với sinh viên nữ được áp dụng trong tất cả các ngành học không?"
         ],
         "responses": [
            "Nhà trường cấp học bổng bằng 50% học phí toàn khóa cho các thí sinh nữ trúng tuyển nhập học vào các ngành CN Kỹ thuật Ô tô, CN Chế tạo máy, CN Kỹ thuật Cơ khí, CN Kỹ thuật Cơ điện tử, CN Kỹ thuật Nhiệt điện lạnh, CN kỹ thuật công trình xây dựng."
         ]
      },
      {
         "tag": "chungnhandiem",
         "patterns": [
            "Trong mỗi đợt xét, thí sinh được quyền nộp mấy giấy chứng nhận điểm?",
            "Trong mỗi kỳ xét, thí sinh được phép nộp bao nhiêu giấy chứng nhận điểm?",
            "Có giới hạn về số lượng giấy chứng nhận điểm mà thí sinh có thể nộp không?",
            "Thí sinh được yêu cầu nộp bao nhiêu bản sao chứng nhận điểm trong mỗi đợt xét tuyển?",
            "Có hạn chế về số lượng giấy chứng nhận điểm mà thí sinh có thể nộp trong mỗi kỳ xét không?",
            "Trong mỗi lần xét, thí sinh được phép gửi đi bao nhiêu bản sao chứng nhận điểm?",
            "Có giới hạn về số lượng giấy tờ chứng nhận điểm mà thí sinh có thể nộp trong mỗi kỳ xét không?",
            "Có hạn chế về số lượng giấy tờ chứng nhận điểm mà thí sinh có thể nộp trong mỗi đợt xét không?"
         ],
         "responses": [
            "Với xét tuyển nguyện vọng 1, thí sinh chỉ được nộp 01 giấy chứng nhận kết quả thi để xét NV 1 vào 01 trường duy nhất.Với xét tuyển nguyện vọng bổ sung, thí sinh có thể nộp 03 giấy chứng nhận kết quả thi vào 03 trường khác khác hoặc vào 03 ngành khác nhau của một trường"
         ]
      },
      {
         "tag": "dknguyenvong",
         "patterns": [
            "Mỗi phiếu điểm, thí sinh được quyền ghi mấy nguyên vọng?",
            "Mỗi phiếu điểm, thí sinh có thể ghi bao nhiêu nguyện vọng?",
            "Trong mỗi phiếu điểm, thí sinh được phép ghi tối đa bao nhiêu nguyện vọng?",
            "Trong mỗi phiếu điểm, thí sinh được ghi bao nhiêu nguyện vọng?",
            "Số lượng nguyện vọng mà thí sinh có thể ghi trên mỗi phiếu điểm là bao nhiêu?",
            "Có giới hạn về số lượng nguyện vọng mà thí sinh có thể ghi trong mỗi phiếu điểm không?",
            "Trong mỗi phiếu điểm, thí sinh được quyền lựa chọn bao nhiêu nguyện vọng?",
            "Mỗi phiếu điểm cho phép thí sinh ghi điều kiện vào mấy nguyện vọng?",
            "Số lượng nguyện vọng tối đa mà thí sinh có thể ghi trên mỗi phiếu điểm là bao nhiêu?",
            "Trong mỗi phiếu điểm, thí sinh được ghi bao nhiêu nguyện vọng?"
         ],
         "responses": [
            "Vô số Thí sinh phải đánh số thứ tự ưu tiên từ 1 đến 4. Tức là khi trúng tuyển ngành ưu tiên 1 sẽ không xét tới ngành ưu tiên 2, còn ngược lại nếu ưu tiên 1 không trúng thì được x"
         ]
      },
      {
         "tag": "congkhaixettuyen",
         "patterns": [
            "Trong thời gian nhận hồ sơ xét tuyển, trường công khai thông tin thế nào?",
            "Trong thời gian nhận hồ sơ xét tuyển, trường công bố thông tin ra sao?",
            "Trong giai đoạn nhận hồ sơ xét tuyển, trường cung cấp thông tin ra sao?",
            "Trong thời gian nhận hồ sơ xét tuyển, trường công bố thông tin như thế nào?",
            "Trong quá trình tiếp nhận hồ sơ xét tuyển, trường cung cấp thông tin theo cách nào?",
            "Trong giai đoạn nhận hồ sơ xét tuyển, trường tiến hành công bố thông tin như thế nào?",
            "Trong quá trình tiếp nhận hồ sơ xét tuyển, trường công khai thông tin như thế nào?",
            "Trong thời gian nhận hồ sơ xét tuyển, trường công bố thông tin ra sao?"
         ],
         "responses": [
            "Các trường cập nhật 3 ngày một lần thông tin đăng ký xét tuyển của thí sinh trên trang thông tin điện tử của trường (danh sách thí sinh đăng ký và điểm thi xếp theo thứ tự từ cao xuống thấp); công bố công khai danh sách thí sinh trúng tuyển và đăng kí nhập học của mỗi đợt xét tuyển"
         ]
      },
      {
         "tag": "chuongtrinhclc",
         "patterns": [
            "Xin cho biết về Chương trình đào tạo chất lượng cao của Trường?",
            "Trường có thể cung cấp thông tin về Chương trình đào tạo chất lượng cao không?",
            "Chương trình đào tạo chất lượng cao tại trường như thế nào?",
            "Có thông tin gì về Chương trình đào tạo chất lượng cao tại trường không?",
            "Có những yếu tố gì đặc biệt trong Chương trình đào tạo chất lượng cao của trường?",
            "Trường có những cơ hội gì cho sinh viên tham gia vào Chương trình đào tạo chất lượng cao?",
            "Trường có thể giải thích về Chương trình đào tạo chất lượng cao của mình không?"
         ],
         "responses": [
            "Chương trình cung cấp cho người học các dịch vụ đào tạo tốt nhất nhằm tạo ra môi trường học tập, nghiên cứu khoa học, sinh hoạt, tu dưỡng, rèn luyện theo chuẩn mực quốc tế với chi phí hợp lý. Các Kỹ sư tốt nghiệp chương trình này có kiến thức lý thuyết giỏi, kỹ năng nghề nghiệp vững vàng, tiềm năng nghiên cứu khoa học tốt, khả năng giao tiếp linh hoạt; Về đội ngũ giảng viên: Giảng viên giỏi, có uy tín được tuyển chọn từ đội ngũ giảng viên của trường và mời từ các trường bạn; Có phương pháp dạy học tiên tiến nhằm phát huy tiềm năng sáng tạo và khả  năng hợp tác trong công việc;Về cơ sở vật chất:  Lớp học có sĩ số tối ưu cho việc dạy và học (khoảng 30 SV/lớp); Phòng học tiện nghi: trang bị quạt, máy lạnh, máy tính, projector,…Phòng tự học truy cập Internet miễn phí; Được tạo điều kiện tốt nhất trong việc sử dụng thư viện, phòng thí nghiệm, xưởng thực tập; Được cung cấp giáo trình, tài liệu học tập miễn phí.Về chính sách ưu đãi và quyền lợi khác: Được học song song hai chương trình đào tạo, nếu SV có khả năng; Được hưởng các chế độ như các SV hệ chính quy theo qui định của Nhà nước, của Nhà trường (miễn giảm học phí, cấp học bổng,…); Ưu tiên xét cấp kinh phí nghiên cứu khoa học, dự hội thảo khoa học trong & ngoài trường; Nhà trường chủ động tạo cơ hội cho SV sớm tiếp xúc với các doanh nghiệp, cơ sở nghiên cứu và nhận nguồn tài trợ trực tiếp từ các đơn vị này"
         ]
      },
      {
         "tag": "thongtinsv",
         "patterns": [
            "Khi tư vấn có cần phải nêu danh tính thông tin mà sinh viên trao đổi với các tư vấn viên có được giữ kín không không?",
            "Trong quá trình tư vấn, thông tin cá nhân mà sinh viên chia sẻ với các tư vấn viên có được bảo mật không?",
            "Khi tư vấn, liệu danh tính và thông tin cá nhân của sinh viên có được bảo vệ?",
            "Có được giữ kín thông tin cá nhân mà sinh viên chia sẻ trong quá trình tư vấn không?",
            "Trong quá trình tư vấn, liệu các thông tin mà sinh viên cung cấp có được bảo mật không?",
            "Có quy định nào về việc giữ kín thông tin cá nhân của sinh viên trong quá trình tư vấn không?",
            "Trong tư vấn, danh tính và thông tin cá nhân của sinh viên có được bảo mật không?",
            "Khi tư vấn, liệu thông tin cá nhân mà sinh viên chia sẻ có được giữ kín không?",
            "Có chính sách nào về bảo mật thông tin cá nhân của sinh viên trong quá trình tư vấn không?",
            "Trong quá trình tư vấn, có được bảo mật thông tin cá nhân mà sinh viên cung cấp không?"
         ],
         "responses": [
            "Không cần phải nêu danh tính. Tất cả các thông tin của SV đều được giữ kín. Sinh viên có thể đến trực tiếp TTDVSV hoặc gửi qua email, điện thoại để được tư vấn"
         ]
      },
      {
         "tag": "tuvantamly",
         "patterns": [
            "Khi sinh viên có vấn đề trong cuộc sống, các vấn đề về sức khỏe, tâm lý thì có thể được tham vấn ở đâu?",
            "Ở đâu là nơi sinh viên có thể tìm kiếm sự hỗ trợ khi họ gặp vấn đề trong cuộc sống, sức khỏe hoặc tâm lý?",
            "Nếu có vấn đề về sức khỏe hoặc tâm lý, sinh viên có thể tìm kiếm sự hỗ trợ từ đâu?",
            "Ở đâu là nơi mà sinh viên có thể tìm sự hỗ trợ tâm lý và tư vấn về các vấn đề cá nhân?",
            "Trường có cung cấp dịch vụ tư vấn cho sinh viên gặp khó khăn trong cuộc sống, sức khỏe hoặc tâm lý không?",
            "Ở đâu là nơi mà sinh viên có thể tìm kiếm sự hỗ trợ và tư vấn khi họ gặp vấn đề trong cuộc sống?",
            "Nếu gặp vấn đề cá nhân hoặc tâm lý, sinh viên có thể nhận được sự hỗ trợ từ đâu?"
         ],
         "responses": [
            "Bạn có thể gọi vào số điện thoại cho cô Hoàng Thị Thu Hiền, số điện thoại  0918427367 để trao đổi trực tiếp."
         ]
      },
      {
         "tag": "svnamnhat",
         "patterns": [
            "Là sinh viên năm nhất, em cần làm gì để học tốt?",
            "Để học tốt trong năm nhất, sinh viên cần thực hiện những công việc gì?",
            "Nếu là sinh viên năm nhất, có những biện pháp nào giúp sinh viên học tốt hơn?",
            "Là sinh viên mới, có cách nào để tối ưu hóa quá trình học tập?",
            "Em cần thực hiện những hành động gì để đạt kết quả tốt trong năm đầu tiên?",
            "Để thành công trong năm đầu, có những bước cụ thể nào mà sinh viên nên thực hiện?",
            "Là sinh viên năm nhất, em cần tuân thủ những nguyên tắc nào để đảm bảo học tập hiệu quả?",
            "Có những bí quyết nào giúp sinh viên năm nhất học tốt hơn?",
            "Để học tốt trong năm đầu, em cần tập trung vào những gì?",
            "Có gì là quan trọng nhất đối với sinh viên mới khi bắt đầu hành trình học đại học?"
         ],
         "responses": [
            "Là sinh viên năm nhất, bạn nên tìm hiểu làm quen với môi trường học tập đại học: tham gia đầy đủ môn học “nhập môn ngành”; tham gia các đội nhóm, các lớp kĩ năng để học hỏi kinh nghiệm học tập từ các anh chị; đến thư viện đọc sách; chuẩn bị bài trước khi đến lớp; tăng cường tự học; học nhóm; tập kỹ năng đọc sách để tăng khả năng tổng hợp và phân tích; lập kế hoạch học tập và cố gắng theo sát kế hoạch đã đề ra. Nhớ cân bằng giữa việc học và giải trí  (tham gia các CLB, các hoạt động của trường …) để việc học hiệu quả hơn. Bạn đừng bỏ qua những giờ lên lớp của thầy cô nhé vì nếu cúp học bạn sẽ mất căn bản hoặc mất nhiều thời gian để tự đọc sách."
         ]
      },
      {
         "tag": "dkkytucxa",
         "patterns": [
            "Một số SV muốn đăng kí vào ở ký túc xá của trường thì làm thế nào?",
            "Là sinh viên muốn ở ký túc xá của trường, cần thực hiện các bước gì để đăng ký?",
            "Để đăng ký ở ký túc xá của trường, sinh viên cần làm những thủ tục gì?",
            "Muốn được ở ký túc xá của trường, sinh viên cần tuân thủ quy trình nào?",
            "Nếu muốn ở ký túc xá của trường, sinh viên phải làm sao để đăng ký?",
            "Đăng ký ở ký túc xá của trường đòi hỏi sinh viên phải thực hiện những thủ tục nào?",
            "Là sinh viên muốn ở ký túc xá của trường, em nên bắt đầu từ đâu?",
            "Để đăng ký ở ký túc xá của trường, sinh viên cần nắm rõ quy trình và yêu cầu gì?",
            "Có cách nào đơn giản hóa quy trình đăng ký ở ký túc xá của trường không?",
            "Muốn ở ký túc xá của trường, sinh viên cần thực hiện những thủ tục nào và bắt đầu từ khi nào?"
         ],
         "responses": [
            "Chào bạn, nếu bạn muốn ở ký túc xá thì liên hệ Ban quản lý ký túc xá, lấy mẫu đơn và hoàn tất các thủ tục theo chỉ dẫn, sau hai ngày thì các bạn có thể vào ở KTX  bạn nhé. Hiện nay KTX đang còn chỗ nên bạn đến đăng ký nhé."
         ]
      },
      {
         "tag": "anhvangiaotiep",
         "patterns": [
            "Nên học anh văn giao tiếp năm thứ mấy của Đại học?",
            "Khi nên bắt đầu học anh văn giao tiếp tại Đại học?",
            "Năm học nào là thích hợp nhất để bắt đầu học anh văn giao tiếp ở Đại học?",
            "Đối với sinh viên Đại học, nên bắt đầu học anh văn giao tiếp ở năm thứ mấy?",
            "Khi nào là thời điểm phù hợp nhất để bắt đầu học anh văn giao tiếp tại Đại học?",
            "Năm học nào trong chương trình Đại học là lý tưởng để bắt đầu học anh văn giao tiếp?",
            "Khi nên bắt đầu học anh văn giao tiếp trong suốt chương trình Đại học?",
            "Nên bắt đầu học anh văn giao tiếp ở giai đoạn nào trong quá trình học Đại học?",
            "Năm học nào sẽ là thích hợp nhất cho việc bắt đầu học anh văn giao tiếp ở Đại học?"
         ],
         "responses": [
            "Bạn nên học anh văn giao tiếp vào ngay năm thứ nhất nhé. Khi học AV thì nên học cả 4 kỹ năng (nghe, nói, đọc, viết) đồng thời. Đặc biệt nếu ở trường phổ thông mà bạn chưa bắt đầu học AVGT, chỉ chú trọng ngữ pháp thì bạn nên dành thời gian cho việc học AV giao tiếp ngay. Các công ty hiện nay đòi hỏi trình độ anh văn rất cao khi phỏng vấn (không phải bằng cấp) vì thế bạn nên bắt đầu học ngay nhé, cơ hội sẽ không chờ bạn nếu không kịp thời nắm bắt nó"
         ]
      },
      {
         "tag": "chuyenktx",
         "patterns": [
            "Nếu SV ở KTX đã được 1 học kì nhưng lại muốn chuyển ra ngoài thì có được lấy tiền còn dư không?",
            "Nếu muốn chuyển từ ký túc xá ra ngoài, sinh viên có được hoàn lại tiền còn dư không?",
            "Khi quyết định chuyển ra ngoài sau một kỳ ở ký túc xá, có thể nhận lại tiền dư không?",
            "Nếu muốn chuyển ra ngoài sau một học kỳ ở ký túc xá, có được hoàn lại tiền còn thừa không?",
            "Sau khi ở ký túc xá một học kỳ, nếu quyết định chuyển ra ngoài, có được trả lại số tiền còn thừa không?",
            "Khi muốn chuyển từ ký túc xá ra ngoài, có thể nhận lại tiền dư không?",
            "Nếu quyết định rời khỏi ký túc xá sau một kỳ, có được hoàn tiền còn thừa không?",
            "Sinh viên muốn chuyển từ ký túc xá ra ngoài sau một học kỳ, có được trả lại số tiền còn dư không?",
            "Khi quyết định chuyển ra ngoài sau một học kỳ ở ký túc xá, có được hoàn tiền còn thừa không?",
            "Nếu muốn rời khỏi ký túc xá sau một kỳ, có được lấy lại tiền còn thừa không?",
            "Sinh viên sau một kỳ ở ký túc xá muốn chuyển ra ngoài, có được trả lại số tiền còn dư không?"
         ],
         "responses": [
            "Chào bạn, Theo quy định thì BQL KTX thu tiền cả năm học vì thế các bạn không được rút tiền lại khi giữa năm học chuyển ra ngoài ở, trường hợp đặc biệt có quyết định nghỉ học của Hiệu trưởng thì làm đơn gửi BQL KTX đề xuất phòng Kế hoạch tài chính xin rút lại tiền bạn nhé"
         ]
      },
      {
         "tag": "tuvanktx",
         "patterns": [
            "Là sinh viên năm nhất, em nên ở ký túc xá hay phòng trọ?",
            "Năm nhất, em nên chọn ở ký túc xá hay phòng trọ?",
            "Khi mới vào đại học, điều gì tốt hơn: ở ký túc xá hay thuê phòng trọ?",
            "Đối với sinh viên năm nhất, nên ở ký túc xá hay tự thuê phòng trọ?",
            "Ở ký túc xá hay ở phòng trọ, điều nào phù hợp hơn với sinh viên năm nhất?",
            "Trong trường hợp là sinh viên năm nhất, nên chọn lựa ở ký túc xá hay thuê phòng trọ?",
            "Sinh viên năm nhất nên chọn ở đâu: ký túc xá hay phòng trọ?",
            "Khi mới bắt đầu học đại học, điều gì tốt hơn: ở ký túc xá hay thuê phòng trọ?",
            "Năm nhất, em cần cân nhắc ở ký túc xá hay phòng trọ?",
            "Lựa chọn ở ký túc xá hay thuê phòng trọ, điều nào thích hợp với sinh viên năm nhất?",
            "Sinh viên năm nhất nên ở ký túc xá hay tự thuê phòng trọ?"
         ],
         "responses": [
            "Chào bạn, nếu là sinh viên năm nhất ở ký túc xá tốt hơn ở phòng trọ, vì phí ở ký túc xá thấp hơn; ở KTX có môi trường sinh hoạt, sống nề nếp, bạn sẽ có cơ hội tốt để bạn giao lưu, học hỏi từ các anh chị sinh viên đi trước và đặc biệt được rèn luyện về lối sống tập thể và đồng thời bạn tránh được những bất trắc có thể xảy ra khi sống ngoài môi trường xã hội xa lạ. "
         ]
      },
      {
         "tag": "phuongphaptaptrung",
         "patterns": [
            "Các phương pháp để tập trung học cao độ?",
            "Làm thế nào để tập trung học hiệu quả nhất?",
            "Có chiến lược gì giúp tăng cường sự tập trung khi học tập không?",
            "Có cách nào để nâng cao khả năng tập trung trong quá trình học không?",
            "Làm sao để duy trì sự tập trung cao độ khi học tập?",
            "Có gì giúp em có thể tập trung học tốt hơn không?",
            "Có phương pháp nào giúp cải thiện khả năng tập trung khi học không?",
            "Làm thế nào để giữ cho tâm trí luôn tập trung vào việc học?",
            "Có chiến lược nào giúp nâng cao hiệu suất học tập thông qua sự tập trung không?",
            "Có gì em có thể thực hiện để đạt được mức độ tập trung cao độ khi học?",
            "Có cách nào để rèn luyện và phát triển khả năng tập trung khi học không?"
         ],
         "responses": [
            "Bạn nên kiếm không gian học tập tốt như những nơi có ánh sáng vừa đủ, bàn ghế thích hợp với tầm vóc của bạn, môi trường thoáng đảng. Và phải nhớ rằng bạn phải tách khỏi TV, điện thoại. Nếu thích bạn có thể mở một tí âm nhạc với một âm lượng vừa phải.Trước khi bắt đầu học, bạn phải hình dung, khái quát hóa những gì bạn sẽ học, cần chú trọng và đâu.Nên nhớ việc học một môn học trong thời gian quá lâu sẽ khiến não bộ bắt đàu “ngán ngẫm”.  Bạn nên xen kẽ những môn học có phong cách khác nhau, ví dụ bạn đang học Anh thì hãy chuyển sang môn Toán,…Ở lớp thay vì ngồi một chỗ lắng nghe thầy cô, bạn hãy hăng say tham gia say dựng bài, hỏi những gì ban chưa thực sự hiểu.Bạn cần có thời gian nghĩ ngơi: Hãy rời khỏi chỗ ngồi, tập vài động tác để giản gân cốt hay đi 2-3 vòng để lấy lại sinh lực.Ghi nhận mỗi ngày: bạn hãy ghi nhận những tiến bộ cũng như điểm bạn chưa làm được vào sổ tay."
         ]
      },
      {
         "tag": "chiasetamsu",
         "patterns": [
            "Vì mới lên Tp.HCM , xa gia đình nên nhiều lúc thấy nhớ nhà và buồn. Em phải làm gì vào những lúc đó?",
            "Làm sao để giải tỏa cảm xúc nhớ nhà và buồn khi mới lên TP.HCM?",
            "Có cách nào giúp giảm bớt nỗi nhớ gia đình và cảm giác buồn khi ở xa nhà không?",
            "Làm thế nào để vượt qua cảm giác nhớ nhà và buồn khi xa gia đình ở TP.HCM?",
            "Có chiến lược gì để làm giảm cảm giác nhớ nhà và buồn khi ở xa gia đình ở TP.HCM không?",
            "Em có thể làm gì để xua tan cảm giác buồn và nhớ nhà khi mới đến TP.HCM?",
            "Có gợi ý nào giúp giảm bớt nỗi buồn và nhớ nhà khi lần đầu tiên đến TP.HCM không?",
            "Làm thế nào để thích nghi với cuộc sống ở TP.HCM mà không bị ảnh hưởng bởi cảm giác buồn và nhớ nhà?",
            "Có cách nào để cảm thấy vui vẻ và hạnh phúc ở TP.HCM mặc dù xa gia đình không?",
            "Làm thế nào để tận hưởng cuộc sống ở TP.HCM mà không bị ám ảnh bởi cảm giác nhớ nhà và buồn?",
            "Có gì em có thể làm để cảm thấy thoải mái và hạnh phúc khi ở TP.HCM dù cảm thấy nhớ nhà và buồn?"
         ],
         "responses": [
            "Bạn có thể gọi điện, trò chuyện với người thân, bạn bè để chia sẻ những  nỗi niềm của mình. Bạn biết không, trường mình có rất nhiều CLB, bạn có thể đến đó sinh hoạt, rèn luyện kỹ năng; TPHCM cũng có rất nhiều danh lam thắng cảnh, bạn có thể đến thăm; Thư viện, Phòng khám phá của TTDVSV có rất nhiều sách, bạn có thể tìm những cuốn sách hay để đọc. Khi mới xa vòng tay gia đình, chắc chắn bạn sẽ có cảm giác nhớ nhà và buồn, nếu tham gia các hoạt động trên bạn sẽ thấy đi một ngày đàng, học một sàng khôn và quyết định đi xa học tập của mình là đúng. Chúc bạn nhanh chóng thích nghi với môi trường mới nhé"
         ]
      },
      {
         "tag": "cachhocdh",
         "patterns": [
            "Cách học ĐH như thế nào là hiệu quả?",
            "Làm thế nào để học đại học một cách hiệu quả?",
            "Có cách nào để học tốt ở trường đại học không?",
            "Cách nào là tốt nhất để học ở đại học?",
            "Làm sao để học hiệu quả ở trường đại học?",
            "Có gì làm cho việc học ở đại học trở nên hiệu quả?",
            "Làm thế nào để tối ưu hóa quá trình học tập ở đại học?",
            "Có cách nào để nâng cao hiệu suất học tập ở trường đại học không?",
            "Làm thế nào để học đại học một cách thông minh?",
            "Có chiến lược học tập nào được coi là hiệu quả ở đại học không?",
            "Cách học tập nào là phù hợp nhất với đại học?"
         ],
         "responses": [
            "Đọc sách trước khi đến lớp.Tập trung nghe giảng trên lớp vì đó là những lúc chúng ta giải quyết những thắc mắc, những vấn đề chưa hiểu khi bạn đọc sách trước ở nhà.Xem lại những gì đã học ngay trong ngày. Vì thông tin kiến thức sẽ mất đi 80% sau 24h nếu bạn không xem lại bài.Sử dụng các thủ thuật như: lập sơ đồ tư duy, phương  pháp đọc nhanh hiệu quả, những kỹ thuật nhớ siêu đẳng, … để ghi nhớ những công thức, những điều cần nhớ và áp dụng nó vào những trường hợp tương tự để biết cách sử dụng và sáng tạo trong điều kiện mới."
         ]
      },
      {
         "tag": "kynammem",
         "patterns": [
            "Kỹ năng mềm có cần thiết không? Nếu muốn học thì em phải học ở đâu cho tốt?",
            "Kỹ năng mềm có quan trọng không và nếu có thì làm thế nào để học được chúng?",
            "Việc học kỹ năng mềm cần thiết không và nên tìm hiểu từ đâu để phát triển?",
            "Làm thế nào để nâng cao kỹ năng mềm và học chúng ở đâu là hiệu quả nhất?",
            "Kỹ năng mềm có cần phải được rèn luyện không và làm thế nào để học chúng một cách hiệu quả?",
            "Sinh viên cần học kỹ năng mềm không và làm thế nào để nắm bắt được chúng?",
            "Việc phát triển kỹ năng mềm có quan trọng không và làm thế nào để học chúng?",
            "Cần thiết phải học kỹ năng mềm không và làm thế nào để tự rèn luyện chúng?",
            "Làm thế nào để tự học và phát triển kỹ năng mềm?",
            "Kỹ năng mềm có ảnh hưởng như thế nào đến sự nghiệp và làm thế nào để học chúng?",
            "Có cần phải đầu tư vào việc học kỹ năng mềm không và làm thế nào để bắt đầu?"       
         ],
         "responses": [
            "Đối với sinh viên thì kỹ năng mềm là một trong những kỹ năng quan trọng. Nếu có điều kiện bạn có thể đi học các lớp bổ trợ kỹ năng mềm như: kỹ năng giao tiếp, kỹ năng thuyết trình, kỹ năng đàm phán,..Nếu không có điều kiện đi học bạn có thể tham gia các câu lạc bộ, các group để nâng cao kỹ năng mềm của mình. Đó là môi trường để bạn rèn luyện các kỹ năng cần thiết cũng là nơi để bạn sử dụng các kỹ năng bạn đã được học."
         ]
      },
      {
         "tag": "canbangviechoc",
         "patterns": [
            "Làm thế nào cân bằng thời gian để em vừa tham gia các câu lạc bộ, phong trào đoàn nhưng không ảnh hưởng đến việc học?",
            "Làm sao để phân chia thời gian giữa việc tham gia câu lạc bộ và phong trào đoàn với việc học?",
            "Cách nào để đảm bảo rằng việc tham gia các hoạt động ngoại khóa không ảnh hưởng đến việc học của em?",
            "Làm thế nào để tổ chức thời gian sao cho em có thể tham gia các hoạt động xã hội mà vẫn duy trì được hiệu suất học tập?",
            "Muốn tham gia hoạt động ngoại khóa mà không làm ảnh hưởng đến việc học, em nên làm gì?",
            "Làm sao để quản lý thời gian hiệu quả khi tham gia các hoạt động ngoại khóa và vẫn duy trì được thành tích học tập?",
            "Có cách nào để tham gia các hoạt động xã hội mà không gây ra áp lực cho việc học không?",
            "Cách nào giúp em duy trì cân bằng giữa việc tham gia các hoạt động ngoại khóa và nâng cao kết quả học tập?",
            "Làm thế nào để tổ chức thời gian sao cho em có thể tham gia các hoạt động xã hội mà vẫn duy trì được hiệu suất học tập?"
         ],
         "responses": [
            "Muốn vừa tham gia các hoạt động, vừa học tập tốt trước hết bạn phải quản lý thời gian biểu của mình một cách hợp lý. Bạn nên đưa ra thời khóa biểu, sắp xếp cụ thể thời gian học tập, sinh hoạt ngoại khóa và thời gian nghỉ ngơi của mình. Nhưng điều quan trọng nhất là bạn phải thực hiện đúng kế hoạch mà bạn đã đưa ra thì kết quả bạn nhận được mới thực sự tốt. Nên chọn một vài hình thức sinh hoạt hoặc CLB đúng sở thích hoặc cần cho chuyên môn của mình để tham gia. Xác định việc học là chính và nghỉ ngơi hợp lý (tham gia các CLB) cũng là góp phần học tập tốt"
         ]
      },
      {
         "tag": "hoctaptot",
         "patterns": [
            "Muốn học tập tốt tại trường đại hoc thì em cần chuẩn bị những  gì?",
            "Để học tốt tại trường đại học, em cần chuẩn bị những gì?",
            "Các yếu tố nào cần được chuẩn bị để học tập hiệu quả tại trường đại học?",
            "Làm thế nào để chuẩn bị tốt cho việc học tại đại học?",
            "Cần phải chuẩn bị những gì để thành công trong học tập ở trường đại học?",
            "Muốn học tốt ở trường đại học, em cần sắp xếp như thế nào?",
            "Ngoài kiến thức học thuật, điều gì cần phải được chuẩn bị để thành công trong việc học tập ở đại học?",
            "Cần những kỹ năng và tư duy gì để học tốt tại trường đại học?",
            "Làm sao để tự chuẩn bị tinh thần và vật chất để học tập hiệu quả tại đại học?",
            "Muốn thành công trong học tập ở trường đại học, điều gì cần được em chú ý chuẩn bị?",
            "Cách nào là phù hợp để chuẩn bị tốt cho việc học tại trường đại học?"
         ],
         "responses": [
            "Muốn học tập tốt tại trường đại học thì điều cần thiết nhất là bạn phải sắp xếp được thời gian của mình một cách hợp lý. Thứ hai, bạn nên đi học đầy đủ, làm tất cả các bài tập được giao cho, chuẩn bị bài trước khi đến lớp,… Ngoài ra, bạn còn phải biết tự nâng cao các kỹ năng cho bản thân như; kỹ năng giao tiếp, kỹ năng thuyết trình, kỹ năng đàm phán,… bằng việc tham gia các khóa huấn luyện, các câu lạc bộ"
         ]
      },
      {
         "tag": "quentaikhoan",
         "patterns": [
            "Khi sinh viên bị quên mật khẩu truy cập tài khoản online thì phục hồi như thế nào? ",
            "Nếu sinh viên quên mật khẩu để truy cập tài khoản online, làm thế nào để phục hồi?",
            "Khi quên mật khẩu để đăng nhập vào tài khoản online, sinh viên cần thực hiện các bước gì để khôi phục?",
            "Làm sao để khôi phục mật khẩu truy cập tài khoản online nếu sinh viên quên?",
            "Nếu quên mật khẩu đăng nhập vào hệ thống online, sinh viên phải làm gì để khôi phục?",
            "Khi không nhớ mật khẩu truy cập tài khoản online, sinh viên cần thực hiện các bước gì để lấy lại?",
            "Làm thế nào để lấy lại mật khẩu truy cập vào tài khoản online nếu sinh viên quên?",
            "Nếu sinh viên không nhớ mật khẩu để đăng nhập vào hệ thống online, làm thế nào để khôi phục?",
            "Khi quên mật khẩu truy cập tài khoản online, sinh viên cần tuân theo quy trình nào để phục hồi?",
            "Nếu quên mật khẩu đăng nhập vào hệ thống trực tuyến, sinh viên phải thực hiện những thủ tục gì để khôi phục?",
            "Làm sao để đặt lại mật khẩu truy cập tài khoản online khi sinh viên quên?"
         ],
         "responses": [
            "Sinh viên phải liên hệ Trung Tâm Thông Tin để phục hồi mật khẩu"
         ]
      },
      {
         "tag": "giayxinphep",
         "patterns": [
            "Khi có việc bận đột xuất, sinh viên gửi đơn xin phép ở đâu?",
            "Nếu có việc đột xuất, sinh viên nộp đơn xin phép ở đâu?",
            "Khi gặp phải tình huống khẩn cấp, sinh viên cần gửi đơn xin phép tới đâu?",
            "Ở đâu là nơi để gửi đơn xin phép khi sinh viên gặp vấn đề bất ngờ?",
            "Sinh viên cần nộp đơn xin phép ở đâu khi cần vắng mặt?",
            "Khi có việc gấp, sinh viên gửi đơn xin phép tới đâu?",
            "Nếu gặp vấn đề không thể tham dự, sinh viên cần nộp đơn xin phép ở đâu?",
            "Nơi nào là lựa chọn phù hợp để gửi đơn xin phép khi có việc bận đột xuất?",
            "Khi cần phải nghỉ học vì lý do khẩn cấp, sinh viên gửi đơn xin phép tới đâu?",
            "Nếu gặp vấn đề đột xuất, sinh viên nên nộp đơn xin phép ở đâu?",
            "Khi có sự cố đột xuất, sinh viên cần liên hệ đến đâu để gửi đơn xin phép?"
         ],
         "responses": [
            "Sinh viên không cần thiết nộp đơn xin phép nghỉ học tại Văn Phòng Khoa hay phòng Công tác Học sinh - sinh viên. Tuy nhiên, sinh viên cần trình bày lý do chính đáng trước giảng viên phục trách môn học để không bị xem như vắng buổi học ngày hôm đó mà không có lý do. Giảng viên có thể yêu cầu bạn đi học bù một số buổi tại những thời điểm khác nhau để hoàn thiện kiến thức bị mất."
         ]
      },
      {
         "tag": "mailsv",
         "patterns": [
            "Có cần thiết phải kích hoạt mail sinh viên không?",
            "Việc kích hoạt mail sinh viên có quan trọng không?",
            "Cần phải làm gì sau khi nhận được mail sinh viên?",
            "Tại sao lại cần phải kích hoạt mail sinh viên?",
            "Làm thế nào để kích hoạt mail sinh viên?",
            "Mail sinh viên cần phải được kích hoạt không?",
            "Việc kích hoạt mail sinh viên có ý nghĩa gì?",
            "Kích hoạt mail sinh viên có tác dụng gì trong quá trình học tập?",
            "Có cần thiết phải sử dụng mail sinh viên không?",
            "Mail sinh viên có tác dụng gì trong việc liên lạc với trường?"
         ],
         "responses": [
            "Có. Mỗi SV vào học tại trường Đại học Sư phạm Kỹ thuật TP.HCM sẽ được cấp 1 tài khoản E-Mail. Việc kích hoạt mail SV rất có ích cho bạn, bởi các thông tin từ trường sẽ được thông báo cho bạn qua địa chỉ mail này."
         ]
      },
      {
         "tag": "xemlichthi",
         "patterns": [
            "Làm sao để xem thời khóa biểu, xem lịch thi, xem điểm thi, các học phần tích lũy, học phí của mình?",
            "Có cách nào để kiểm tra thời khóa biểu, lịch thi, điểm thi, số tín chỉ tích lũy và học phí của mình không?",
            "Làm thế nào để xem thời khóa biểu cá nhân, lịch thi, điểm thi, số tín chỉ tích lũy và học phí?",
            "Em có thể kiểm tra thời khóa biểu, lịch thi, điểm thi, số tín chỉ tích lũy và học phí của mình ở đâu?",
            "Để xem thời khóa biểu, lịch thi, điểm thi, số tín chỉ tích lũy và học phí, em cần thực hiện những bước nào?",
            "Làm sao để truy cập vào thông tin về thời khóa biểu, lịch thi, điểm thi, số tín chỉ tích lũy và học phí cá nhân?",
            "Có cách nào để kiểm tra thông tin cá nhân về thời khóa biểu, lịch thi, điểm thi, số tín chỉ tích lũy và học phí không?",
            "Em có thể tìm kiếm thông tin về thời khóa biểu, lịch thi, điểm thi, số tín chỉ tích lũy và học phí ở đâu?",
            "Để biết thông tin về thời khóa biểu, lịch thi, điểm thi, số tín chỉ tích lũy và học phí, em cần thực hiện thủ tục nào?",
            "Làm sao để truy cập vào hệ thống để xem thời khóa biểu, lịch thi, điểm thi, số tín chỉ tích lũy và học phí của mình?",
            "Có phương pháp nào tiện lợi để kiểm tra thông tin về thời khóa biểu, lịch thi, điểm thi, số tín chỉ tích lũy và học phí không?",
            "Làm thế nào để kiểm tra thời khóa biểu của mình?",
            "Cách để xem lịch thi của tôi là gì?",
            "Làm sao để tra cứu điểm thi của các môn học?",
            "Em có thể xem các học phần tích lũy như thế nào?",
            "Cách để kiểm tra học phí của mình là gì?",
            "Làm sao để xem thông tin về thời gian học của mình?",
            "Cách để biết lịch thi của các môn học?",
            "Em có thể kiểm tra điểm thi như thế nào?",
            "Làm thế nào để tra cứu số tín chỉ tích lũy của mình?",
            "Cách nào để xem thông tin về học phí của các học phần?"
         ],
         "responses": [
            "SV đăng nhập vào trang online.hcmute.edu.vn như sau: Username: MSSV; Password: MSSV (khuyến khích SV thay đổi password); SV vào chọn các mục mình muốn xem để xem nội dung"
         ]
      },
      {
         "tag": "tramon",
         "patterns": [
            "Làm sao để trả nợ các môn theo chương trình đào tạo cũ mà hiện nay không còn mở nữa?",
            "Nếu muốn trả nợ các môn theo chương trình cũ không còn mở, làm thế nào?",
            "Làm sao để hoàn thành các môn theo chương trình đào tạo cũ mà không còn mở?",
            "Có cách nào để hoàn tất các môn trong chương trình đào tạo cũ không?",
            "Nếu muốn hoàn thành các môn theo chương trình cũ không mở nữa, phải làm thế nào?",
            "Làm sao để đảm bảo có thể hoàn thành các môn theo chương trình đào tạo cũ?",
            "Có phương pháp nào để trả nợ các môn học theo chương trình cũ không còn mở nữa không?",
            "Nếu muốn hoàn tất các môn theo chương trình cũ, cách tốt nhất là gì?",
            "Làm thế nào để giải quyết việc trả nợ các môn theo chương trình cũ?",
            "Có cách nào để kết thúc các môn học theo chương trình cũ mà không còn mở không?",
            "Nếu muốn đạt đến yêu cầu của chương trình đào tạo cũ, em cần làm gì?"
         ],
         "responses": [
            "Để trả nợ các môn học cũ không còn được mở nữa, SV sẽ đăng ký học các môn học tương đương (xem trên website của khoa) hoặc các môn học thay thế (liên hệ trực tiếp với bộ môn quản môn học để được hướng dẫn cụ thể). SV làm đơn xin học môn thay thế để trình Bộ môn và Khoa quản môn học phê duyệt, sau đó nộp cho Phòng Đào tạo"
         ]
      },
      {
         "tag": "cachdkmonhoc",
         "patterns": [
            "Đăng ký môn học như thế nào?",
            "Làm thế nào để đăng ký các môn học trong hệ thống của trường?",
            "Cách thức đăng ký môn học là gì?",
            "Em phải làm gì để đăng ký các môn học cho học kỳ tiếp theo?",
            "Quy trình đăng ký môn học ở trường như thế nào?",
            "Có những bước nào cần thực hiện khi muốn đăng ký môn học?",
            "Làm sao để hoàn tất việc đăng ký các môn học cần thiết cho học kỳ tới?",
            "Đăng ký môn học có gì đặc biệt mà sinh viên cần biết?",
            "Cách đăng ký môn học có gì mới lạ không?",
            "Có điều gì cần lưu ý khi thực hiện đăng ký môn học?",
            "Làm thế nào để chọn được các môn học phù hợp trong quá trình đăng ký?"
         ],
         "responses": [
            "SV không nợ học phí các học kỳ trước đó (SV không bị khóa tên).Vào trang online.hcmute.edu.vn. Mỗi SV có một Thời khóa biểu dự kiến (SV có thể đăng ký thêm môn học; chuyển nhóm; đổi nhóm; hủy môn học đối với các môn lý thuyết. Các môn học thực tập, thực tập sư phạm, thí nghiệm không được phép chuyển nhóm, không được hủy môn học, không được đăng ký học vượt) -> In và lưu Thời khóa biểu để đi học và khiếu nại sau này"
         ]
      },
      {
         "tag": "hocvuot",
         "patterns": [
            "Làm thế nào để có thể tốt nghiệp sớm trước thời hạn nếu các môn học thực tập, thí nghiệm không được phép đăng ký học vượt?",
            "Có cách nào để tốt nghiệp sớm trước thời hạn nếu không thể đăng ký học vượt các môn thực tập, thí nghiệm không?",
            "Làm thế nào để có thể ra trường sớm nếu không được phép đăng ký học thêm các môn thực tập, thí nghiệm?",
            "Có cách nào để hoàn thành chương trình học sớm nếu không thể đăng ký học thêm các môn thực tập, thí nghiệm không?",
            "Nếu không thể đăng ký học thêm các môn thực tập, thí nghiệm, làm thế nào để tốt nghiệp trước thời hạn?",
            "Có phương pháp nào giúp tôi ra trường sớm nếu không được phép đăng ký học thêm các môn thực tập, thí nghiệm không?",
            "Làm sao để hoàn thành khóa học sớm hơn nếu các môn thực tập, thí nghiệm không thể đăng ký học thêm?",
            "Có cách nào để tốt nghiệp trước dự kiến nếu không được phép đăng ký học vượt các môn thực tập, thí nghiệm không?",
            "Nếu không thể đăng ký học thêm các môn thực tập, thí nghiệm, làm thế nào để hoàn thành chương trình học sớm hơn?",
            "Có biện pháp nào giúp tôi tốt nghiệp trước dự kiến nếu không được phép đăng ký học thêm các môn thực tập, thí nghiệm không?",
            "Làm thế nào để hoàn thành khóa học sớm hơn nếu không thể đăng ký học thêm các môn thực tập, thí nghiệm?"
         ],
         "responses": [
            "Điều kiện để SV có thể xin học vượt các môn học thực tập, thí nghiệm như sau:Không nợ môn học (theo Chương trình đào tạo) tính đến thời điểm xin đăng ký học vượt.Có điểm trung bình chung tích lũy > 7,5 SV đủ điều kiện trên làm đơn gởi Bộ môn và Khoa phê duyệt (kèm theo bảng điểm). Khoa sẽ tổng hợp danh sách và can thiệp với Phòng Đào tạo đăng ký bằng tay cho SV"
         ]
      },
      {
         "tag": "huymonthinghiem",
         "patterns": [
            "Có được hủy môn học thực tập và thí nghiệm không?",
            "Có thể huỷ đăng ký môn học thực tập và thí nghiệm không?",
            "Sinh viên có quyền hủy đăng ký môn học thực tập và thí nghiệm không?",
            "Có được phép hủy đăng ký môn học thực tập và thí nghiệm không?",
            "Có thể hủy môn học thực tập và thí nghiệm sau khi đã đăng ký không?",
            "Sinh viên có khả năng hủy môn học thực tập và thí nghiệm sau khi đã đăng ký không?",
            "Có quyền hủy đăng ký môn học thực tập và thí nghiệm theo ý muốn không?",
            "Có được hủy môn học thực tập và thí nghiệm sau khi đã đăng ký không?",
            "Sinh viên có thể hủy đăng ký môn học thực tập và thí nghiệm nếu cần thiết không?",
            "Có thể yêu cầu hủy môn học thực tập và thí nghiệm sau khi đã đăng ký không?",
            "Sinh viên có khả năng yêu cầu hủy môn học thực tập và thí nghiệm sau khi đã đăng ký không?"
         ],
         "responses": [
            "Không được vì sẽ ảnh hưởng đến kế hoạch học tập của các SV khác trong nhóm, ngoại trừ các trường hợp sau:Sinh viên đã hoàn tất môn học (nhưng do có sự nhầm lẫn trong hệ thống): SV liên hệ với phòng Đào tạo để được huỷ.Có lý do rất chính đáng. SV làm đơn có sự cho phép hủy môn học của Bộ môn quản ngành, Bộ môn quản môn học và trình khoa xem xét cụ thể từng trường hợp."
         ]
      },
      {
         "tag": "montuchon",
         "patterns": [
            "Sinh viên có quyền chọn môn trong danh sách các môn tự chọn không?",
            "Có được tự do chọn môn học từ danh sách các môn tự chọn không?",
            "Sinh viên có thể tự do lựa chọn môn học từ danh sách các môn tự chọn không?",
            "Có quyền tự do chọn môn học từ danh sách các môn tự chọn hay không?",
            "Có được lựa chọn môn học từ danh sách các môn tự chọn theo ý muốn không?",
            "Sinh viên có thể tự ý chọn môn học từ danh sách các môn tự chọn không?",
            "Có quyền lựa chọn môn học từ danh sách các môn tự chọn theo mong muốn không?",
            "Sinh viên có thể tự do chọn môn học từ danh sách các môn tự chọn theo ý thích không?",
            "Có được tự chọn môn học từ danh sách các môn tự chọn theo sở thích không?",
            "Sinh viên có quyền tự chọn môn học từ danh sách các môn tự chọn dựa trên mong muốn cá nhân không?",
            "Có được tự ý chọn môn học từ danh sách các môn tự chọn không?"
         ],
         "responses": [
            "SV được quyền chọn môn học nếu như môn học đó có mở lớp trong học kỳ. SV được chọn môn học tự chọn khác để học nếu rớt môn tự chọn trước đó miễn sao tích lũy đủ số tín chỉ của các môn tự chọn"
         ]
      },
      {
         "tag": "tinchitoida",
         "patterns": [
            "Số tín chỉ tối đa trong một học kỳ được phép đăng ký?",
            "Có giới hạn về số tín chỉ tối đa mà sinh viên có thể đăng ký trong một học kỳ không?",
            "Sinh viên có được phép đăng ký bao nhiêu tín chỉ là tối đa trong một học kỳ?",
            "Giới hạn số tín chỉ cao nhất mà mỗi sinh viên có thể đăng ký trong một học kỳ là bao nhiêu?",
            "Số tín chỉ tối đa mà sinh viên được phép đăng ký trong mỗi học kỳ là bao nhiêu?",
            "Có quy định gì về số tín chỉ tối đa mà sinh viên có thể đăng ký trong một học kỳ không?",
            "Sinh viên được phép đăng ký một số tín chỉ tối đa là bao nhiêu trong một học kỳ?",
            "Có hạn chế về số tín chỉ mà sinh viên có thể đăng ký trong mỗi học kỳ không?",
            "Giới hạn về số tín chỉ tối đa mà sinh viên có thể đăng ký trong một kỳ học là bao nhiêu?",
            "Số tín chỉ lớn nhất mà sinh viên có thể đăng ký trong mỗi học kỳ là bao nhiêu?"
         ],
         "responses": [
            "từ 15 tín chỉ đến 35 tín chỉ."
         ]
      },
      {
         "tag": "lopclc",
         "patterns": [
            "sinh viên đại trà có được đăng ký môn học cùng mã môn học nhưng dành cho lớp Chất lượng cao",
            "Sinh viên đại trà có thể đăng ký học môn cùng mã với lớp Chất lượng cao không?",
            "Có được phép đăng ký môn học cùng mã với lớp CLC nhưng em là sinh viên đại trà không?",
            "Liệu sinh viên lớp đại trà có thể đăng ký môn học giống như trong lớp Chất lượng cao không?",
            "Có cách nào để sinh viên đại trà đăng ký môn học cùng mã với lớp CLC không?",
            "Sinh viên đại trà có quyền đăng ký môn học giống như lớp CLC không?",
            "Có được đăng ký môn học giống với lớp CLC nhưng em là sinh viên đại trà không?",
            "Có phải sinh viên đại trà có thể chọn các môn học giống như trong lớp Chất lượng cao không?",
            "Sinh viên đại trà có thể chọn đăng ký môn học cùng mã với lớp CLC không?",
            "Có cách nào để đăng ký môn học giống với lớp CLC cho sinh viên đại trà không?",
            "Sinh viên lớp đại trà có thể đăng ký môn học tương tự như lớp CLC không?"
         ],
         "responses": [
            "Sinh viên không được đăng ký."
         ]
      },
      {
         "tag": "dkthuctap",
         "patterns": [
            "Điều kiện nào để được đăng ký Thực tập tốt nghiệp?",
            "Cần phải đáp ứng những tiêu chí gì để được đăng ký Thực tập tốt nghiệp?",
            "Để đăng ký Thực tập tốt nghiệp, sinh viên cần thỏa mãn những điều kiện gì?",
            "Có những yêu cầu gì cần được đáp ứng để đăng ký Thực tập tốt nghiệp?",
            "Sinh viên cần thực hiện những điều gì để được đăng ký Thực tập tốt nghiệp?",
            "Để tham gia Thực tập tốt nghiệp, sinh viên cần đáp ứng những tiêu chí nào?",
            "Những điều kiện nào là cần thiết để tham gia vào chương trình Thực tập tốt nghiệp?",
            "Để được đăng ký Thực tập tốt nghiệp, sinh viên cần phải đáp ứng những yêu cầu gì?",
            "Cần tuân thủ những điều gì để tham gia vào chương trình Thực tập tốt nghiệp?",
            "Sinh viên cần thực hiện những điều gì để đủ điều kiện tham gia Thực tập tốt nghiệp?",
            "Điều kiện nào là quan trọng để đăng ký Thực tập tốt nghiệp?"
         ],
         "responses": [
            "SV đã hoàn tất năm 3 trở đi có thể đăng ký Thực tập tốt nghiệp trong học kỳ chính thức hoặc học kỳ hè (liên hệ đăng ký với Bộ môn quản ngành vào tuần đầu mỗi học kỳ)."
         ]
      },
      {
         "tag": "dkhk3",
         "patterns": [
            "Điều kiện nào để được đăng ký học trong học kỳ 3",
            "Điều gì là cần thiết để được đăng ký học trong học kỳ 3?",
            "Có những yêu cầu gì để đăng ký học trong học kỳ 3?",
            "Những điều kiện nào cần phải đáp ứng để đăng ký học trong học kỳ 3?",
            "Để đăng ký học trong học kỳ 3, sinh viên cần thỏa mãn những điều kiện gì?",
            "Có những điều gì sinh viên cần cân nhắc trước khi đăng ký học trong học kỳ 3?",
            "Để đăng ký học trong học kỳ 3, sinh viên phải đáp ứng những yêu cầu gì?",
            "Những điều kiện nào cần được đáp ứng để đăng ký học trong học kỳ 3?",
            "Điều gì là quan trọng khi muốn đăng ký học trong học kỳ 3?",
            "Sinh viên cần thỏa mãn những tiêu chí gì để được đăng ký học trong học kỳ 3?",
            "Để đăng ký học trong học kỳ 3, có những điều kiện nào mà sinh viên cần phải đạt được?"
         ],
         "responses": [
            "HK hè thường dùng để tổ chức các lớp học lại hoặc các lớp thực hành học mới và các lớp thực hành trễ tiến độ (để giảm tải về trang thiết bị thực hành cho học kỳ tiếp), không khuyến khích mở các lớp lý thuyết học mới. Để tổ chức được lớp trong HK hè thì cũng phải đảm bảo về số lượng SV để mở lớp theo quy định (60 sinh viên cho các môn học đại cương và sư phạm và 30 sinh viên cho các môn học chuyên ngành) và phải có GV đồng ý giảng dạy. Với các môn học đại cương, phòng Đào tạo thống kê số SV không đạt để dự kiến mở lớp."
         ]
      },
      {
         "tag": "tgianhk3",
         "patterns": [
            "HK hè học trong bao lâu và được đăng ký tối đa bao nhiêu tín chỉ?",
            "Thời gian học trong học kỳ hè kéo dài bao lâu và sinh viên được phép đăng ký tối đa bao nhiêu tín chỉ?",
            "Học kỳ hè kéo dài trong bao lâu và có giới hạn tín chỉ tối đa mà sinh viên có thể đăng ký không?",
            "Có thời gian học bao lâu trong học kỳ hè và sinh viên được đăng ký tối đa bao nhiêu tín chỉ?",
            "Học kỳ hè kéo dài trong khoảng thời gian bao lâu và có bao nhiêu tín chỉ tối đa mà sinh viên có thể đăng ký?",
            "Trong học kỳ hè, thời gian học kéo dài trong bao lâu và sinh viên có thể đăng ký tối đa bao nhiêu tín chỉ?",
            "Thời gian học trong học kỳ hè kéo dài trong khoảng bao nhiêu tuần và có giới hạn tín chỉ tối đa không?",
            "Học kỳ hè kéo dài trong khoảng thời gian bao lâu và sinh viên có được phép đăng ký tối đa bao nhiêu tín chỉ?",
            "Trong học kỳ hè, thời gian học kéo dài trong bao lâu và có giới hạn tín chỉ tối đa mà sinh viên có thể đăng ký không?",
            "Thời gian học trong học kỳ hè kéo dài trong bao nhiêu tuần và có bao nhiêu tín chỉ tối đa mà sinh viên có thể đăng ký?",
            "Học kỳ hè kéo dài trong khoảng thời gian bao lâu và có giới hạn về số tín chỉ mà sinh viên có thể đăng ký không?"
         ],
         "responses": [
            "Hk hè học trong 5 tuần và thêm 1 tuần thi kết thúc môn. Theo qui định của Phòng Đào tạo: Số tín chỉ sinh viên được đăng ký tối đa là 10 TC lý thuyết hoặc 05 TC thực hành."
         ]
      },
      {
         "tag": "hocvuothieuqua",
         "patterns": [
            "Làm sao để biết đăng ký môn học nào để học vượt cho phù hợp?",
            "Làm thế nào để xác định các môn học phù hợp cho việc đăng ký học vượt?",
            "Cách nào để chọn môn học để đăng ký học vượt?",
            "Làm sao để biết được môn học nào thích hợp để đăng ký học vượt?",
            "Có phương pháp nào giúp tìm ra các môn học phù hợp cho việc đăng ký học vượt không?",
            "Làm thế nào để lựa chọn môn học để đăng ký học vượt một cách hiệu quả?",
            "Cách tìm hiểu về các môn học để chọn môn học học vượt?",
            "Có cách nào để xác định môn học nên đăng ký học vượt không?",
            "Làm sao để biết được môn học nào phù hợp với việc học vượt?",
            "Có thể sử dụng phương pháp nào để chọn môn học để học vượt?",
            "Có cách nào để xác định môn học phù hợp với nhu cầu đăng ký học vượt không?"
         ],
         "responses": [
            "Có một số môn học mà nếu chưa học trước một số môn khác thì không thể học nó được. Do đó khi đăng ký học vượt, chúng ta cần tham khảo Kế hoạch đào tạo (cách bố trí các môn học trong các học kỳ) trong chương trình đào tạo của ngành (xem trên web của khoa). Trong mỗi môn học đều có quy định môn học tiên quyết, môn học trước. Vậy nếu chưa học một trong các môn này thì không nên đăng ký học môn đó. Nếu cần, sinh viên liên hệ với nhóm tư vấn để được tư vấn trực tiếp."
         ]
      },
      {
         "tag": "ngoaictdaotao",
         "patterns": [
            "Sinh viên có thể đăng ký học những môn ngoài chương trình đào tạo không? ",
            "Có được phép đăng ký học những môn không thuộc chương trình đào tạo không?",
            "Sinh viên có thể đăng ký học các môn học không được liệt kê trong chương trình đào tạo không?",
            "Có thể đăng ký học những môn ngoài khung chương trình học không?",
            "Có được phép tham gia vào các khóa học không thuộc chương trình đào tạo chính không?",
            "Sinh viên có tự do lựa chọn đăng ký học những môn học bổ sung không?",
            "Có được phép đăng ký học những môn nâng cao không có trong chương trình chính không?",
            "Sinh viên có thể tự do đăng ký học những môn học tự chọn không?",
            "Có được phép tham gia vào các lớp học không thuộc chương trình chính không?"
         ],
         "responses": [
            "SV có thể đăng ký học những môn ngoài chương trình đào tạo nhưng không được tính vào bảng điểm hay số tín chỉ tích lũy"
         ]
      },
      {
         "tag": "tuvanhocvuot",
         "patterns": [
            "Sinh viên có nên đăng ký học vượt hay không?",
            "Nên hay không nên đăng ký học vượt?",
            "Sinh viên có nên đăng ký học nhiều môn hơn số lượng môn yêu cầu không?",
            "Em có nên đăng ký học vượt không?",
            "Em muốn học vượt mà không biết ổn không?",
            "Sinh viên muốn học vượt phải đảm bảo gì"

         ],
         "responses": [
            "Việc đăng ký học vượt để hoàn thành chương trình học hoàn toàn tùy thuộc vào trình độ, năng lực và sự quyết tâm của các bạn sinh viên. Tuy nhiên các bạn sinh viên cần lưu ý, hiện tại chương trình học cho từng học kỳ của các bạn đã được bộ môn sắp xếp cho phù hợp với năng lực và khả năng của đa số các bạn sinh viên. Lượng kiến thức trong từng học kỳ cũng đã được các thầy cô tính toán hợp lý. Vì vậy, các bạn sinh viên phải suy nghĩ và cân nhắc thật kỹ trước khi quyết định học vượt, nhằm tránh tình trạng các bạn khi đăng ký học vượt lại có điểm trung bình tích lũy thấp"
         ]
      },
      {
         "tag": "xoamondkmh",
         "patterns": [
            "có cách nào xóa môn học sau khi hết thời gian đăng ký môn học?",
            "Làm sao để hủy môn học sau khi hết thời gian đăng ký?",
            "Có phương pháp nào để loại bỏ một môn học khi đã vượt quá thời gian đăng ký không?",
            "Sinh viên có thể thực hiện thủ tục hủy môn học sau khi hết hạn đăng ký không?",
            "Có cách nào để gỡ bỏ một môn học khi đã qua thời hạn đăng ký không?",
            "Sau khi hết thời gian đăng ký, sinh viên có thể thực hiện thủ tục xóa môn học không?",
            "Làm thế nào để huỷ đăng ký môn học sau khi thời gian đăng ký đã kết thúc?",
            "Sau khi hết hạn đăng ký, có cách nào để loại bỏ một môn học không?",
            "Có phương pháp nào để hủy bỏ một môn học sau khi đã qua thời gian đăng ký không?",
            "Làm thế nào để xóa một môn học khi đã hết thời gian đăng ký?",
            "Sinh viên có thể thực hiện thủ tục hủy môn học sau khi thời gian đăng ký đã kết thúc không?"
         ],
         "responses": [
            "Thời gian đăng ký môn học 1 tuần và thời gian điều chỉnh 1 tuần. Trong thời gian này sinh viên có thể thay đổi thời khóa biểu của mình, nếu em xóa môn học thì không phải đóng học phí. Tuy nhiên, một số môn học như thực tập không được xóa. Sau thời gian trên sinh viên rút môn học phải đóng học phí, điểm nhập là RT (không tính điểm). Những trường hợp đặc biệt xin xóa môn học sau thời gian điều chỉnh, sinh viên làm đơn xin ý kiến của Khoa và Phòng Đào tạo"
         ]
      },
      {
         "tag": "tuvananhvan",
         "patterns": [
            "Học kỳ trước em rút môn Anh văn 2. Học kỳ này em đăng ký Anh văn 2 và Anh văn 3 có được không?",
            "Em đã rút môn Anh văn 2 trong học kỳ trước. Kỳ này, em có thể đăng ký học lại môn Anh văn 2 và cũng đăng ký môn Anh văn 3 được không?",
            "Trước đó, em đã rút môn Anh văn 2. Liệu trong học kỳ này, em có thể đăng ký học môn Anh văn 2 lại và cùng đăng ký môn Anh văn 3 không?",
            "Sau khi rút môn Anh văn 2 ở học kỳ trước, liệu em có thể đăng ký học lại môn đó và đăng ký môn Anh văn 3 trong học kỳ này không?",
            "Có được phép đăng ký học lại môn Anh văn 2 sau khi rút trong học kỳ trước, và cũng đăng ký học môn Anh văn 3 trong học kỳ này không?"
         ],
         "responses": [
            "Hiện tại Phòng Đào tạo chỉ kiểm tra điều kiện môn học trước, môn học tiên quyết cũng chỉ kiểm tra tính chất môn học trước. Nếu Anh văn 2 là môn học trước của môn Anh văn 3 thì em đã đăng ký Anh văn 2, bây giờ em được phép đăng ký Anh văn 3 (môn học trước chỉ cần đăng ký không bắt buộc đạt). Riêng môn Anh văn 2 em có quyền đăng ký học lại trong học kỳ này. Như vậy 2 môn trên có thể đăng ký cùng 1 lúc và kết quả học sẽ tính vào kết quả học kỳ, năm học, tích lũy"
         ]
      },
      {
         "tag": "hpquansu",
         "patterns": [
            "Em bị rớt học phần quân sự, học kỳ hè này em có thể đăng ký học lại chung với khóa sau được không?",
            "Có được đăng ký học lại học phần quân sự trong kỳ hè và học chung với khóa sau không?",
            "Trong kỳ hè này, có cơ hội đăng ký học lại môn quân sự và học chung với sinh viên khóa sau không?",
            "Em có thể đăng ký học lại môn quân sự trong kỳ hè và tham gia lớp học của khóa sau không?",
            "Có thể học lại môn quân sự trong kỳ hè và tham gia lớp học cùng với sinh viên khóa sau không?",
            "Trong kỳ hè này, em có thể đăng ký học lại môn quân sự và học cùng với sinh viên của khóa sau không?",
            "Có cơ hội đăng ký học lại môn quân sự trong kỳ hè và tham gia lớp học với sinh viên khóa sau không?",
            "Trong kỳ hè này, có được đăng ký học lại môn quân sự và học chung với sinh viên khóa sau không?",
            "Em có thể tham gia lớp học môn quân sự của khóa sau trong kỳ hè không?",
            "Có được đăng ký học lại môn quân sự và tham gia lớp học của khóa sau trong kỳ hè không?",
            "Trong kỳ hè này, em có thể đăng ký học lại môn quân sự và học cùng với sinh viên khóa sau không?"
         ],
         "responses": [
            "Học kỳ hè (học kỳ 3), phòng Đào tạo (PĐT) sẽ tổ chức các lớp học giáo dục quốc phòng (GDQP) 1,2,3. SV học đúng tiến độ sẽ được PĐT xếp lịch học cứng, những trường hợp xin xóa môn học thì làm đơn nộp PĐT để được xem xét. Các SV khóa trước nếu rớt học phần nào thì đăng ký học lại học phần đó theo thông báo ĐKMH qua mạng của PĐT. Em xem thông báo và đăng ký nhé"
         ]
      },
      {
         "tag": "chuyenmonhoc",
         "patterns": [
            "Sau thời gian đăng ký môn học, em có được chuyển nhóm môn học không?",
            "Nếu đã đăng ký môn học, liệu có thể chuyển sang nhóm học khác không?",
            "Sau khi hoàn thành việc đăng ký môn học, có cơ hội chuyển sang nhóm học khác không?",
            "Có thể thay đổi nhóm môn học sau khi đã hoàn tất việc đăng ký không?",
            "Sau khi đã đăng ký môn học, có được phép chuyển sang nhóm học khác không?",
            "Sau thời gian đăng ký môn học, có cơ hội thay đổi nhóm học không?",
            "Sau khi hoàn tất việc đăng ký môn học, có thể yêu cầu chuyển sang nhóm học khác không?",
            "Có được phép chuyển nhóm môn học sau khi đã đăng ký không?",
            "Sau thời gian đăng ký môn học, có thể yêu cầu chuyển sang nhóm học khác được không?",
            "Có thể thay đổi nhóm môn học sau khi đã hoàn thành việc đăng ký không?"
         ],
         "responses": [
            "SV điều chỉnh đăng ký môn học trong thời gian được phép điều chỉnh (theo thông báo của Phòng Đào tạo). Hết thời gian trên SV phải học theo thời khóa biểu của mình và không được chuyển nhóm. Trong trường hợp đặc biệt, SV làm đơn nộp tại PĐT để được xem xét."
         ]
      },
      {
         "tag": "dkpdaotao",
         "patterns": [
            "Khi đăng ký môn học qua mạng không được thì có thể đăng ký tay tại phòng Đào tạo không?",
            "Nếu không thể đăng ký môn học trực tuyến, có thể đăng ký tại phòng Đào tạo không?",
            "Khi không thể đăng ký môn học qua hệ thống trực tuyến, đăng ký trực tiếp tại phòng Đào tạo không?",
            "Đăng ký môn học bằng cách truy cập trực tuyến không thành công,có thể đến phòng Đào tạo để đăng ký không?",
            "Nếu gặp vấn đề khi đăng ký môn học trực tuyến, có cơ hội đăng ký môn học tại phòng Đào tạo không?",
            "Khi gặp khó khăn trong việc đăng ký môn học qua mạng, đăng ký trực tiếp tại phòng Đào tạo được không?",
            "Nếu không thể hoàn thành việc đăng ký môn học trực tuyến, đến phòng Đào tạo để được hỗ trợ không?",
            "Trong trường hợp không thể đăng ký môn học qua hệ thống trực tuyến, đến phòng Đào tạo để giải quyết không?",
            "Khi gặp vấn đề với việc đăng ký môn học qua mạng, liệu có thể đến phòng Đào tạo để nhận sự hỗ trợ không?",
            "Khi gặp khó khăn trong việc đăng ký môn học qua mạng, liệu có thể tìm đến phòng Đào tạo để được hỗ trợ không?"
         ],
         "responses": [
            "những trường hợp SV không đăng ký được môn học do không còn chỗ hoặc không mở lớp, SV liên hệ Khoa để được giải quyết. Phòng Đào tạo sẽ tiếp nhận các đề xuất từ Khoa. "
         ]
      },
      {
         "tag": "quytactrondiem",
         "patterns": [
            "Quy tắc làm tròn điểm như thế nào?",
            "Điểm học phần là 6.75 có làm tròn thành 6.8 ",
            "Làm thế nào để làm tròn điểm theo quy tắc?",
            "Quy định về việc làm tròn điểm là gì?",
            "Cách làm tròn điểm được quy định như thế nào?",
            "Quy định về làm tròn điểm được thực hiện như thế nào?",
            "Làm sao để thực hiện quy định về làm tròn điểm?",
            "Theo quy tắc, việc làm tròn điểm được thực hiện như thế nào?",
            "Có quy tắc nào để làm tròn điểm không?",
            "Làm tròn điểm được thực hiện theo quy định nào?",
            "Việc làm tròn điểm được điều chỉnh như thế nào?",
            "Theo quy định, làm tròn điểm được thực hiện ra sao?"
         ],
         "responses": [
            "Điểm học phần làm tròn 01 chữ số thập phân (Ví dụ: điểm học phần là 6,75 được làm tròn là 6,8).Điểm trung bình chung học kỳ, năm học, tích lũy làm tròn hai chữ số thập phân (Ví dụ: 6,495 làm tròn thành 6,50 ; còn 6,494 thì làm tròn thành 6,49)."
         ]
      },
      {
         "tag": "hocaithien",
         "patterns": [
            "Khi học cải thiện một môn học thì sẽ được lấy điểm cao hơn hay là điểm của lần học sau cùng?",
            "Nếu cải thiện một môn học, điểm cao nhất sẽ được tính hay là điểm của lần học sau cùng?",
            "Khi học cải thiện một môn, điểm cao nhất sẽ được áp dụng hay là điểm cuối cùng?",
            "Điểm cao nhất của các lần học cải thiện sẽ được tính hay là điểm của lần cuối cùng?",
            "Trong trường hợp cải thiện điểm, liệu điểm cao nhất sẽ được sử dụng hay không?",
            "Khi cải thiện một môn học, điểm cao nhất sẽ được dùng hay là điểm của lần học cuối cùng?",
            "Điểm nào sẽ được chấp nhận nếu cải thiện một môn học: điểm cao nhất hay điểm của lần học sau cùng?",
            "Trong trường hợp học cải thiện, điểm nào sẽ được ưu tiên: điểm cao nhất hay điểm cuối cùng?",
            "Khi cải thiện một môn học, điểm cao nhất sẽ được dùng làm điểm cuối cùng hay không?",
            "Điểm nào sẽ được sử dụng nếu cải thiện một môn học: điểm cao nhất hay điểm của lần học gần nhất?",
            "Trong trường hợp học cải thiện, điểm cao nhất sẽ được lấy hay là điểm của lần học sau cùng?"
         ],
         "responses": [
            "Theo qui định sẽ lấy điểm cao nhất trong các lần thi. "
         ]
      },
      {
         "tag": "diemI",
         "patterns": [
            "Làm sao để xin điểm I? ",
            "Muốn trả điểm I thì phải làm thế nào?",
            "Làm thế nào để đăng ký xin điểm I?",
            "Cách nào để yêu cầu được điểm I?",
            "Muốn nhận điểm I, em phải thực hiện thủ tục gì?",
            "Làm sao để đề nghị trả lại điểm I?",
            "Cần phải thực hiện bước gì để xin điểm I?",
            "Những gì cần làm để được ghi điểm I?",
            "Muốn nhận điểm I, em phải tuân theo quy trình nào?",
            "Làm sao để được xét điểm I?",
            "Có cách nào để yêu cầu trả lại điểm I không?",
            "Để đề nghị điểm I, em cần phải làm gì?"
         ],
         "responses": [
            "Muốn xin điểm I, sinh viên làm đơn gởi Văn phòng khoa (kèm theo các minh chứng cần thiết) trước ngày thi 7 ngày cho đến tối đa sau ngày thi 7 ngày. Sau khi có xác nhận của Khoa, SV nộp đơn tại phòng Đào tạo và nhận lại đơn xin điểm I theo giấy hẹn của Phòng Đào tạo.Muốn trả điểm I, sinh viên phôtô đơn xin điểm I (kèm theo bảng gốc) và nộp cho Văn phòng khoa trước ngày thi 1 tuần"
         ]
      },
      {
         "tag": "monhochthaythe",
         "patterns": [
            "Em đã làm đơn thay thế môn học và thi đạt, tại sao trong bảng điểm môn học đó vẫn chưa đạt?",
            "Tại sao môn học em đã làm đơn thay thế và thi đạt nhưng vẫn ghi là chưa đạt trong bảng điểm?",
            "Làm sao mà môn học em đã thi đạt và nộp đơn thay thế nhưng kết quả vẫn là chưa đạt trong bảng điểm?",
            "Vì sao môn học em đã thay thế và thi đạt lại không được ghi là đã đạt trong bảng điểm?",
            "Lý do tại sao sau khi em thi đạt và nộp đơn thay thế môn học, kết quả vẫn là chưa đạt trong bảng điểm?",
            "Tại sao môn học em đã làm đơn thay thế và thi đạt nhưng vẫn không được coi là đã đạt trong bảng điểm?",
            "Làm thế nào để môn học em đã thi đạt và nộp đơn thay thế được ghi là đã đạt trong bảng điểm?",
            "Vì sao kết quả môn học em thay thế và thi đạt lại không thay đổi trong bảng điểm?",
            "Tại sao môn học em đã làm đơn thay thế và thi đạt nhưng vẫn không được công nhận trong bảng điểm?",
            "Vì sao môn học em đã làm đơn thay thế và thi đạt vẫn không được coi là đã đạt trong bảng điểm?"
         ],
         "responses": [
            "Tất cả các môn học Sinh viên học đều được in trong bảng điểm. Với những môn học tương đương thì điểm lấy cao nhất trong các lần thi và in 1 dòng. Riêng các môn học làm đơn thay thế để xét tốt nghiệp sau này thì trong bảng điểm in toàn bộ các môn đã từng học"
         ]
      },
      {
         "tag": "loaitotnghiep",
         "patterns": [
            "Tại sao sinh viên tốt nghiệp loại giỏi lại bị hạ bậc tốt nghiệp thành loại khá ?",
            "Tại sao sinh viên được xếp loại tốt nghiệp giỏi lại bị giảm thành loại khá?",
            "Vì sao sinh viên đạt loại tốt nghiệp giỏi lại bị hạ bậc xuống loại khá?",
            "Tại sao sinh viên đã được xếp loại giỏi lại bị giảm hạng xuống loại khá khi tốt nghiệp?",
            "Lý do gì khiến sinh viên tốt nghiệp loại giỏi bị hạ bậc xuống loại khá?",
            "Tại sao sinh viên với thành tích loại giỏi lại bị giảm hạng tốt nghiệp thành loại khá?",
            "Vì sao sinh viên tốt nghiệp loại giỏi lại bị giảm hạng xuống loại khá?",
            "Lý do gì khiến sinh viên tốt nghiệp loại giỏi bị hạ xuống loại khá?"        
         ],
         "responses": [
            "Hạng tốt nghiệp của sinh viên có kết quả học tập toàn khóa loại xuất sắc và giỏi sẽ bị giảm đi một mức, nếu rơi vào một trong các trường hợp sau: Có khối lượng các học phần phải học lại vượt quá 5% so với tổng số tín chỉ quy định cho toàn chương trình; Đã bị kỷ luật từ mức cảnh cáo trở lên trong thời gian học."
         ]
      },
      {
         "tag": "hanrutmon",
         "patterns": [
            "Trong mỗi học kỳ hạn rút môn học như thế nào?",
            "Làm thế nào để hủy đăng ký môn học trong mỗi kỳ học?",
            "Cách thức để rút môn học trong mỗi học kỳ là gì?",
            "Em có thể thực hiện thủ tục rút môn học trong mỗi kỳ học như thế nào?",
            "Làm sao để hủy bỏ môn học trong mỗi kỳ học?",
            "Có cách nào để rút môn học trong mỗi học kỳ không?",
            "Thủ tục rút môn học trong mỗi kỳ học là gì?",
            "Làm thế nào để huỷ đăng ký môn học trong mỗi kỳ học?",
            "Có phương pháp nào để rút môn học trong mỗi học kỳ không?",
            "Thủ tục hủy đăng ký môn học trong mỗi học kỳ như thế nào?",
            "Làm thế nào để hủy môn học trong mỗi kỳ học?"
         ],
         "responses": [
            "Sau khi kết thúc tuần điều chỉnh đăng ký môn học trên mạng, Sinh viên muốn rút bớt học phần đã đăng ký thì phải làm đơn và nộp tại Phòng Đào tạo, những học phần này không tính điểm (ký hiệu RT trong bảng điểm) nhưng phải đóng học phí. Thời hạn nộp đơn là trước ngày bắt đầu kỳ thi học kỳ 05 tuần"
         ]
      },
      {
         "tag": "hocphangdqp",
         "patterns": [
            "Học phần GDQP có quan trọng và bắt buộc không?",
            "Học phần Giáo dục quốc phòng (GDQP) có cần thiết và bắt buộc không?",
            "Việc học GDQP có quan trọng và là điều bắt buộc không?",
            "GDQP có phải là một phần quan trọng và bắt buộc trong chương trình học không?",
            "Có cần thiết và yêu cầu học GDQP không?",
            "GDQP có quan trọng và cần phải học không?",
            "Việc học GDQP có quan trọng và là điều không thể bỏ qua không?",
            "GDQP có phải là một phần không thể thiếu và bắt buộc không?",
            "Học GDQP có tính bắt buộc và quan trọng không?",
            "GDQP có phải là một môn học quan trọng và cần phải học không?"
         ],
         "responses": [
            "GDQP là một học phần bắt buộc trong chương trình. Kết thúc khóa học Sinh viên sẽ được cấp chứng chỉ. Sinh viên liên hệ phòng Đào tạo đê nhận chứng chỉ đó, lưu ý nhận theo kế hoạch và theo lớp, chứ không liên hệ rải rác."
         ]
      },
      {
         "tag": "diemtrungbinh",
         "patterns": [
            "Sinh viên có ĐTB học kỳ 1 là 0.0 có bị buộc thôi học không? ",
            "Nếu Điểm Trung Bình (ĐTB) học kỳ 1 là 0.0, liệu em có bị buộc thôi học không?",
            "Có bị buộc thôi học không nếu ĐTB học kỳ 1 của em là 0.0?",
            "ĐTB học kỳ 1 là 0.0 có ảnh hưởng gì đến việc em bị buộc thôi học không?",
            "Nếu em có ĐTB học kỳ 1 là 0.0, liệu có bị buộc thôi học không?",
            "Có bị buộc thôi học không nếu em có ĐTB học kỳ 1 là 0.0?",
            "ĐTB học kỳ 1 là 0.0 có gây ra việc em bị buộc thôi học không?",
            "Nếu ĐTB học kỳ 1 của em là 0.0, liệu có bị buộc thôi học không?",
            "Có ảnh hưởng gì đến việc em bị buộc thôi học nếu ĐTB học kỳ 1 là 0.0?",
            "Nếu em có ĐTB học kỳ 1 là 0.0, liệu có phải bị buộc thôi học không?",
            "Có phải bị buộc thôi học nếu ĐTB học kỳ 1 của em là 0.0 không?"            
         ],
         "responses": [
            "Xét buộc thôi học căn cứ Điều 16 Hướng dẫn 125 của trường về thực hiện Quy chế 43 của Bộ GD&ĐT. Theo đó, nếu em bị điểm 0.0 các học phần ở học kỳ 1, em sẽ có tên trong danh sách cảnh báo học vụ. Xét buộc thôi học sẽ tiến hành vào cuối học kỳ 3, tính dựa trên ĐTB năm học. Do đó, ĐTB học kỳ 1 của em sẽ ảnh hưởng rất lớn đến ĐTB năm học và có nguy cơ em bị buộc thôi học. Nếu trong học kỳ 1 em gặp điều kiện trở ngại nào đó mà không thể đi thi được thì em có thể làm đơn xin nhận điểm I hoặc xin tạm dừng học (điểm RT). Điểm này không tính vào điểm TB học kỳ nên sẽ không ảnh hưởng đến kết quả học tập cả năm của em. Tuy nhiên khi dự thi trả điểm I thì điểm sẽ nhập vào điểm học kỳ đó. Lúc đó sẽ ảnh hưởng ĐTB năm học."
         ]
      },
      {
         "tag": "dkthemnganh",
         "patterns": [
            "Em đang học ngành CNKT Máy tính. Vậy sang năm 2, em có thể đăng ký thêm ngành Sư phạm CNTT có được không? ",
            "Năm thứ hai, có được đăng ký thêm ngành Sư phạm CNTT nếu em đang học ngành CNKT Máy tính không?",
            "Năm thứ hai, liệu em có thể đăng ký thêm ngành Sư phạm CNTT nếu đã chọn ngành CNKT Máy tính chưa?",
            "Có thể đăng ký thêm ngành Sư phạm CNTT vào năm thứ hai khi em đang theo học ngành CNKT Máy tính không?",
            "Năm thứ hai, có được đăng ký thêm ngành Sư phạm CNTT không nếu em đã chọn ngành CNKT Máy tính?",
            "Có được đăng ký thêm ngành Sư phạm CNTT vào năm thứ hai nếu em đã học ngành CNKT Máy tính không?",
            "Năm thứ hai, liệu em có thể đăng ký thêm ngành Sư phạm CNTT không khi đã chọn ngành CNKT Máy tính?",
            "Có thể đăng ký thêm ngành Sư phạm CNTT vào năm thứ hai khi đã học ngành CNKT Máy tính không?",
            "Năm thứ hai, có được đăng ký thêm ngành Sư phạm CNTT không nếu đã chọn ngành CNKT Máy tính?",
            "Có được đăng ký thêm ngành Sư phạm CNTT vào năm thứ hai nếu đã học ngành CNKT Máy tính không?",
            "Năm thứ hai, liệu em có thể đăng ký thêm ngành Sư phạm CNTT không nếu đã chọn ngành CNKT Máy tính?"
         ],
         "responses": [
            "Từ học kỳ 2 của năm nhất, em đã có thể đăng ký học ngành 2 (hay nói khác hơn là học cùng lúc 2 chương trình đào tạo). Em xem thêm điều kiện học ngành 2 bên Mục thông tin học vụ. Việc em đăng ký học ngành Sư phạm CNTT là được, nhưng khác với các bạn đang học ngành Sư phạm chính thức được miễn học phí, em phải đóng học phí cho ngành 2 theo qui định của trường."
         ]
      },
      {
         "tag": "chungchingoaingu",
         "patterns": [
            "Chứng chỉ ngoại ngữ quốc tế nào được miễn học và chuyển điểm Anh văn? ",
            "Có những loại chứng chỉ ngoại ngữ quốc tế nào được miễn học môn Anh văn và chuyển điểm không?",
            "Đối với những chứng chỉ ngoại ngữ quốc tế nào, sinh viên được miễn học môn Anh văn và chuyển điểm?",
            "Có những chứng chỉ nào được công nhận để miễn học môn Anh văn và chuyển điểm cho sinh viên?",
            "Những loại chứng chỉ ngoại ngữ quốc tế nào có thể được sử dụng để miễn học môn Anh văn và chuyển điểm?",
            "Có những loại chứng chỉ nào được công nhận để miễn học môn Anh văn và chuyển điểm cho sinh viên?",
            "Có những loại chứng chỉ nào được công nhận để miễn học môn Anh văn và chuyển điểm không?",
            "Có những loại chứng chỉ nào có thể được sử dụng để miễn học môn Anh văn và chuyển điểm không?"
         ],
         "responses": [
            "Viện Khảo thí giáo dục Hoa kỳ: Educational Testing Service (ETS) hoặc đơn vị do ETS ủy nhiệm (đối với các chứng chỉ TOEIC, TOEFL ITP, TOEFL iBT);British Council, IDP Education Australia (đối với chứng chỉ IELTS);Cambridge ESOL (đối với chứng chỉ BULATS);Điểm chuyển đổi cho các học phần Anh văn được quy đổi theo Quy định 22 (Sinh viên tham khảo bên Thông tin học vụ)."
         ]
      },
      {
         "tag": "rotmontuchon",
         "patterns": [
            "Trong chương trình học có 5 môn tự chọn, yêu cầu học 2 môn. Giả sử em rớt em có thể chọn môn khác không? ",
            "Nếu em rớt một trong 5 môn tự chọn, em có thể chọn môn khác để thay thế không?",
            "Trong trường hợp em rớt một trong 5 môn tự chọn, liệu có lựa chọn khác nào cho em để thay thế môn đó không?",
            "Nếu em không qua một trong 5 môn tự chọn, liệu em có thể chọn môn thay thế không?",
            "Nếu em không đạt điểm đủ để qua một trong 5 môn tự chọn, em có được phép chọn môn khác không?",
            "Trong trường hợp em không vượt qua một trong 5 môn tự chọn, liệu có cơ hội chọn môn thay thế không?",
            "Nếu em không qua một trong 5 môn tự chọn, em có thể chọn môn khác không?",
            "Nếu em không đỗ môn tự chọn, liệu có lựa chọn nào khác cho em để thay thế không?",
            "Trong tình huống một trong 5 môn tự chọn của em bị rớt, em có được phép chọn môn thay thế không?",
            "Nếu em không vượt qua môn tự chọn, em có cơ hội chọn môn khác không?",
            "Nếu một trong 5 môn tự chọn của em không đạt yêu cầu, liệu có cơ hội chọn môn thay thế không?"
         ],
         "responses": [
            "chương trình của em yêu cầu học 2 môn tự chọn trong 5 môn. Nếu em đăng ký 2 môn bất kỳ và thi không đạt môn nào đó thì em có thể đăng ký 1 môn tự chọn khác trong 5 môn học trên"
         ]
      },
      {
         "tag": "dangkyhoclai",
         "patterns": [
            "Môn học em thi rớt nhưng kỳ này không mở lớp học lại, Em muốn đăng ký học để kịp ra trường thì em phải làm sao? ",
            "Nếu em thi rớt môn học nhưng không có lớp học lại trong kỳ này, làm thế nào để đăng ký học môn đó để kịp ra trường?",
            "Nếu không có lớp học lại cho môn em thi rớt, làm thế nào để em có thể đăng ký học lại môn đó để hoàn thành chương trình?",
            "Môn học em thi không mở lớp học lại trong kỳ này, em cần phải làm gì để đăng ký học lại môn đó và không bị trễ ra trường?",
            "Nếu không có lớp học lại cho môn em rớt, làm thế nào để em có thể đăng ký học lại môn đó để đáp ứng yêu cầu tốt nghiệp?",
            "Môn em thi rớt không có lớp học lại trong kỳ này, làm thế nào để em có thể đăng ký học môn đó ở kỳ học sau để không bị trễ tiến độ?"

         ],
         "responses": [
            "Em có thể đăng ký môn học tương đương đã được cập nhật trong chương trình đào tạo của em. Nếu vẫn không mở lớp môn tương đương, em xin ý kiến Khoa để học môn thay thế. Nếu có môn thay thế thì em làm đơn thay thế (mẫu đơn nhận tại Phòng Đào tạo hoặc tải trên trang web PĐT), sau khi được Khoa ký duyệt, em nộp đơn tại PĐT. Sau vài ngày em nhận đơn, nếu được sự đồng ý của PĐT thì em đăng ký môn học này thay thế cho môn học rớt"
         ]
      },
      {
         "tag": "chungchiquocphong",
         "patterns": [
            "Em đã thi đạt tất cả các môn học giáo dục quốc phòng nhưng trong danh sách nhận chứng chỉ quốc phòng không có tên em.",
            "Em đã thi đỗ tất cả các môn học về quốc phòng nhưng tại sao em không có trong danh sách nhận chứng chỉ quốc phòng?",
            "Tại sao sau khi thi đạt các môn học về quốc phòng, em không thấy tên mình trong danh sách nhận chứng chỉ?",
            "Dù đã vượt qua tất cả các môn học giáo dục quốc phòng, sao em không nhận được chứng chỉ quốc phòng?",
            "Em đã đạt điểm đủ trong các môn học về quốc phòng, nhưng tại sao không nhận được chứng chỉ?",
            "Làm thế nào để kiểm tra xem em có đủ điều kiện nhận chứng chỉ quốc phòng sau khi đã thi đạt các môn học?",
            "Em đã hoàn thành các môn học quốc phòng nhưng không có tên để nhận chứng chỉ, làm sao để kiểm tra vấn đề này?",
            "Đã hoàn thành các môn học về quốc phòng, làm sao để xác minh việc không nhận được chứng chỉ?"
         ],
         "responses": [
            "Thông thường trường hợp của em là do em có thi lại hoặc học lại một học phần GDQP nào đó ở học kỳ khác không theo lớp ban đầu. Em nên liên hệ với Khoa quản SV hoặc PĐT để được giải quyết. Khoa hoặc PĐT sẽ liên hệ với Trung tâm GDQP để hỏi nguyên nhân và đề nghị cấp bổ sung cho em. Thủ tục và thời gian sẽ báo cho em để em được biết"
         ]
      },
      {
         "tag": "diemqp-dtb",
         "patterns": [
            "Điểm Giáo dục quốc phòng và thể chất có tính vào điểm trung bình không? ",
            "Điểm của môn Giáo dục quốc phòng và thể chất có tính vào điểm trung bình của sinh viên không?",
            "Liệu điểm môn Giáo dục quốc phòng và thể chất có được tính vào điểm trung bình không?",
            "Có tính vào điểm trung bình hay không, điểm của môn Giáo dục quốc phòng và thể chất?",
            "Môn Giáo dục quốc phòng và thể chất có ảnh hưởng đến điểm trung bình của sinh viên không?",
            "Có phải điểm của môn Giáo dục quốc phòng và thể chất được tính vào điểm trung bình không?",
            "Điểm môn Giáo dục quốc phòng và thể chất có được cộng vào điểm trung bình không?",
            "Có tính vào điểm trung bình hay không, điểm của môn Giáo dục quốc phòng và thể chất?",
            "Liệu điểm môn Giáo dục quốc phòng và thể chất có ảnh hưởng đến điểm trung bình của sinh viên không?",
            "Việc điểm môn Giáo dục quốc phòng và thể chất có thể ảnh hưởng đến điểm trung bình của sinh viên không?"
         ],
         "responses": [
            "Điểm Giáo dục quốc phòng và Giáo dục thể chất không tính vào điểm trung bình chung cũng như số tín chỉ tích lũy. Sinh viên có thể làm đơn miễn thi nộp Phòng Đào tạo nếu sinh viên đã có chứng chỉ hoàn tất ở một trường đại học khác. "
         ]
      },
      {
         "tag": "diemkhongkhop",
         "patterns": [
            "Điểm giảng viên công bố trên lớp và điểm trong bảng điểm không khớp nhau ",
            "điểm giảng viên công bố không khớp phải làm sao",
            "Khi điểm mà giáo viên công bố trên lớp không trùng khớp với điểm trong bảng điểm, em cần thực hiện các bước gì?",
            "Điểm mà giáo viên thông báo trên lớp không giống với điểm trong bảng điểm, em nên làm gì ?",
            "Khi có sự chênh lệch giữa điểm mà giáo viên thông báo trực tiếp và điểm trong bảng điểm, em cần làm gì ?",
            "Em phải làm thế nào khi điểm mà giáo viên công bố trên lớp không khớp với điểm trong bảng điểm?",
            "Khi điểm mà giáo viên thông báo trên lớp không đồng nhất với điểm trong bảng điểm, em cần thực hiện gì?",
            "Em phải thực hiện những bước nào khi điểm mà giáo viên thông báo trên lớp không trùng khớp với điểm trong bảng điểm?"
         ],
         "responses": [
            "Sinh viên liên hệ Giảng viên hoặc thư ký Khoa để xem lại bảng điểm gốc Giảng viên nộp. Phòng Đào tạo và Khoa sẽ phối hợp để giải quyết khiếu nại điểm cho sinh viên"
         ]
      },
      {
         "tag": "hocthemmon",
         "patterns": [
            "Sinh viên học không đủ số tín chỉ có phải học thêm môn học khác để được tốt nghiệp không? ",
            "Nếu thiếu số tín chỉ, liệu có cần phải thêm môn học khác để đủ điều kiện tốt nghiệp không?",
            "Cần phải học thêm môn nào nếu không đủ số tín chỉ để đạt điều kiện tốt nghiệp không?",
            "Có cần phải đăng ký thêm môn học khác để đủ số tín chỉ cho việc tốt nghiệp không?",
            "Nếu không đủ số tín chỉ, liệu cần phải bổ sung bằng cách học thêm môn nào khác không?",
            "Có yêu cầu học thêm môn nào khác nếu thiếu số tín chỉ cần thiết cho việc tốt nghiệp không?",
            "Liệu có cần phải học thêm các môn học khác để đủ số tín chỉ cho việc tốt nghiệp không?",
            "Nếu không đạt đủ số tín chỉ, liệu cần phải bổ sung bằng cách đăng ký thêm môn học không?",
            "Cần phải học thêm môn nào nếu không đủ số tín chỉ để đạt điều kiện tốt nghiệp không?",
            "Liệu có cần phải đăng ký thêm các môn học khác để đủ điều kiện tốt nghiệp không?",
            "Nếu số tín chỉ không đủ, liệu có yêu cầu phải học thêm môn nào để đạt đủ số tín chỉ không?"
         ],
         "responses": [
            "Các chương trình đạo tạo của các khóa sau thường có thay đổi so với khóa trước. Những môn học sinh viên chưa đạt có thể học tương đương với các môn học của khóa sau, có thể khác mã môn học, tên môn học và số tín chỉ (thường ít hơn). Tuy nhiên số tín chỉ ít hơn không yêu cầu sinh viên phải học bổ sung môn học khác. Do đó nếu sinh viên không tín lũy đủ số tín chỉ nhưng tín lũy đủ số môn học trong chương trình đào tạo thì đủ điều kiện tốt nghiệp. "
         ]
      },
      {
         "tag": "hocaithien-xeploai",
         "patterns": [
            "Việc học cải thiện có ảnh hưởng đến xếp loại tốt nghiệp không? ",
            "Có tác động gì đến việc đạt xếp loại tốt nghiệp không khi tập trung vào việc học cải thiện?",
            "Việc tập trung vào việc cải thiện học vấn có ảnh hưởng đến xếp loại tốt nghiệp không?",
            "Có phải việc nỗ lực học tập để cải thiện kết quả học tập có tác động đến xếp loại tốt nghiệp không?",
            "Liệu việc nỗ lực hơn trong học có thể làm thay đổi xếp loại tốt nghiệp không?",
            "Có tác động gì đến việc xếp loại tốt nghiệp khi chú trọng vào việc cải thiện học vấn?",
            "Có phải việc nỗ lực hơn trong học có thể thay đổi xếp loại tốt nghiệp không?",
            "Tập trung vào việc cải thiện học vấn có ảnh hưởng đến xếp loại tốt nghiệp không?",
            "Có phải việc học cải thiện có tác động đến xếp loại tốt nghiệp không?",
            "Liệu nỗ lực hơn trong việc học có thể làm thay đổi xếp loại tốt nghiệp không?",
            "Có tác động gì đến xếp loại tốt nghiệp khi tập trung vào việc cải thiện học vấn?"
         ],
         "responses": [
            "Theo điều kiện xét tốt nghiệp thì chỉ có sinh viên xếp loại xuất sắc hoặc giỏi bị hạ bậc nếu số tín chỉ học lại vượt quá 5% tổng số tín chỉ của chương trình đào tạo ngành học đó. Việc học cải thiện không phải là học lại nên không tính vào trường hợp trên. Sinh viên không hạn chế học cải thiện"
         ]
      },
      {
         "tag": "hanchetnkha",
         "patterns": [
            "Xét tốt nghiệp loại khá có bị hạn chề về điều gì không?",
            "Nếu tốt nghiệp loại khá, liệu có bị hạn chế ở mặt nào không?",
            "Tốt nghiệp loại khá có ảnh hưởng đến điều gì không?",
            "Loại tốt nghiệp khá có những hạn chế gì?",
            "Nếu đạt tốt nghiệp loại khá, có bị giới hạn ở điều gì không?",
            "Có những yếu tố nào bị hạn chế nếu tốt nghiệp loại khá?",
            "Có những điều gì bị hạn chế khi tốt nghiệp loại khá?",
            "Tốt nghiệp loại khá có ảnh hưởng đến quyền lợi của sinh viên không?",
            "Xếp loại tốt nghiệp khá có bị hạ bậc không? ",
            "Xếp loại tốt nghiệp khá có thể bị hạ hạng không?",
            "Có phải là tốt nghiệp loại khá có thể bị giảm xếp loại không?",
            "Nếu tốt nghiệp loại khá, có thể bị hạ loại không?",
            "Loại tốt nghiệp khá có thể bị giảm cấp độ không?",
            "Có tồn tại khả năng bị hạ bậc nếu xếp loại tốt nghiệp khá không?",
            "Nếu đạt xếp loại tốt nghiệp khá, có thể bị giảm xếp loại không?",
            "Có khả năng xếp loại tốt nghiệp khá bị hạ hạng không?",
            "Nếu tốt nghiệp loại khá, liệu có thể bị giảm cấp độ xếp loại không?",
            "Xếp loại tốt nghiệp khá có thể bị giảm xếp hạng không?"
            
         ],
         "responses": [
            "Chỉ có sinh viên tốt nghiệp loại giỏi thì có thể bị hạ bậc xuống loại khá nếu số tín chỉ các môn học rớt vượt quá 5% tổng số tín chỉ của ngành. Các xếp loại khác không bị ảnh hưởng"
         ]
      },
      {
         "tag": "tntamthoi",
         "patterns": [
            "Em vừa hoàn tất chương trình học có được cấp giấy chứng nhận tốt nghiệp tạm thời? ",
            "Sau khi hoàn tất chương trình học, liệu em có thể nhận được giấy chứng nhận tốt nghiệp tạm thời không?",
            "Khi đã hoàn thành chương trình học, có cấp giấy chứng nhận tốt nghiệp tạm thời cho sinh viên không?",
            "Sinh viên vừa mới tốt nghiệp có được nhận giấy chứng nhận tốt nghiệp tạm thời không?",
            "Có cung cấp giấy chứng nhận tốt nghiệp tạm thời cho sinh viên ngay sau khi hoàn thành chương trình học không?",
            "Sau khi hoàn tất chương trình đào tạo, sinh viên có thể nhận được giấy chứng nhận tốt nghiệp tạm thời không?",
            "Có cấp giấy chứng nhận tốt nghiệp tạm thời cho sinh viên ngay sau khi họ hoàn thành chương trình học không?",
            "Sinh viên mới tốt nghiệp có thể nhận được giấy chứng nhận tốt nghiệp tạm thời không?",
            "Sau khi hoàn thành chương trình đào tạo, liệu có cấp giấy chứng nhận tốt nghiệp tạm thời cho sinh viên không?",
            "Có cung cấp giấy chứng nhận tốt nghiệp tạm thời cho sinh viên ngay sau khi họ kết thúc chương trình đào tạo không?",
            "Sinh viên vừa mới tốt nghiệp có được nhận giấy chứng nhận tốt nghiệp tạm thời không?"
         ],
         "responses": [
            "Khi sinh viên có đầy đủ điểm học kỳ và đã hoàn tất chương trình học, Sinh viên có thể làm đơn xin xác nhận đã Hoàn tất chương trình học và nộp tại Phòng Đào tạo để được xác nhận. Việc xét tốt nghiệp sẽ tiến hành định kỳ vào tháng 3, 9. Những trường hợp môn học kết thúc và có điểm sớm trong học kỳ, xét tốt nghiệp sẽ tiến hành vào tháng 6, 12. Giấy chứng nhận tốt nghiệp tạm thời sẽ phát sau ngày họp xét tốt nghiệp là 3 tuần. Sinh viên xem thông báo trên trang web Phòng Đào tạo để biết địa điểm và thời gian nhận"
         ]
      },
      {
         "tag": "doituongthamgiankh",
         "patterns": [
            "Sinh viên năm mấy tham gia nghiên cứu khoa học không? ",
            "Sinh viên thường tham gia nghiên cứu khoa học ở giai đoạn nào trong chương trình đào tạo?",
            "Nghiên cứu khoa học thường mở cửa đối với sinh viên từ năm mấy trở đi?",
            "Sinh viên tham gia vào nghiên cứu khoa học thường bắt đầu từ năm học nào?",
            "Nghiên cứu khoa học thường mở cơ hội cho sinh viên từ năm mấy trở đi?",
            "Sinh viên thường bắt đầu tham gia vào hoạt động nghiên cứu khoa học từ năm học mấy?",
            "Nghiên cứu khoa học thường mời gọi sinh viên tham gia vào năm học nào của chương trình đào tạo?",
            "Sinh viên thường được khuyến khích tham gia vào nghiên cứu khoa học từ năm mấy trở đi?",
            "Nghiên cứu khoa học thường mở cửa cho sinh viên tham gia từ năm mấy của chương trình đào tạo?",
            "Sinh viên thường bắt đầu tham gia vào hoạt động nghiên cứu khoa học khi nào trong quá trình học?",
            "Nghiên cứu khoa học thường mở cơ hội cho sinh viên từ năm mấy của chương trình đào tạo?"
         ],
         "responses": [
            "Sinh viên năm 2 bắt đầu được tham gia nghiên cứu khoa học hoặc tham gia học cách nghiên cứu khoa học của các nhóm nghiên cứu của sinh viên năm cuối để từ đó hình thành ý tưởng cũng như cách thực hiện một đề tài nghiên cứu khoa học"
         ]
      },
      {
         "tag": "dkthamgiakh",
         "patterns": [
            "Sinh viên cần đáp ứng điều gì để tham gia nghiên cứu khoa học?",
            "Để tham gia nghiên cứu khoa học, sinh viên cần phải đáp ứng những yêu cầu gì?",
            "Có những điều kiện gì mà sinh viên cần đáp ứng để tham gia vào hoạt động nghiên cứu khoa học?",
            "Để tham gia vào các dự án nghiên cứu khoa học, sinh viên cần có những phẩm chất gì?",
            "Sinh viên cần chuẩn bị những gì để tham gia vào hoạt động nghiên cứu khoa học?",
            "Để tham gia vào các dự án nghiên cứu, sinh viên cần đáp ứng những tiêu chí nào?",
            "Có những yếu tố nào mà sinh viên cần có để tham gia vào các dự án nghiên cứu khoa học?",
            "Sinh viên muốn tham gia vào nghiên cứu khoa học cần có những kỹ năng gì?",
            "Để tham gia vào các hoạt động nghiên cứu, sinh viên cần phải chuẩn bị những gì?",
            "Sinh viên cần đáp ứng những yêu cầu gì để tham gia vào các dự án nghiên cứu khoa học của trường?",
            "Có những tiêu chí gì mà sinh viên cần đáp ứng để được tham gia vào các hoạt động nghiên cứu khoa học?"
         ],
         "responses": [
            "Sinh viên cần có niềm đam mê với ngành nghề, đam mê nghiên cứu khoa học và học lực phải đảm bảo loại khá trở lên để việc nghiên cứu khoa học không ảnh hưởng đến kết quả học tập"
         ]
      },
      {
         "tag": "timviec",
         "patterns": [
            "Em muốn tìm việc làm thêm, Trung tâm dịch vụ sinh viên có hỗ trợ được không.?",
            "Trung tâm dịch vụ sinh viên có chương trình hỗ trợ việc làm thêm cho sinh viên không?",
            "Trung tâm dịch vụ sinh viên có cung cấp dịch vụ tìm kiếm việc làm thêm cho sinh viên không?",
            "Trung tâm dịch vụ sinh viên để nhận được hỗ trợ trong việc tìm kiếm việc làm thêm không?",
            "Sinh viên có thể tìm hiểu về cơ hội việc làm thêm thông qua Trung tâm dịch vụ sinh viên không?",
            "Trung tâm dịch vụ sinh viên có hướng dẫn về cách tìm việc làm thêm cho sinh viên không?",
            "Sinh viên có được hỗ trợ tư vấn về việc làm thêm từ Trung tâm dịch vụ sinh viên không?"
         ],
         "responses": [
            "Trung tâm dịch vụ sinh viên luôn tìm kiếm và giới thiệu việc làm thêm cho các bạn SV miễn phí. Các bạn có thể đăng kí thông tin tại trung tâm hoặc theo dõi thông tin việc làm thêm trên trang Web, Facebook của Trung tâm để có công việc phù hợp cho bạn nhằm có thêm kinh phí đồng thời rèn kỹ năng thực tế.Web site : http://ssc.hcmute.edu.vn/, Facebook: https://www.facebook.com/ttdichvusinhvien"
         ]
      },
      {
         "tag": "tuvanvieclam",
         "patterns": [
            "Em là sinh viên năm nhất đi làm có ảnh hưởng gì nhiều đến kết quả học tập của em không?",
            "Việc đi làm có ảnh hưởng đến hiệu suất học tập của sinh viên năm nhất không?",
            "Có phải sinh viên năm nhất sẽ gặp khó khăn trong việc học tập nếu họ đi làm thêm không?",
            "Việc làm thêm có ảnh hưởng đến kết quả học tập của sinh viên năm nhất không?",
            "Có tác động nào lớn đến việc học tập của sinh viên năm nhất khi họ quyết định đi làm thêm không?",
            "Làm thế nào việc đi làm thêm ảnh hưởng đến việc học của sinh viên năm nhất?",
            "Có thể nói rằng việc sinh viên năm nhất đi làm thêm sẽ gây ra những vấn đề gì cho việc học tập của họ không?",
            "Có những khó khăn gì mà sinh viên năm nhất thường gặp phải khi cố gắng kết hợp giữa việc đi làm và học tập?",
            "Làm sao để quản lý thời gian hiệu quả khi sinh viên năm nhất đi làm thêm để tránh ảnh hưởng đến việc học?"
         ],
         "responses": [
            "Bạn là sinh viên năm đầu mới vào có thể chưa quen với môi trường học tập mới ở bậc Đại Học, bạn nên dành thời gian để tìm hiểu môi trường mới, tham gia các câu lạc bộ, đội nhóm trong trường để rút ra kinh nghiện từ các anh chị những năm trước. Bạn đi làm để học hỏi thêm kinh nghiệm hoặc để trang trải việc học khi thật sự cần, bạn nên sắp xếp thời gian biểu hợp lý. Tốt nhất nên bắt đầu đi làm vào học kỳ II sau khi đã có thời gian biểu cụ thể. Bạn nhớ ưu tiên việc học là trên hết nhé"
         ]
      },
      {
         "tag": "tgiandilamsv1",
         "patterns": [
            "Em là sinh viên năm nhất em nuốn đi làm thêm nhưng không biết đi làm vào thời gian nào là phù hợp?",
            "Khi là sinh viên năm nhất, làm thế nào để tìm thời gian phù hợp để đi làm thêm?",
            "Sinh viên năm nhất cần phải tìm kiếm công việc làm thêm vào thời gian nào là thích hợp nhất?",
            "Có lời khuyên nào cho sinh viên năm nhất về việc chọn thời gian phù hợp để đi làm thêm không?",
            "Làm thế nào để sinh viên năm nhất có thể đi làm thêm mà không ảnh hưởng đến việc học của mình?",
            "Có cách nào để sinh viên năm nhất tìm ra thời gian thích hợp để làm thêm ?",
            "Sinh viên năm nhất nên cân nhắc đi làm thêm vào buổi nào trong ngày để không làm ảnh hưởng đến việc học của mình?",
            "Làm sao để tìm thời gian phù hợp cho sinh viên năm nhất khi muốn đi làm thêm?",
            "Có thời gian nào trong tuần mà sinh viên năm nhất nên chọn để đi làm thêm?",
            "Sinh viên năm nhất nên đi làm thêm vào thời gian nào để không gây ảnh hưởng đến sức khỏe và học tập của mình?",
            "Khi là sinh viên năm nhất, làm thế nào để đi làm thêm mà vẫn duy trì được cân bằng giữa công việc và việc học?"
         ],
         "responses": [
            "Thông thường đối với sinh viên năm nhất, học kỳ I các bạn sẽ học theo chương trình của nhà trường giao cho. Số tín chỉ trung bình thường từ 20-25 tín chỉ tùy theo nghành học do đó thời gian phân bố lịch học cố định và không tập trung. Nếu bạn có thời gian rảnh ngoài TKB có thể liên hệ TTDVSV để kiếm việc làm. Ngoài ra bạn có thể làm trong các dịp nghỉ lễ, nghỉ Tết, hè là thích hợp nhất."
         ]
      },
      {
         "tag": "sapxeptgian",
         "patterns": [
            "Cách sắp xếp thời gian học và đi làm để không ảnh hưởng việc học?",
            "Làm thế nào để tổ chức thời gian học và làm thêm mà không ảnh hưởng đến việc học của sinh viên?",
            "Có cách nào để sắp xếp thời gian hợp lý giữa việc học và làm thêm?",
            "Làm sao để phân chia thời gian giữa việc học và làm thêm mà vẫn duy trì hiệu suất học tốt?",
            "Có chiến lược nào để tự chủ thời gian và cân bằng giữa việc học và làm thêm không?",
            "Làm thế nào để quản lý thời gian hiệu quả khi phải đi làm thêm cùng việc học?",
            "Có phương pháp nào giúp sinh viên tổ chức thời gian hợp lý để không bị ảnh hưởng bởi công việc làm thêm?",
            "Có cách nào để tối ưu hóa thời gian học và làm thêm mà vẫn duy trì sự tập trung và hiệu suất học?",
            "Làm sao để tổ chức lịch trình sao cho phù hợp với việc học và làm thêm mà không gặp khó khăn?",
            "Có chiến lược nào giúp sinh viên điều chỉnh thời gian học và làm thêm linh hoạt theo nhu cầu của mình không?",
            "Làm thế nào để sinh viên có thể tối ưu hóa thời gian học và làm thêm mà vẫn duy trì sức khỏe và sự cân bằng?"
         ],
         "responses": [
            "Lý tưởng là: Bạn có thể sắp xếp tất cả lịch học vào buổi sáng để buổi chiều có thể làm thêm và tối có thời gian học bài. Thực tế thì rất khó. Bạn nên tìm công việc phù hợp với thời gian của mình. Không nên làm quá 8 – 10 tiếng/tuần. Có thể kết hợp với một bạn khác để cùng chia sẻ công việc nếu doanh nghiệp yêu cầu làm quá thời gian trên. Việc đi làm cũng có thêm kinh phí và kinh nghiệm thực tế nhưng nếu dành nhiều thời gian cho việc đi làm thì không thể đảm bảo việc học tốt"
         ]
      },
      {
         "tag": "congviecphuhop",
         "patterns": [
            "Em là sinh viên bạn muốn đi làm thêm vậy công việc nào là phù hợp với em?",
            "Công việc nào là lựa chọn tốt nhất cho sinh viên muốn tìm việc làm thêm?",
            "Những công việc nào phù hợp với sinh viên muốn làm thêm?",
            "Sinh viên có thể tìm kiếm công việc gì để làm thêm trong thời gian rảnh rỗi?",
            "Có những lựa chọn nào cho sinh viên muốn kiếm thêm thu nhập?",
            "Sinh viên nên tham gia vào các công việc gì để kiếm thêm tiền?",
            "Có những công việc phù hợp với sinh viên muốn làm thêm không?",
            "Những công việc nào có thể phù hợp với lịch học của sinh viên?",
            "Có những cơ hội làm thêm nào dành cho sinh viên?",
            "Sinh viên cần tìm hiểu về các công việc nào để có thể kiếm thêm thu nhập?",
            "Có những lựa chọn nào cho sinh viên muốn cân nhắc việc làm thêm?"            
         ],
         "responses": [
            "Làm gia sư.Phát tờ rơi.Phục vụ.Nhân viên bán hàng.Nhân viên thanh toán tiền.Nhân viên tạp vụ.Quảng cáo sản phẩm.Hiện nay trong trường có một số công việc phù hợp với các bạn, các bạn nên tìm hiểu tham gia: tư vấn, trợ lý giảng dạy, vệ sinh môi trường, lễ tân, nhập liệu,…"
         ]
      },
      {
         "tag": "dkkhoaluantotnghiep",
         "patterns": [
            "Điều kiện để được làm khóa luận tốt nghiệp.",
            "Những yêu cầu cần đáp ứng để được thực hiện khóa luận tốt nghiệp là gì?",
            "Các điều kiện để được phép làm khóa luận tốt nghiệp là như thế nào?",
            "Sinh viên cần thỏa mãn những điều kiện gì để được phép thực hiện khóa luận tốt nghiệp?",
            "Những tiêu chí cần đáp ứng để được thực hiện khóa luận tốt nghiệp là gì?",
            "Có những điều kiện gì cần được đáp ứng trước khi bắt đầu làm khóa luận tốt nghiệp?",
            "Điều kiện để được phê duyệt làm khóa luận tốt nghiệp là gì?",
            "Sinh viên cần thực hiện những bước gì để đạt điều kiện làm khóa luận tốt nghiệp?",
            "Quy định nào liên quan đến việc sinh viên được phép thực hiện khóa luận tốt nghiệp?",
            "Có những tiêu chí gì được xem xét khi sinh viên đăng ký làm khóa luận tốt nghiệp?",
            "Điều kiện để đăng ký và thực hiện khóa luận tốt nghiệp là như thế nào?"
         ],
         "responses": [
            "Hằng năm, Khoa sẽ chọn các sinh viên đủ điều kiện làm khóa luận tốt nghiệp dựa trên điểm trung bình tích lũy và số tín chỉ tích lũy. Điều kiện sẽ thay đổi hàng năm tùy theo số lượng sinh viên và số lượng giảng viên."
         ]
      },
      {
         "tag": "thuctapmang",
         "patterns": [
            "Môi trường thực tập của ngành mạng như thế nào? ",
            "Thực tập trong lĩnh vực mạng có môi trường như thế nào?",
            "Cảm nhận về môi trường thực tập trong ngành mạng?",
            "Môi trường làm việc khi thực tập trong ngành mạng như thế nào?",
            "Môi trường thực tập của sinh viên ngành mạng được mô tả như thế nào?",
            "Thực tập trong lĩnh vực mạng có điều kiện như thế nào?",
            "Môi trường thực tập của ngành mạng được đánh giá ra sao?",
            "Cảm nhận về điều kiện làm việc khi thực tập trong ngành mạng?",
            "Sinh viên thực tập trong ngành mạng đánh giá thế nào về môi trường làm việc?",
            "Môi trường thực tập của sinh viên ngành mạng có gì đặc biệt so với các ngành khác?"
         ],
         "responses": [
            "Khoa có thông tin về các công ty chuyên về giải pháp mạng cũng như các doanh nghiệp, ngân hàng cần SV thực tập về mạng. Sinh viên nên theo dõi các thông tin thực tập để đăng ký."
         ]
      },
      {
         "tag": "chuyennganhsupham",
         "patterns": [
            "sinh viên hệ sư phạm có phải đăng ký chuyên ngành hay không?",
            "Sinh viên hệ sư phạm cần phải đăng ký chuyên ngành không?",
            "Hệ sư phạm có yêu cầu đăng ký vào chuyên ngành không?",
            "Có bắt buộc đăng ký chuyên ngành đối với sinh viên hệ sư phạm không?",
            "Hệ sư phạm có tham gia vào quá trình đăng ký chuyên ngành không?",
            "Sinh viên hệ sư phạm có được tham gia vào việc đăng ký chuyên ngành không?",
            "Quy định đăng ký chuyên ngành có áp dụng cho sinh viên hệ sư phạm không?",
            "Hệ sư phạm có cần thiết phải đăng ký vào chuyên ngành không?",
            "Việc đăng ký chuyên ngành có liên quan đến sinh viên hệ sư phạm không?",
            "Hệ sư phạm có phải thực hiện quy trình đăng ký chuyên ngành không?"
         ],
         "responses": [
            "SV hệ sư phạm không phân chuyên ngành."
         ]
      },
      {
         "tag": "thongbaodkchuyennganh",
         "patterns": [
            "Cách thức đăng ký chuyên ngành như thế nào? ",
            "Làm thế nào để đăng ký chuyên ngành?",
            "Quy trình đăng ký chuyên ngành như thế nào?",
            "Có cách nào để đăng ký vào chuyên ngành không?",
            "Làm sao để thực hiện việc đăng ký chuyên ngành?",
            "Cần làm gì để đăng ký vào chuyên ngành?",
            "Có gì cần biết khi muốn đăng ký chuyên ngành?",
            "Làm thế nào để bắt đầu quá trình đăng ký chuyên ngành?",
            "Có những bước nào để đăng ký vào một chuyên ngành cụ thể?",
            "Muốn tham gia chuyên ngành, phải làm thế nào?",
            "Cần tuân theo quy trình gì để đăng ký vào một chuyên ngành?"
         ],
         "responses": [
            "SV sẽ đăng ký chuyên ngành qua website của Khoa. Khoa sẽ thông báo thời gian cụ thể sau. Mọi SV học đến học kỳ 6 đều được  đăng ký chuyên ngành"
         ]
      },
      {
         "tag": "tgiankltotnghiep",
         "patterns": [
            "Tại sao khoa không mở khóa luận mỗi kỳ một lần để tạo điều kiện cho sinh viên làm khóa luận tốt nghiệp?",
            "Tại sao khoa không tổ chức khóa luận mỗi học kỳ để giúp sinh viên làm khóa luận tốt nghiệp?",
            "Có lý do gì khiến khoa không mở cơ hội làm khóa luận tốt nghiệp cho sinh viên mỗi kỳ học?",
            "Tại sao khoa không thực hiện khóa luận tốt nghiệp hàng kỳ để hỗ trợ sinh viên?",
            "Có lý do gì khiến khoa không cung cấp cơ hội cho sinh viên làm khóa luận tốt nghiệp mỗi kỳ học?",
            "Tại sao khoa không tổ chức khóa luận hàng kỳ để hỗ trợ sinh viên làm khóa luận tốt nghiệp?",
            "Có lý do gì khiến khoa không mở cơ hội làm khóa luận tốt nghiệp cho sinh viên mỗi học kỳ?",
            "Tại sao khoa không triển khai khóa luận tốt nghiệp hàng kỳ để giúp sinh viên?",
            "Có lý do gì khiến khoa không cung cấp cơ hội cho sinh viên làm khóa luận tốt nghiệp mỗi học kỳ?",
            "Tại sao khoa không tổ chức khóa luận mỗi kỳ để hỗ trợ sinh viên làm khóa luận tốt nghiệp?",
            "Có lí do gì khiến khoa không mở cơ hội làm khóa luận tốt nghiệp cho sinh viên mỗi kỳ học?"
         ],
         "responses": [
            "Dựa trên chương trình đào tạo và tình hình thực tế, mỗi kỳ khoa đều cho sinh viên làm luận văn"
         ]
      },
      {
         "tag": "suphamcntt",
         "patterns": [
            "Sinh viên hệ sư phạm Công Nghệ Thông Tin có sự khác biệt gì với kỹ sư Công Nghệ Thông Tin như nào?",
            "Tính khác biệt giữa sinh viên hệ sư phạm Công Nghệ Thông Tin và sinh viên kỹ sư Công Nghệ Thông Tin là gì?",
            "Sự khác biệt giữa sinh viên hệ sư phạm Công Nghệ Thông Tin và sinh viên kỹ sư Công Nghệ Thông Tin là gì?",
            "Trong điểm nào có sự khác biệt giữa sinh viên hệ sư phạm Công Nghệ Thông Tin và sinh viên kỹ sư Công Nghệ Thông Tin?",
            "Có điểm gì khác biệt giữa sinh viên hệ sư phạm Công Nghệ Thông Tin và sinh viên kỹ sư Công Nghệ Thông Tin?",
            "Sinh viên hệ sư phạm Công Nghệ Thông Tin và sinh viên kỹ sư Công Nghệ Thông Tin khác nhau như thế nào?",
            "Điểm gì tạo nên sự khác biệt giữa sinh viên hệ sư phạm Công Nghệ Thông Tin và sinh viên kỹ sư Công Nghệ Thông Tin?",
            "Trong ngữ cảnh đào tạo Công Nghệ Thông Tin, có sự tương phản gì giữa sinh viên hệ sư phạm và sinh viên kỹ sư?",
            "Có điều gì làm nổi bật sự khác biệt giữa sinh viên hệ sư phạm Công Nghệ Thông Tin và sinh viên kỹ sư Công Nghệ Thông Tin?",
            "Sinh viên hệ sư phạm Công Nghệ Thông Tin và sinh viên kỹ sư Công Nghệ Thông Tin có gì khác nhau?"
         ],
         "responses": [
            "Chương trình đào tạo của hệ sư phạm không có khác biệt lớn so với hệ kỹ sư, đa phần là học chung, chỉ riêng có một số môn chuyên về sư phạm để các bạn tiến hành lấy chứng chỉ sư phạm. Khi ra trường các bạn có thể giảng dạy tại các trường Trung Cấp Chuyên Nghiệp và Cao Đẳng. Nếu giảng dạy ở bậc Đại Học cần lấy thêm chứng chỉ Lý Luận sau Đại Học và bằng Triết Học."
         ]
      },
      {
         "tag": "luachonchuyenganh",
         "patterns": [
            "Nếu đã chọn chuyên ngành hệ thống thông tin mà lại chọn các môn học của ngành công nghệ phần mềm có được không?",
            "Em muốn biết liệu có thể chọn các môn học từ ngành công nghệ phần mềm khi đã chọn chuyên ngành hệ thống thông tin không?",
            "Nếu đã lựa chọn chuyên ngành hệ thống thông tin, liệu có khả năng chọn các môn học từ ngành công nghệ phần mềm không?",
            "Trong trường hợp đã chọn chuyên ngành hệ thống thông tin, em có thể lựa chọn các môn học từ ngành công nghệ phần mềm không?",
            "Khi đã quyết định theo đuổi chuyên ngành hệ thống thông tin, liệu có thể chọn các môn học từ ngành công nghệ phần mềm không?",
            "Nếu đã chọn chuyên ngành hệ thống thông tin, liệu có thể tham gia các môn học từ ngành công nghệ phần mềm không?",
            "Có phải sinh viên đã lựa chọn chuyên ngành hệ thống thông tin sẽ được phép chọn các môn học từ ngành công nghệ phần mềm không?",
            "Nếu đã chọn chuyên ngành hệ thống thông tin, liệu có được phép chọn các môn học từ ngành công nghệ phần mềm không?",
            "Trong trường hợp đã chọn chuyên ngành hệ thống thông tin, em có thể tham gia các môn học từ ngành công nghệ phần mềm không?",
            "Có được phép chọn các môn học từ ngành công nghệ phần mềm khi đã chọn chuyên ngành hệ thống thông tin không?"
         ],
         "responses": [
            "Bạn được phép chọn bất kỳ môn học nào của bất kỳ chuyên ngành nào để học. Tuy nhiên, do bạn đã chọn chuyên ngành HTTT nên chỉ những môn thuộc chuyên ngành này bạn mới được tín vào tín chỉ tích lũy để xét tốt nghiệp. Do đó, bạn nên chọn các môn thuộc chuyên ngành HTTT để học. Và bạn cũng có thể chọn các môn thuộc chuyên ngành khác để bổ sung, nâng cao kiến thức"
         ]
      },
      {
         "tag": "cohoivieclam",
         "patterns": [
            "Xin vui lòng cho em biết cơ hội việc làm khi em học xong chuyên ngành mạng?",
            "Khi tốt nghiệp chuyên ngành mạng, liệu em có cơ hội việc làm không?",
            "Em có thể biết về cơ hội nghề nghiệp sau khi học xong chuyên ngành mạng không?",
            "Sau khi hoàn thành chuyên ngành mạng, liệu em có nhiều cơ hội việc làm không?",
            "Cơ hội nghề nghiệp trong lĩnh vực mạng như thế nào sau khi tốt nghiệp?",
            "Có những cơ hội việc làm gì cho những người tốt nghiệp chuyên ngành mạng?",
            "Khi học xong chuyên ngành mạng, em có thể mong đợi được gì về cơ hội việc làm?",
            "Ngành mạng mang lại những cơ hội nghề nghiệp gì cho sinh viên tốt nghiệp?",
            "Cơ hội việc làm trong lĩnh vực mạng như thế nào sau khi tốt nghiệp?",
            "Sau khi học xong chuyên ngành mạng, liệu em có nên kỳ vọng vào cơ hội việc làm cao không?",
            "Cơ hội nghề nghiệp của ngành mạng là như thế nào sau khi tốt nghiệp?"
         ],
         "responses": [
            "Em có thể làm trong các cơ quan, công ty, có hệ thống mạng, các ứng dụng riêng của mình như các ngân hàng, cơ quan báo chí, bệnh viện, trường học,… Ngoài ra, em có thể làm việc tại các cơ quan chuyên về mạng như cung cấp hạ tầng truyền dẫn (như FTP, VIETTEL, VDC, CMC…), hay các công ty tích hợp hệ thống – System Integration (như FTP, HPT, GreenNet, Sao Bắc Đẩu,…)."
         ]
      },
      {
         "tag": "thunhap",
         "patterns": [
            "Thu nhập của các anh chị tốt nghiệp ngành này như thế nào? ",
            "Có thể biết về mức thu nhập trung bình của những người tốt nghiệp ngành này không?",
            "Mức thu nhập của những người tốt nghiệp ngành này là bao nhiêu?",
            "Có thông tin nào về thu nhập của những người tốt nghiệp ngành này không?",
            "Có thống kê nào về thu nhập của những người tốt nghiệp ngành này không?",
            "Mức thu nhập trung bình của những người đã tốt nghiệp ngành này là bao nhiêu?",
            "Thu nhập của những người tốt nghiệp ngành này thường dao động trong khoảng nào?",
            "Có cách nào để tìm hiểu về thu nhập của những người tốt nghiệp ngành này không?",
            "thông tin gì về mức lương sau khi tốt nghiệp của ngành này không?"
         ],
         "responses": [
            "Các bạn tốt nghiệp mạng máy tính học về kỹ thuật sẽ có mức lương khá tốt khoảng 5-6 triệu/tháng. Sau khi đã có kinh nghiệp (1-2 năm), các bạn có thể đạt 7-10 triệu hoặc hơn. Một số trường hợp, các bạn chỉ sau hai năm đã đạt lương 20 triệu/tháng."
         ]
      },
      {
         "tag": "chuongtrinhclctienganh",
         "patterns": [
            "Chương trình đào tạo Anh văn Kỹ thuật kéo dài 4 năm hay 4 năm rưỡi?",
            "Chương trình đào tạo Anh văn Kỹ thuật thường kéo dài trong khoảng bao nhiêu năm?",
            "Thời gian học của Chương trình Anh văn Kỹ thuật là bao lâu?",
            "Chương trình đào tạo Anh văn Kỹ thuật thường mất bao lâu để hoàn thành?",
            "Có thể cho biết thời gian hoàn thành Chương trình Anh văn Kỹ thuật là bao nhiêu năm?",
            "Chương trình đào tạo Anh văn Kỹ thuật được thiết kế trong thời gian bao lâu?",
            "Thời gian học tập cần thiết cho Chương trình Anh văn Kỹ thuật là bao lâu?",
            "Có thể nói rõ về thời gian học trong Chương trình Anh văn Kỹ thuật được không?",
            "Khoảng thời gian bắt buộc cho Chương trình Anh văn Kỹ thuật là bao lâu?",
            "Có cần mất bao nhiêu năm để hoàn thành Chương trình Anh văn Kỹ thuật?",
            "Chương trình đào tạo Anh văn Kỹ thuật kéo dài trong thời gian nào?"
         ],
         "responses": [
            "Chương trình đào tạo Anh văn Kỹ thuật kéo dài 4 năm và một học kỳ hè vào năm thứ 4. Trong học kỳ hè, SV học các môn tốt nghiệp và ôn tập và thi C1."
         ]
      },
      {
         "tag": "tienganhchuyennganh",
         "patterns": [
            "Các môn Tiếng Anh chuyên ngành kỹ thuật gồm những môn nào? ",
            "Những môn học nào thuộc danh mục Tiếng Anh chuyên ngành kỹ thuật?",
            "Có những môn nào trong Tiếng Anh chuyên ngành liên quan đến lĩnh vực kỹ thuật?",
            "Trong các môn Tiếng Anh chuyên ngành, có những môn nào tập trung vào lĩnh vực kỹ thuật?",
            "Có thể liệt kê những môn học Tiếng Anh chuyên ngành kỹ thuật nào được không?",
            "Những môn học nào được coi là môn Tiếng Anh chuyên ngành trong ngành kỹ thuật?",
            "Trong danh sách các môn Tiếng Anh chuyên ngành, có những môn nào liên quan đến lĩnh vực kỹ thuật?",
            "Có thể cho biết những môn học nào là Tiếng Anh chuyên ngành kỹ thuật?",
            "Có những môn nào trong Tiếng Anh chuyên ngành tương ứng với ngành kỹ thuật?",
            "Trong các môn Tiếng Anh chuyên ngành, có những môn nào chủ yếu tập trung vào ngành kỹ thuật?",
            "Có thể ghi lại những môn học Tiếng Anh chuyên ngành kỹ thuật nào?"
         ],
         "responses": [
            "Các môn Tiếng Anh chuyên ngành kỹ thuật gồm Anh văn chuyên ngành Công nghệ thông tin, Anh văn chuyên ngành Công nghệ Môi trường, Anh văn chuyên ngành Điện-Điện tử, Anh văn chuyên ngành Cơ khí, Anh văn chuyên ngành Thương mại (Tự chọn), Anh văn chuyên ngành thiết kế thời trang (Tự chọn), Anh văn chuyên ngành Dinh dưỡng và công nghệ thực phẩm (Tự chọn)"
         ]
      },
      {
         "tag": "dkanh-viet",
         "patterns": [
            "Đối với các môn Tiếng Anh chuyên ngành thì có được đăng ký học song song cả tiếng Việt và tiếng Anh không?",
            "Sinh viên có thể đăng ký học song song cả môn Tiếng Anh chuyên ngành và môn tiếng Việt không?",
            "Có thể đăng ký học cả môn Tiếng Anh chuyên ngành và môn tiếng Việt đồng thời không?",
            "Trong việc đăng ký học môn Tiếng Anh chuyên ngành, có được đăng ký song song với môn tiếng Việt không?",
            "Có phải sinh viên có thể đăng ký học môn Tiếng Anh chuyên ngành cùng lúc với môn tiếng Việt không?",
            "Sinh viên có thể học môn Tiếng Anh chuyên ngành và môn tiếng Việt đồng thời không?",
            "Có được đăng ký học cả môn Tiếng Anh chuyên ngành và môn tiếng Việt cùng một kỳ học không?",
            "Trong việc đăng ký học môn Tiếng Anh chuyên ngành, có thể học đồng thời với môn tiếng Việt không?",
            "Có phải sinh viên có thể đăng ký học môn Tiếng Anh chuyên ngành và môn tiếng Việt trong cùng một kỳ học không?",
            "Sinh viên có được phép học môn Tiếng Anh chuyên ngành cùng lúc với môn tiếng Việt không?",
            "Trong việc đăng ký học môn Tiếng Anh chuyên ngành, có thể đăng ký song song với môn tiếng Việt không?"
         ],
         "responses": [
            "Theo chương trình đào tạo, các môn chuyên ngành tiếng Việt được học trước hoặc học song song với môn tương ứng bằng tiếng Anh."
         ]
      },
      {
         "tag": "tienganh150TC",
         "patterns": [
            "Những chứng chỉ quốc tế nào được chấp nhận quy đổi điểm quá trình cho một số môn học trong chương trình 150 TC?",
            "Những loại chứng chỉ quốc tế nào có thể được dùng để quy đổi điểm cho chương trình học 150 tín chỉ?",
            "Các chứng chỉ quốc tế nào được công nhận để chuyển điểm cho chương trình 150 tín chỉ?",
            "Có những chứng chỉ nào được chấp nhận để chuyển điểm cho chương trình 150 tín chỉ?",
            "Các bằng cấp quốc tế nào có thể được dùng để đổi điểm quá trình trong chương trình 150 tín chỉ?",
            "Những bằng cấp quốc tế nào có thể quy đổi điểm cho các môn trong chương trình 150 tín chỉ của trường?",
            "Có những chứng chỉ quốc tế nào được chấp nhận để chuyển điểm cho một số môn học trong chương trình 150 tín chỉ?",
            "Những loại bằng cấp quốc tế nào có thể được dùng để đổi điểm cho các môn học trong chương trình 150 tín chỉ của trường?"
         ],
         "responses": [
            "Chứng chỉ IELTS và TOEFL iBT"
         ]
      },
      {
         "tag": "hocphantienganh",
         "patterns": [
            "Những môn học nào được quy đổi điểm quá trình từ điểm thi quốc tế?",
            "Có những môn nào trong chương trình học được tính điểm từ kết quả thi quốc tế?",
            "Các môn nào có thể chuyển điểm từ kỳ thi quốc tế sang quá trình học?",
            "Những môn học nào cho phép sinh viên chuyển điểm từ kỳ thi quốc tế?",
            "Có những môn học nào trong trường có chính sách chuyển điểm từ kỳ thi quốc tế?",
            "Kỳ thi quốc tế có ảnh hưởng đến điểm số của những môn nào trong chương trình học?",
            "Các môn nào trong chương trình đào tạo cho phép sinh viên sử dụng điểm từ kỳ thi quốc tế?",
            "Kỳ thi quốc tế có ảnh hưởng đến kết quả học tập của các môn nào?",
            "Có những môn học nào được tính điểm từ kỳ thi quốc tế thay vì từ kỳ thi trong nước?",
            "Trong chương trình học, những môn nào có chính sách chuyển điểm từ kỳ thi quốc tế?",
            "Có những môn nào cho phép sinh viên sử dụng kết quả kỳ thi quốc tế thay vì kỳ thi trong nước?"
         ],
         "responses": [
            "Những môn học nào được quy đổi điểm quá trình từ điểm thi quốc tế gồm Nghe-Nói, Đọc, Viết, Ngữ pháp và Luyện âm."
         ]
      },
      {
         "tag": "thuctapsupham",
         "patterns": [
            "Sinh viên năm thứ mấy thì phải thực tập ?",
            "Ở năm học thứ mấy thì sinh viên phải thực tập",
            "Sinh viên phải thực tập vào năm học nào?",
            "Thực tập được yêu cầu ở năm học thứ mấy?",
            "Năm học bao nhiêu thì sinh viên phải thực tập ?",
            "Sinh viên cần thực tập ở khóa học thứ mấy?",
            "Trong khóa học nào, sinh viên cần thực tập?",
            "Ở năm học nào trong chương trình đào tạo, sinh viên phải thực tập?",
            "Sinh viên cần thực tập khi nào trong suốt quá trình học?",
            "Thực tập diễn ra ở năm học nào trong chương trình đào tạo?",
            "Khi nào trong chương trình học, sinh viên phải tham gia thực tập?"
         ],
         "responses": [
            "Sinh viên năm thứ tư phải thực tập sư phạm vào học kỳ thứ 8.Thời gian kiến tập và thực tập kéo dài trong 8 tuần đầu của học kỳ thứ 8 (học kỳ 2 năm thứ tư)."
         ]
      },
      {
         "tag": "tcthuctapsupham",
         "patterns": [
            "Khối lượng tín chỉ của thực tập sư phạm là bao nhiêu?",
            "Thực tập sư phạm có bao nhiêu tín chỉ?",
            "Khối lượng tín chỉ của môn thực tập sư phạm là bao nhiêu?",
            "Số tín chỉ được gán cho môn thực tập sư phạm là bao nhiêu?",
            "Thực tập sư phạm đòi hỏi bao nhiêu tín chỉ?",
            "Môn thực tập sư phạm có khối lượng tín chỉ là bao nhiêu?",
            "Có bao nhiêu tín chỉ được tính cho thực tập sư phạm?",
            "Khối lượng tín chỉ của môn thực tập sư phạm được tính như thế nào?",
            "Môn thực tập sư phạm có yêu cầu bao nhiêu tín chỉ?",
            "Thực tập sư phạm ở trường yêu cầu bao nhiêu tín chỉ?",
            "Có bao nhiêu tín chỉ được tính cho môn thực tập sư phạm?"
         ],
         "responses": [
            "Khối lượng tín chỉ của học phần thực tập sư phạm là 6 tín chỉ, trong đó kiến tập 1 tín chỉ và thực hành giảng dạy 5 tín chỉ."
         ]
      },
      {
         "tag": "monhocsupham",
         "patterns": [
            "Các môn học để thực tập sư phạm là những môn nào?",
            "Có những môn nào được chọn để thực tập sư phạm?",
            "Các môn học nào là lựa chọn cho thực tập sư phạm của sinh viên?",
            "Sinh viên thực hiện thực tập sư phạm ở những môn nào?",
            "Có những môn học cụ thể nào được chọn để làm thực tập sư phạm?",
            "Những môn học nào là phần của chương trình thực tập sư phạm?",
            "Có những môn học gì được tính là thực tập sư phạm?",
            "Sinh viên thực tập sư phạm trong những môn học nào?",
            "Có những môn nào được chọn để làm phần thực tập sư phạm?",
            "Những môn học nào được xem xét để làm thực tập sư phạm?",
            "Các môn học nào được sinh viên lựa chọn để thực hiện thực tập sư phạm?"
         ],
         "responses": [
            "Sinh viên bắt buộc phải thực tập sư phạm các môn Anh văn không chuyên (anh văn 1, 2, 3), và Anh văn chuyên ngành kỹ thuật"
         ]
      },
      {
         "tag": "vitrittsupham",
         "patterns": [
            "Sinh viên được thực tập sư phạm tại trường hay tại trường khác?",
            "Sinh viên có được quyền tự chọn và liên hệ trường hoặc trung tâm ngoại ngữ để thực tập sư phạm không?",
            "Sinh viên thực tập sư phạm ở trường hay ở nơi khác?",
            "Thực tập sư phạm của sinh viên thường diễn ra tại trường hay ngoài trường?",
            "Sinh viên có được phép thực tập sư phạm tại trường hay chỉ ở các cơ sở khác?",
            "Thực tập sư phạm của sinh viên thường được tổ chức ở đâu, tại trường hay ngoài trường?",
            "Sinh viên thực hiện thực tập sư phạm ở nơi nào, tại trường hoặc nơi khác?",
            "Thực tập sư phạm của sinh viên thường được tổ chức ở trường hay ở các địa điểm khác?",
            "Sinh viên có được phép thực tập sư phạm tại trường hay phải đi ra ngoài thực tế?",
            "Thực tập sư phạm của sinh viên thường diễn ra tại đâu, trong trường hay ngoài trường?",
            "Sinh viên thường được giao thực tập sư phạm ở đâu, tại trường hoặc tại các cơ sở khác?",
            "Thực tập sư phạm của sinh viên thường được tổ chức ở trường hoặc ở nơi khác?"
         ],
         "responses": [
            "Sinh viên Khoa Ngoại Ngữ được thực tập Sư phạm tại trường."
         ]
      },
      {
         "tag": "chungchiIELT",
         "patterns": [
            "Chứng chỉ IELTS có thể xét tương đương với trình độ C1 khi xét tốt nghiệp không?",
            "IELTS có thể được coi là tương đương với trình độ C1 khi xét tốt nghiệp không?",
            "Có thể sử dụng chứng chỉ IELTS để xét tương đương với trình độ C1 khi tốt nghiệp không?",
            "Có thể coi chứng chỉ IELTS như trình độ tương đương với C1 khi đánh giá tốt nghiệp không?",
            "Việc có chứng chỉ IELTS có thể được xem xét như trình độ C1 khi xét tốt nghiệp không?",
            "IELTS có thể đóng vai trò là tương đương với trình độ C1 khi xét tốt nghiệp không?",
            "Có thể xem xét chứng chỉ IELTS như một phần của trình độ C1 khi xét tốt nghiệp không?",
            "Có thể sử dụng IELTS để xác nhận trình độ tương đương với C1 khi tốt nghiệp không?",
            "Việc có chứng chỉ IELTS có thể được coi là tương đương với trình độ C1 khi xét tốt nghiệp không?",
            "Có thể sử dụng chứng chỉ IELTS để xác minh trình độ tương đương với C1 khi tốt nghiệp không?",
            "Việc có chứng chỉ IELTS có thể được xem là tương đương với trình độ C1 khi xét tốt nghiệp không?"
         ],
         "responses": [
            "Chứng chỉ IELTS được xét tương đương với trình độ C1 khi xét tốt nghiệp.Chứng chỉ C1 này là một trong các điều kiện cấp bằng tốt nghiệp, nhưng không có tính chất tương đương với chứng chỉ quốc tế, không quy đổi điểm tương đương với chứng chỉ IELTS được."
         ]
      },
      {
         "tag": "quydoitienganh",
         "patterns": [
            "Nếu không có chứng chỉ C1 hoặc IELTS 7.0 thì có được ra trường không?",
            "Nếu không có chứng chỉ C1 hoặc IELTS 7.0, liệu có thể tốt nghiệp không?",
            "Nếu không đủ điểm C1 hoặc IELTS 7.0, có thể ra trường không?",
            "Nếu không có chứng chỉ tiếng Anh C1 hoặc IELTS 7.0, có thể tốt nghiệp không?",
            "Nếu không đạt chuẩn tiếng Anh C1 hoặc IELTS 7.0, có được ra trường không?",
            "Nếu không có chứng chỉ C1 hoặc IELTS 7.0, có được tốt nghiệp không?",
            "Nếu không đạt yêu cầu về tiếng Anh C1 hoặc IELTS 7.0, có thể ra trường không?",
            "Nếu không có chứng chỉ tiếng Anh C1 hoặc IELTS 7.0, liệu có thể tốt nghiệp không?",
            "Nếu không đủ điểm tiếng Anh C1 hoặc IELTS 7.0, có thể ra trường không?",
            "Nếu không có chứng chỉ C1 hoặc IELTS 7.0, có thể tốt nghiệp không?",
            "Nếu không đạt chuẩn tiếng Anh C1 hoặc IELTS 7.0, có được ra trường không?"
         ],
         "responses": [
            "chứng chỉ C1 hoặc IELTS 5.0 là một trong các điều kiện cần thiết để được tốt nghiệp ra trường."
         ]
      },
      {
         "tag": "rottienganh",
         "patterns": [
            "Sinh viên đăng ký học phần Anh văn 1 nhưng học không đạt thì có thể đăng ký học phần Anh văn 2, Anh văn 3 không?",
            "Nếu đăng ký học phần Anh văn 1 nhưng không đạt, liệu có thể đăng ký học phần Anh văn 2 hoặc Anh văn 3 không?",
            "Nếu không đạt môn Anh văn 1, sinh viên có thể đăng ký học phần Anh văn 2 hoặc Anh văn 3 không?",
            "Nếu không hoàn thành môn Anh văn 1, có được phép đăng ký học phần Anh văn 2 hoặc Anh văn 3 không?",
            "Nếu không đủ điểm môn Anh văn 1, có thể đăng ký học phần Anh văn 2 hoặc Anh văn 3 không?",
            "Nếu không đạt môn học phần Anh văn 1, có thể đăng ký học tiếp môn Anh văn 2 hoặc Anh văn 3 không?",
            "Nếu không qua môn Anh văn 1, có được đăng ký học phần Anh văn 2 hoặc Anh văn 3 không?",
            "Nếu không hoàn thành môn Anh văn 1, có thể đăng ký học môn Anh văn 2 hoặc Anh văn 3 không?",
            "Nếu không đủ điểm môn Anh văn 1, có được đăng ký học môn Anh văn 2 hoặc Anh văn 3 không?",
            "Nếu không qua môn Anh văn 1, sinh viên có thể đăng ký học môn Anh văn 2 hoặc Anh văn 3 không?",
            "Nếu không hoàn thành môn Anh văn 1, có thể đăng ký học phần Anh văn 2 hoặc Anh văn 3 không?"
         ],
         "responses": [
            "Không. Sinh viên phải đăng ký học và đạt kết quả đậu học phần Anh văn 1 mới được đăng ký học phần Anh văn 2. Tương tự với học phần anh văn 2 và 3"
         ]
      },
      {
         "tag": "quydoihocphan",
         "patterns": [
            "Nếu sinh viên có chứng chỉ ngoại ngữ quốc tế thì có được miễn và chuyển điểm các học phần Anh văn 1, 2, 3, 4 không?",
            "Nếu có chứng chỉ ngoại ngữ quốc tế, liệu có thể được miễn và chuyển điểm cho các học phần Anh văn 1, 2, 3, 4 không?",
            "Chứng chỉ ngoại ngữ quốc tế có thể được sử dụng để miễn và chuyển điểm cho các học phần Anh văn 1, 2, 3, 4 không?",
            "Sinh viên có chứng chỉ ngoại ngữ quốc tế có được áp dụng để miễn và chuyển điểm cho các học phần Anh văn 1, 2, 3, 4 không?",
            "Liệu chứng chỉ ngoại ngữ quốc tế có thể giúp sinh viên miễn và chuyển điểm các học phần Anh văn 1, 2, 3, 4 không?",
            "Có được sử dụng chứng chỉ ngoại ngữ quốc tế để miễn và chuyển điểm cho các học phần Anh văn 1, 2, 3, 4 không?",
            "Chứng chỉ ngoại ngữ quốc tế có thể giúp sinh viên miễn và chuyển điểm các học phần Anh văn 1, 2, 3, 4 không?",
            "Nếu có chứng chỉ ngoại ngữ quốc tế, liệu sinh viên có thể được miễn và chuyển điểm các học phần Anh văn 1, 2, 3, 4 không?",
            "Sinh viên sở hữu chứng chỉ ngoại ngữ quốc tế có thể sử dụng để miễn và chuyển điểm cho các học phần Anh văn 1, 2, 3, 4 không?",
            "Có thể áp dụng chứng chỉ ngoại ngữ quốc tế để miễn và chuyển điểm cho các học phần Anh văn 1, 2, 3, 4 không?",
            "Nếu có chứng chỉ ngoại ngữ quốc tế, sinh viên có thể được miễn và chuyển điểm các học phần Anh văn 1, 2, 3, 4 không?"
         ],
         "responses": [
            "Có. Sinh viên có chứng chỉ ngoại ngữ quốc tế còn trong hiệu lực (2 năm kể từ ngày cấp chứng chỉ) do các tổ chức khảo thí được nhà trường công nhận cấp thì được xem xét chuyển điểm, miễn thi các học phần anh văn 1, 2, 3, miễn thi sát hạch TOEIC tại từng thời điểm xem xét. Thời điểm xem xét là thời điểm trước khi diễn ra các lớp Anh văn hoặc kỳ thì sát hạch."
         ]
      },
      {
         "tag": "chungchidoihocphan",
         "patterns": [
            "Các chứng chỉ ngoại ngữ quốc tế nào có thể được xét chuyển điểm cho các học phần Anh văn 1, 2, 3, 4?",
            "Những chứng chỉ ngoại ngữ quốc tế nào có thể được tính điểm cho các học phần Anh văn 1, 2, 3, 4?",
            "Có những chứng chỉ ngoại ngữ quốc tế nào được công nhận cho các học phần Anh văn 1, 2, 3, 4?",
            "Đối với các học phần Anh văn 1, 2, 3, 4, chứng chỉ ngoại ngữ quốc tế nào được chấp nhận để xét chuyển điểm?",
            "Có những loại chứng chỉ ngoại ngữ quốc tế nào được tính điểm vào các học phần Anh văn 1, 2, 3, 4?",
            "Đối với các học phần Anh văn 1, 2, 3, 4, sinh viên có thể sử dụng những chứng chỉ ngoại ngữ quốc tế nào để chuyển điểm?",
            "Những chứng chỉ ngoại ngữ quốc tế nào được coi là hợp lệ cho các học phần Anh văn 1, 2, 3, 4?",
            "Có những chứng chỉ ngoại ngữ quốc tế nào có thể áp dụng để chuyển điểm cho các học phần Anh văn 1, 2, 3, 4?",
            "Đối với các học phần Anh văn 1, 2, 3, 4, sinh viên có thể dùng những chứng chỉ ngoại ngữ quốc tế nào để tính điểm?",
            "Những chứng chỉ ngoại ngữ quốc tế nào được nhận để xét điểm cho các học phần Anh văn 1, 2, 3, 4?",
            "Có những loại chứng chỉ ngoại ngữ quốc tế nào có thể được chấp nhận làm điểm cho các học phần Anh văn 1, 2, 3, 4?"
         ],
         "responses": [
            "Các chứng chỉ ngoại ngữ sau có thể được xem xét chuyển điểm và miễn thi các học phần ngoại ngữ: TOEIC, TOEFL ITP, TOEFL iBT, IELTS, BULATS"
         ]
      },
      {
         "tag": "kethucanhvan",
         "patterns": [
            "Sau khi hoàn tất các học phần Anh văn 1, 2, 3, 4 sinh viên có phải thi sát hạch không?",
            "Khi đã hoàn thành các học phần Anh văn 1, 2, 3, 4, sinh viên có cần thi sát hạch không?",
            "Sinh viên sau khi hoàn thành học phần Anh văn 1, 2, 3, 4 có phải tham gia kỳ thi sát hạch không?",
            "Có yêu cầu thi sát hạch sau khi đã hoàn thành các học phần Anh văn 1, 2, 3, 4 không?",
            "Sinh viên đã hoàn thành học phần Anh văn 1, 2, 3, 4 có cần phải làm kỳ thi sát hạch không?",
            "Sau khi học xong các học phần Anh văn 1, 2, 3, 4, sinh viên có yêu cầu phải thi sát hạch không?",
            "Cần phải thi sát hạch sau khi đã hoàn thành các học phần Anh văn 1, 2, 3, 4 hay không?",
            "Sinh viên đã học xong các học phần Anh văn 1, 2, 3, 4 có cần phải làm kỳ thi sát hạch không?",
            "Khi đã học xong các học phần Anh văn 1, 2, 3, 4, sinh viên có cần phải thi sát hạch không?",
            "Có cần thi sát hạch sau khi đã hoàn thành các học phần Anh văn 1, 2, 3, 4 không?",
            "Sinh viên đã hoàn thành các học phần Anh văn 1, 2, 3, 4 có cần phải tham gia kỳ thi sát hạch không?"
         ],
         "responses": [
            "Có. Sau khi hoàn thành học phần AV3 đến trước thời điểm xét tốt nghiệp (XTN), sinh viên được phép chọn lựa đăng ký học các lớp tiếng Anh tăng cường 3 để được trang bị các kỹ năng thi TOEIC. Sau đó tất cả sinh viên phải tham gia một kỳ thi sát hạch (dạng bài thi TOEIC) do Trường tổ chức để đảm bảo đạt chuẩn đầu ra ngoại ngữ theo quy định về điều kiện tốt nghiệp đã ban hành"
         ]
      },
      {
         "tag": "mienphisathach",
         "patterns": [
            "Nếu sinh viên có chứng chỉ ngoại ngữ quốc tế đạt chuẩn đầu ra tiếng Anh thì có được miễn kỳ thi sát hạch không?",
            "Nếu có chứng chỉ ngoại ngữ quốc tế đủ tiêu chuẩn, sinh viên có thể được miễn kỳ thi sát hạch không?",
            "Chứng chỉ ngoại ngữ quốc tế đạt chuẩn có thể giúp sinh viên được miễn kỳ thi sát hạch không?",
            "Sinh viên có chứng chỉ ngoại ngữ quốc tế đạt yêu cầu có thể được miễn kỳ thi sát hạch không?",
            "Nếu có chứng chỉ ngoại ngữ quốc tế đủ chuẩn, liệu sinh viên có cần phải tham gia kỳ thi sát hạch không?",
            "Chứng chỉ ngoại ngữ quốc tế có thể làm cho sinh viên không cần phải tham gia kỳ thi sát hạch không?",
            "Nếu đạt chuẩn chứng chỉ ngoại ngữ quốc tế, sinh viên có thể được miễn kỳ thi sát hạch không?",
            "Chứng chỉ ngoại ngữ quốc tế đủ điều kiện có thể làm cho sinh viên không cần thi kỳ thi sát hạch không?",
            "Sinh viên có chứng chỉ ngoại ngữ quốc tế đạt tiêu chuẩn có thể tránh được việc phải thi kỳ thi sát hạch không?",
            "Nếu có chứng chỉ ngoại ngữ quốc tế đủ điều kiện, sinh viên có thể được miễn thi kỳ thi sát hạch không?",
            "Chứng chỉ ngoại ngữ quốc tế đạt chuẩn có thể làm cho sinh viên không cần phải tham gia kỳ thi sát hạch hay không?"
         ],
         "responses": [
            "Trường hợp sinh viên có Chứng chỉ Ngoại ngữ (CCNN) Quốc tế, căn cứ vào điểm của CCNN có thể được xem xét miễn thi sát hạch TOEIC. Thời điểm xem xét là thời điểm trước khi diễn ra kỳ thi sát hạch. CCNN phải có giá trị tại thời điểm xem xét miễn thi (trong vòng 2 năm kể từ ngày cấp chứng chỉ và theo quy định ở phần quy định về quy trình). Trình độ tiếng Anh được xem xét theo quy định của Nhà trường: tương đương 450 điểm TOEIC đối với khóa 2012, 2013 và tương đương 500 điểm TOEIC đối với khóa 2014 trở về sau"
         ]
      },
      {
         "tag": "congtyktdl",
         "patterns": [
            "Một số công ty tuyển dụng sinh viên chuyên ngành Kỹ thuật dữ liệu là gì?",
            "Có những công ty nào đang tuyển dụng sinh viên Kỹ thuật dữ liệu không?",
            "Có thông tin gì về các công ty đang cần tuyển sinh viên chuyên ngành Kỹ thuật dữ liệu không?",
            "Có tin tức gì về việc các công ty đang tìm kiếm sinh viên Kỹ thuật dữ liệu?",
            "Có công ty nào đang có nhu cầu tuyển dụng sinh viên học Kỹ thuật dữ liệu không?",
            "Là sinh viên Kỹ thuật dữ liệu, tôi nên tìm hiểu về các công ty nào đang cần người không?",
            "Có thị trường việc làm nào đang phát triển cho sinh viên Kỹ thuật dữ liệu?",
            "Nên liên hệ với công ty nào nếu muốn tìm việc làm sau khi tốt nghiệp Kỹ thuật dữ liệu?",
            "Có công ty nào đang tuyển dụng vị trí liên quan đến Kỹ thuật dữ liệu không?",
            "Tôi nên bắt đầu tìm hiểu về những công ty nào nếu muốn làm việc trong lĩnh vực Kỹ thuật dữ liệu?",
            "Có những thông tin gì về các công ty có liên quan đến ngành Kỹ thuật dữ liệu đang tuyển dụng sinh viên?"
         ],
         "responses": [
            "Về lĩnh vực dữ liệu : MBBank, RongViet, Abbott Việt Nam, VinGroup, FPT software"
         ]
      },
      {
         "tag": "hocbongclc",
         "patterns": [
            "Học bổng đặc biệt của Khoa CLC xét như thế nào?",
            "Cách xét học bổng đặc biệt của Khoa CLC như thế nào?",
            "Quy trình xét học bổng đặc biệt của Khoa CLC ra sao?",
            "Những tiêu chí nào được sử dụng để xét học bổng đặc biệt tại Khoa CLC?",
            "Làm thế nào để được xem xét cho học bổng đặc biệt ở Khoa CLC?",
            "Có những điều kiện gì cần đạt để được xét học bổng đặc biệt tại Khoa CLC?",
            "Học bổng đặc biệt của Khoa CLC được xem xét dựa trên những yếu tố nào?",
            "Quy trình xét học bổng đặc biệt của Khoa CLC có khó khăn không?",
            "Làm thế nào để nộp đơn xin học bổng đặc biệt tại Khoa CLC?",
            "Có cần phải đạt điểm trung bình nhất định để được xét học bổng đặc biệt ở Khoa CLC không?",
            "Học bổng đặc biệt của Khoa CLC được quyết định như thế nào?"           
         ],
         "responses": [
            "Có kết quả học tập cao nhất lớp (từ 7,00 trở lên và không rớt môn nào);Không bị kỷ luật bất cứ hình thức nào, Không vi phạm nội quy của Khoa;Điểm rèn luyện từ loại Khá (70 điểm) trở lên;Tham gia hoạt động công tác xã hội (tập thể hoặc cá nhân)"
         ]
      },
      {
         "tag": "clcdaitra",
         "patterns": [
            "Tại sao sinh viên Lớp CLC không được đăng ký học lại với lớp đại trà?",
            "Tại sao sinh viên CLC không được phép đăng ký học lại chung với lớp đại trà?",
            "Lý do gì khiến sinh viên lớp CLC không thể đăng ký học lại với lớp đại trà?",
            "Tại sao trường không cho phép sinh viên CLC đăng ký học lại với lớp đại trà?",
            "Có quy định gì khiến sinh viên lớp CLC không thể học lại chung với lớp đại trà không?",
            "Lý do gì khiến sinh viên CLC không được phép học lại cùng lớp đại trà?",
            "Vì sao sinh viên CLC không thể tham gia vào lớp học lại với lớp đại trà?",
            "Có những nguyên nhân gì khiến sinh viên lớp CLC không được học lại với lớp đại trà?",
            "Tại sao chính sách của trường không cho phép sinh viên CLC tham gia vào lớp học lại với lớp đại trà?",
            "Có lý do gì khiến sinh viên CLC không thể đăng ký học lại với lớp đại trà không?"
         ],
         "responses": [
            "Học phí học lại của SV lớp CLC khác lớp Đại trà;Học lại với lớp Đại trà sẽ không đảm bảo về cơ sở vật chất (không đầy đủ trang thiết bị; sĩ số đông…) Học lại với lớp đại trà chỉ ưu tiên cho SV năm cuối; SV ở học kỳ kéo dài. Các trường hợp khác, làm đơn trình Phòng ĐT xem xét và giải quyết"
         ]
      },
      {
         "tag": "quydinhclc",
         "patterns": [
            "Quy định về trang phục của SV Khoa CLC?",
            "Sinh viên Khoa CLC phải tuân thủ quy định về trang phục như thế nào?",
            "Trường có quy định gì về trang phục đối với sinh viên CLC?",
            "Có quy định cụ thể về trang phục cho sinh viên Khoa CLC không?",
            "Sinh viên Khoa CLC phải mặc đồng phục như thế nào?",
            "Có quy định gì về trang phục học tập cho sinh viên CLC không?",
            "Trường có quy định về phong cách trang phục của sinh viên Khoa CLC không?",
            "Sinh viên CLC phải tuân thủ các quy định gì về trang phục khi đến trường?",
            "Có quy định cụ thể nào về trang phục của sinh viên Khoa CLC không?",
            "Trường có yêu cầu nào về trang phục đối với sinh viên học CLC không?",
            "Quy định về trang phục của sinh viên Khoa CLC được ghi rõ như thế nào?"            
         ],
         "responses": [
            "Áo sơ mi;Đeo bảng tên;Áo bỏ vào quầnMang giày hoặc sandal"
         ]
      },
      {
         "tag": "vitrithuctap",
         "patterns": [
            "Sinh viên ngành Công nghệ thông tin có được thực tập ở doanh nghiệp không? ",
            "Ngành Công nghệ thông tin có cơ hội thực tập tại các doanh nghiệp không?",
            "Sinh viên ngành Công nghệ thông tin có được tham gia thực tập ở các công ty không?",
            "Có cơ hội thực tập ở các doanh nghiệp cho sinh viên học Công nghệ thông tin không?",
            "Có được phép thực tập tại các doanh nghiệp trong ngành Công nghệ thông tin không?",
            "Có những cơ hội thực tập nào dành cho sinh viên ngành Công nghệ thông tin?",
            "Sinh viên Công nghệ thông tin có thể tham gia thực tập ở doanh nghiệp không?",
            "Có chương trình thực tập nào dành cho sinh viên học Công nghệ thông tin không?",
            "Có được phép thực tập ở các công ty liên quan đến Công nghệ thông tin không?",
            "Có cơ hội thực tập tại các doanh nghiệp công nghệ cho sinh viên ngành Công nghệ thông tin không?",
            "Có được thực tập ở các công ty công nghệ khi học ngành Công nghệ thông tin không?"
         ],
         "responses": [
            "SV năm 4 Ngành Công nghệ thông tin hiện nay đã có thể đi thực tập tại FSOFT, TMA, CSC, Global Cybersoft…"
         ]
      },
      {
         "tag": "chuongtrinhclc-daitra",
         "patterns": [
            "Chương trình CLC có khác gì với chương trình đại trà?",
            "Sự khác biệt giữa chương trình CLC và chương trình đại trà là gì?",
            "Chương trình CLC có những điểm khác biệt nào so với chương trình đại trà?",
            "Trong CLC, điều gì làm nổi bật chương trình so với chương trình đại trà?",
            "Sinh viên CLC cảm thấy chương trình học của họ khác biệt như thế nào so với sinh viên theo chương trình đại trà?",
            "Sự khác biệt giữa CLC và chương trình đại trà là gì theo quan điểm của sinh viên?",
            "Trong CLC, điều gì làm cho chương trình học trở nên đặc biệt so với chương trình đại trà?",
            "Sinh viên CLC nhận thấy những gì là khác biệt nhất giữa chương trình học của họ và chương trình đại trà?",
            "Trong CLC, điều gì khiến chương trình học trở nên khác biệt so với chương trình đại trà?",
            "Có những điểm gì làm cho chương trình CLC khác biệt so với chương trình đại trà?"  
         ],
         "responses": [
            "Ngoài chương trình chính như đại trà,chương trình CLC là tăng cường thêm Anh văn 4 và Anh văn 5 (3TC/ môn) để nâng cao trình độ tiếng Anh cho sinh viên CLC. Điểm khác biệt ở chương trình CLC đó là đội ngũ giảng viên có kinh nghiệm giảng dạy, hệ thống cơ sở vật chất tốt hơn đại trà, sĩ số lớp ít nhằm đảm bảo việc giảng dạy hiệu quả hơn. Khoa thường xuyên mở các lớp ngoại khóa miễn phí hỗ trợ sinh viên học tập tốt hơn như :”Lập trình robot”, Matlap và ứng dụng”,…"
         ]
      },
      {
         "tag": "huymontt",
         "patterns": [
            "Sinh viên có được phép huỷ các môn học thực tập đã có trong thời khoá biểu cứng của sinh viên hay không?",
            "Sinh viên có thể hủy bỏ các môn học thực tập đã được xếp vào thời khoá biểu cố định của mình không?",
            "Có được phép huỷ bỏ các môn học thực tập trong thời gian đã xác định sẵn trong thời khóa biểu của sinh viên không?",
            "Nếu có các môn học thực tập đã được lên kế hoạch trong thời khóa biểu, liệu sinh viên có thể hủy bỏ chúng không?",
            "Có được phép hủy bỏ các môn thực tập đã được sắp xếp trong thời gian cố định của sinh viên không?",
            "Nếu các môn học thực tập đã được xác định trong thời khóa biểu của sinh viên, liệu có thể hủy bỏ chúng không?",
            "Sinh viên có thể hủy bỏ các môn thực tập đã được xếp vào thời gian cố định trong thời khóa biểu của mình không?",
            "Có được phép hủy bỏ các môn học thực tập trong thời khóa biểu đã được xác định sẵn không?",
            "Sinh viên có quyền hủy bỏ các môn học thực tập đã được sắp xếp trong thời gian cố định không?",
            "Nếu các môn thực tập đã được xếp vào thời khóa biểu, liệu sinh viên có thể hủy bỏ chúng không?"
         ],
         "responses": [
            "Sinh viên được phép huỷ các môn học được phép huỷ các môn học thực tập (chưa học lý thuyết) đã có trong thời khoá biểu cứng của sinh viên. Sinh viên làm đơn xin huỷ nộp cho thư ký Khoa ĐT CLC trong thời gian cho phép đăng ký môn học"
         ]
      },
      {
         "tag": "hoclaiclc",
         "patterns": [
            "Sinh viên CLC thi rớt môn học có được đăng ký học lại chung với hệ đại trà hay không ?",
            "Nếu sinh viên CLC thi rớt một môn học, đăng ký học lại cùng với sinh viên hệ đại trà không?",
            "Sinh viên CLC nếu thi trượt một môn học, có được phép đăng ký học lại chung với hệ đại trà không?",
            "Có phải sinh viên CLC nếu bị trượt một môn học, đăng ký học lại cùng với sinh viên hệ đại trà không?",
            "Nếu sinh viên CLC thi rớt môn học, liệu có thể học lại cùng với sinh viên hệ đại trà không?",
            "Sinh viên CLC bị trượt môn học có được phép đăng ký học lại chung với hệ đại trà không?",
            "Nếu sinh viên CLC không qua môn học, liệu có được học lại chung với sinh viên hệ đại trà không?",
            "Sinh viên CLC nếu không vượt qua một môn học, có được phép học lại cùng với sinh viên hệ đại trà không?",
            "Nếu sinh viên CLC thi rớt môn học, liệu có thể đăng ký học lại chung với sinh viên hệ đại trà không?"
         ],
         "responses": [
            "Khi rớt môn, sinh viên CLC phải đăng ký học lại chung với sinh viên CLC những khóa sau, không được đăng ký học chung với đại trà. Tuy nhiên để giúp sinh viên có thể ra trường đúng hạn, trong học ký cuối và các học kỳ cuối kéo dài có thể cho phép sinh viên học chung với hệ đại trà để trả nợ. Nhưng đây là nguyện vọng của sinh viên, nhà trường không khuyến khích. Muốn học sinh viên phải đăng ký và có sự chấp thuận của khoa Đào tạo CLC, Phòng đào tạo và khoa quản chuyên môn"
         ]
      },
      {
         "tag": "hocsongbang",
         "patterns": [
            "sinh viên CLC có nguyện vọng học song song hai bằng đại học thì bằng còn lại chung với lớp đại trà hay không?",
            "Có phải sinh viên CLC học hai bằng đại học đồng thời sẽ được chia sẻ bằng còn lại với sinh viên lớp đại trà không?",
            "Sinh viên CLC nếu học hai bằng đại học cùng một lúc, bằng còn lại sẽ có chung với sinh viên lớp đại trà không?",
            "Khi đăng ký học hai bằng đại học cùng một lúc, sinh viên CLC có được cấp bằng còn lại chung với sinh viên lớp đại trà không?",
            "Em muốn đăng ký học hai bằng thì như thế nào",
            "Điều kiện để học song song 2 bằng đại học",
            "Em đăng ký học song song hai bằng thì quy định như thế nào"
         ],
         "responses": [
            "Điều kiện để được học song song hai bằng đại học: thực hiện theo quy định nhà nước. Nếu thoả mãn các điều kiện đó thì đối với bằng 2, sinh viên có thể học chung với lớp đại trà"
         ]
      },
      {
         "tag": "tracuutailieu",
         "patterns": [
            "Cách tìm kiếm tài liệu?",
            "Làm thế nào để tìm kiếm tài liệu hữu ích cho bài tập?",
            "Có cách nào để tìm kiếm tài liệu liên quan đến đề tài nghiên cứu của mình không?",
            "Sinh viên có thể tìm kiếm tài liệu trực tuyến như thế nào?",
            "Làm thế nào để tìm tài liệu phù hợp với đề tài seminar của mình?",
            "Có gợi ý nào để tìm kiếm tài liệu hiệu quả cho đồ án môn học không?",
            "Có cách nào để tìm kiếm tài liệu khoa học trên internet không?",
            "Làm sao để tìm kiếm tài liệu tham khảo cho bài luận văn tốt nghiệp?",
            "Có công cụ nào giúp sinh viên tìm kiếm tài liệu dễ dàng hơn không?",
            "Sinh viên nên sử dụng phương tiện nào để tìm kiếm tài liệu phù hợp với môn học?",
            "Có website nào cung cấp tài liệu hữu ích cho sinh viên không?"
         ],
         "responses": [
            "Có rất nhiều nguồn để tìm kiếm tài liệu. Chẳng hạn là trong thư viện, tài liệu do giáo viên phát, trên mạng, trên các trang web chuyên ngành, các bài báo bằng tiếng việt, tiếng anh… "
         ]
      },
      {
         "tag": "dayboiduong",
         "patterns": [
            "Khoa có tổ chức dạy bồi dưỡng, phụ đạo không?",
            "Có cơ hội tham gia các khóa học bồi dưỡng, phụ đạo tại Khoa không?",
            "Khoa có tổ chức các lớp học bồi dưỡng, phụ đạo hỗ trợ không?",
            "Sinh viên có thể tham gia các khóa học phụ đạo ở Khoa không?",
            "Có chương trình dạy bồi dưỡng, phụ đạo nào tại Khoa để hỗ trợ sinh viên không?",
            "Sinh viên có thể tham gia các lớp bồi dưỡng, phụ đạo tại Khoa không?",
            "Sinh viên có cơ hội tham gia các lớp học bồi dưỡng, phụ đạo do Khoa tổ chức không?",
            "Có chương trình học phụ đạo nào tại Khoa để hỗ trợ sinh viên không?"
         ],
         "responses": [
            "Học đại học không còn khái niệm phụ đạo, việc tự học của sinh viên là quan trọng.Ngoài ra, trường hợp GV có sử dụng trợ lý giảng dạy có thể sẽ bố trí thêm 1 số buổi tư vấn."
         ]
      },
      {
         "tag": "thacmacvieclam",
         "patterns": [
            "Tại sao nhà trường không tạo diều kiện cho sinh viên được làm việc trong các công ty ngay từ năm nhất?",
            "Tại sao không có cơ hội làm việc cho sinh viên từ năm nhất tại các công ty?",
            "Nhà trường có lý do gì không tạo điều kiện cho sinh viên làm việc từ năm nhất tại các doanh nghiệp?",
            "Tại sao sinh viên không được khuyến khích làm việc tại các công ty từ khi mới vào học?",
            "Làm sao để nhà trường hỗ trợ sinh viên làm việc tại các công ty ngay từ năm nhất?",
            "Có phải nhà trường không ưu tiên việc sinh viên làm việc tại các công ty khi mới vào học?",
            "Tại sao không có chính sách nào để khuyến khích sinh viên làm việc tại các công ty ngay từ năm nhất?",
            "Có lí do gì khiến sinh viên không có cơ hội làm việc tại các công ty ngay từ khi mới bắt đầu học?",
            "Tại sao không có sự ưu ái từ nhà trường để sinh viên làm việc tại các công ty từ năm nhất?",
            "Nhà trường không hỗ trợ sinh viên làm việc tại các công ty từ năm nhất vì lí do gì?"
         ],
         "responses": [
            "Sinh viên có thể tham gia vào các công trình xây dựng dưới dạng tự do nhưng phải đảm bảo được thời gian học. Khoa không có khả năng xin cho các bạn đi làm. Để có kinh nghiệm thì sinh viên cần học lý thuyết kết hợp với những kiến thức thực tế. Trong kỳ thực tập tốt nghiệp là cơ hội cho SV tích lũy kinh nghiệm về thi công và thiết kế."
         ]
      },
      {
         "tag": "sisochuyennganh",
         "patterns": [
            "Sỉ số bao nhiêu để chia được chuyên ngành?",
            "Để chia chuyên ngành, số lượng sinh viên cần đạt bao nhiêu?",
            "Sinh viên cần có tỉ lệ bao nhiêu để được chia vào chuyên ngành?",
            "Sỉ số tối thiểu là bao nhiêu để phân chuyên ngành cho sinh viên?",
            "Cần bao nhiêu sinh viên để mở một chuyên ngành mới?",
            "Sinh viên phải đạt mức sỉ số nào để được phân vào chuyên ngành mong muốn?",
            "Mức sỉ số cần thiết để chia chuyên ngành là bao nhiêu?",
            "Để tổ chức chuyên ngành mới, cần có bao nhiêu sinh viên tham gia?",
            "Sỉ số tối thiểu để mở một chuyên ngành là bao nhiêu?",
            "Khi muốn chia chuyên ngành, cần bao nhiêu sinh viên là đủ?"
         ],
         "responses": [
            "Tối thiếu 20 SV."
         ]
      },
      {
         "tag": "xinhocbong",
         "patterns": [
            "Muốn xin xác nhận của Khoa để xin học bổng của địa phương, của cơ quan Ba Mẹ thì làm như thế nào?",
            "Làm thế nào để có xác nhận từ Khoa để xin học bổng từ địa phương?",
            "Muốn xin học bổng từ cơ quan Ba Mẹ, em cần làm gì để có xác nhận từ Khoa?",
            "Có thủ tục gì cần thực hiện để nhận được xác nhận từ Khoa để xin học bổng từ địa phương không?",
            "Làm sao để yêu cầu xác nhận từ Khoa để hỗ trợ việc xin học bổng từ cơ quan Ba Mẹ?",
            "Khi muốn xin học bổng từ địa phương, em phải làm sao để có xác nhận từ Khoa?",
            "Có cách nào để lấy xác nhận từ Khoa để hỗ trợ việc xin học bổng không?",
            "Để xin học bổng từ cơ quan Ba Mẹ, em cần thực hiện thủ tục gì với Khoa?",
            "Muốn nhận được hỗ trợ xin học bổng, em cần làm những gì để có xác nhận từ Khoa?",
            "Làm thế nào để yêu cầu xác nhận từ Khoa khi muốn xin học bổng từ địa phương?",
            "Khi cần xin học bổng từ cơ quan Ba Mẹ, có cách nào để lấy xác nhận từ Khoa không?"
         ],
         "responses": [
            "Sinh viên làm đơn theo mẫu của địa phương hoặc cơ quan của Ba, Mẹ. Gởi Văn phòng Khoa để được trình ký xác nhận SV"
         ]
      },
      {
         "tag": "phuckhao",
         "patterns": [
            "Làm sao để phúc khảo bài thi cuối kì?",
            "Có cách nào để yêu cầu phúc khảo bài thi cuối kỳ không?",
            "Làm thế nào để gửi yêu cầu phúc khảo cho bài thi cuối kỳ?",
            "Nếu muốn phúc khảo bài thi, phải làm thủ tục gì?",
            "Có thể yêu cầu phúc khảo bài thi cuối kỳ như thế nào?",
            "Khi muốn kiểm tra lại bài thi cuối kỳ, em cần thực hiện những bước nào?",
            "Làm sao để gửi đơn phúc khảo sau khi xem lại bài thi cuối kỳ?",
            "Khi cần phúc khảo bài thi, em cần thực hiện thủ tục nào?",
            "Để yêu cầu phúc khảo bài thi cuối kỳ, phải làm gì?",
            "Có cách nào để kiểm tra lại bài thi cuối kỳ sau khi xem kết quả không?",
            "Khi muốn kiểm tra lại kết quả bài thi, có cách nào để yêu cầu phúc khảo không?"
         ],
         "responses": [
            "Sinh viên lên văn phòng Khoa, nhập dữ liệu cần thiết và nộp lệ phí vào máy tự động (đặt trước văn phòng Khoa). Sinh viên nộp giấy đăng ký mà máy đã in ra cho văn phòng Khoa và chờ nhận kết quả chấm phúc khảo tại văn phòng Khoa 1 tuần sau khi hết thời gian nộp giấy phúc khảo"
         ]
      },
      {
         "tag": "tochucthi",
         "patterns": [
            "Các môn kết thúc sớm có tổ chức thi sớm không?",
            "Nếu có môn kết thúc sớm, liệu có tổ chức thi sớm không?",
            "Có thi sớm cho các môn kết thúc sớm không?",
            "Trong trường hợp có môn kết thúc sớm, có thi sớm tương ứng không?",
            "Có tổ chức thi cho các môn kết thúc sớm không?",
            "Nếu học xong một môn trước dự kiến, có cơ hội thi sớm không?",
            "Có thi sớm cho các môn mà sinh viên hoàn thành trước thời hạn không?",
            "Nếu hoàn thành một môn sớm, có thể đăng ký thi sớm không?",
            "Trong trường hợp hoàn thành một môn trước thời gian, có cơ hội thi sớm không?",
            "Có cho phép sinh viên thi sớm nếu hoàn thành một môn học sớm không?"
         ],
         "responses": [
            "Với các môn kết thúc sớm, Giảng viên giảng dạy nêu yêu cầu và Bộ môn quyết định về thời gian thi (có hay không thi sớm), sau đó báo cho văn phòng khoa để được xếp lịch thi (nếu không thi sớm Khoa sẽ xếp lịch thi vào cuối học kỳ). Lịch thi theo nhóm sẽ được đăng tải trên website của khoa"
         ]
      },
      {
         "tag": "chuyennganhktdl",
         "patterns": [
            "Ngành Kỹ thuật dữ liệu có chọn chuyên ngành không",
            "Sinh viên ngành Kỹ thuật dữ liệu có lựa chọn chuyên ngành không?",
            "Trong ngành Kỹ thuật dữ liệu, sinh viên có thể chọn chuyên ngành khác nhau không?",
            "Có lựa chọn chuyên ngành nào trong ngành Kỹ thuật dữ liệu không?",
            "Có những chuyên ngành cụ thể nào trong ngành Kỹ thuật dữ liệu không?",
            "Sinh viên học ngành Kỹ thuật dữ liệu có thể tùy chọn chuyên ngành không?",
            "Có những chuyên ngành đặc biệt nào trong ngành Kỹ thuật dữ liệu không?",
            "Trong chương trình học của ngành Kỹ thuật dữ liệu, sinh viên có chọn chuyên ngành không?"              
         ],
         "responses": [
            "Ngành Kỹ thuật dữ liệu không chọn chuyên ngành"
         ]
      },
      {
         "tag": "thamquancongty",
         "patterns": [
            "Trong quá trình học sinh viên có được đi tham quan thực tế không?",
            "Có cơ hội tham gia thực tế trong quá trình học không?",
            "Sinh viên có được tham gia các hoạt động thực tế trong khi học không?",
            "Có cơ hội đi thực tế để áp dụng kiến thức học được không?",
            "Sinh viên có được phép tham gia các chương trình thực tế không?",
            "Trong quá trình học, sinh viên có cơ hội được trải nghiệm thực tế không?",
            "Có những chương trình nào dành cho sinh viên để tham gia thực tế?",
            "Trong khi học, sinh viên có được đi địa điểm thực tế để áp dụng kiến thức không?",
            "Có chương trình thực tế nào mà sinh viên có thể tham gia không?"
         ],
         "responses": [
            "Sinh viên được đi tham quan thực tế ít nhất 1 lần/học kỳ tìm hiểu về hoạt động môi trường làm việc, các bộ phận của các công ty công nghệ"
         ]
      },
      {
         "tag": "hoctotchuyennganh",
         "patterns": [
            "Làm sao để học tốt môn chuyên ngành?",
            "Có cách nào để hiểu sâu về môn học chuyên ngành không?",
            "Sinh viên làm thế nào để nắm vững kiến thức trong môn học chuyên ngành?",
            "Có phương pháp nào giúp sinh viên học tốt môn chuyên ngành hơn không?",
            "Làm thế nào để tiếp cận môn học chuyên ngành một cách hiệu quả nhất?",
            "Sinh viên có thể áp dụng phương pháp học nào để nâng cao hiệu suất trong môn học chuyên ngành?",
            "Làm sao để tối ưu hóa việc học môn chuyên ngành?",
            "Có kinh nghiệm nào giúp sinh viên tiếp cận và tiêu thụ kiến thức môn chuyên ngành một cách hiệu quả không?",
            "Sinh viên nên sử dụng cách tiếp cận nào để học tốt môn chuyên ngành?",
            "Có phương pháp nào giúp sinh viên giải quyet khó khăn khi học môn chuyên ngành không?"
         ],
         "responses": [
            "Muốn học tốt môn chuyên ngành trước hết phải học tốt môn cơ sở ngành, đó là những môn có kiến thức cơ bản nhất, tạo nền tảng học môn chuyên ngành"
         ]
      },
      {
         "tag": "hotrokhoa",
         "patterns": [
            "Nhà trường, khoa và Bộ môn tạo điều kiện gì cho sinh viên thực hiện nghiên cứu khoa học?",
            "Sinh viên được hỗ trợ như thế nào để thực hiện các dự án nghiên cứu khoa học?",
            "Nhà trường, khoa và bộ môn có hỗ trợ sinh viên thực hiện nghiên cứu khoa học không?",
            "Sinh viên nhận được sự hỗ trợ như thế nào từ trường, khoa và bộ môn để thực hiện nghiên cứu khoa học?",
            "Nhà trường, khoa và bộ môn có hỗ trợ cho sinh viên tham gia vào các dự án nghiên cứu không?",
            "Sinh viên có được hỗ trợ từ trường, khoa và bộ môn để thực hiện các dự án nghiên cứu khoa học không?",
            "Sinh viên nhận được sự hỗ trợ như thế nào từ trường, khoa và bộ môn để tham gia vào các dự án nghiên cứu khoa học?"
         ],
         "responses": [
            "Sinh viên (nhóm sinh viên) sẽ được hỗ trợ một phần kinh phí để thực hiện đề tài NCKH từ nhà trường.Được phép sử dụng cơ sở vật chất, trang thiết bị của Khoa, trường thực hiện nghiên cứu.Được sự hướng dẫn của các Thầy cô quản phòng thí nghiệm về việc vận hành thiết bị"
         ]
      },
      {
         "tag": "donggopykien",
         "patterns": [
            "Sinh viên có được đóng ý kiến về bài giảng của giảng viên không?",
            "Liệu sinh viên có được phép góp ý về nội dung của bài giảng từ giảng viên không?",
            "Có cơ hội nào cho sinh viên thảo luận hoặc đề xuất ý kiến về bài giảng không?",
            "Sinh viên có quyền thảo luận và đóng góp ý kiến về bài giảng từ giảng viên không?",
            "Giảng viên có cho sinh viên gửi ý kiến và đề xuất cải tiến về bài giảng không?",
            "Có cơ hội cho sinh viên đưa ra ý kiến phản hồi về bài giảng từ giảng viên không?",
            "Liệu sinh viên có thể chia sẻ ý kiến và góp ý về bài giảng với giảng viên không?",
            "Có cơ hội nào cho sinh viên thể hiện ý kiến về chất lượng bài giảng không?",
            "Sinh viên có được mời góp ý về bài giảng từ giảng viên không?"            
         ],
         "responses": [
            "Mỗi học kỳ sinh viên được đánh giá về bài giảng, phương pháp giảng dạy, nội dung môn học, giáo trình,… thông qua trang web đánh giá online. Ngoài ra, sinh viên có thể đóng góp ý kiến trực tiếp cho Giảng viên hoặc qua hòm thư của khoa (kcnhtp@hcmute.edu.vn) trong suốt quá trình học. Những ý kiến đóng góp của sinh viên sẽ được tổng hợp và phản hồi đến giảng viên đứng lớp nhằm góp phần giúp giảng viên cải thiện, đáp ứng yêu cầu học tập của sinh viên"
         ]
      },
      {
         "tag": "thacmacdoan",
         "patterns": [
            "Em còn nợ một số tín chỉ. Vậy em có thể đăng ký làm Đồ án Tốt nghiệp được không",
            "Có thể làm Đồ án Tốt nghiệp khi vẫn còn nợ môn không?",
            "Việc đăng ký làm Đồ án Tốt nghiệp có bị ảnh hưởng nếu em còn nợ tín chỉ không?",
            "Nếu em vẫn còn nợ một số môn học, em có được phép tham gia vào Đồ án Tốt nghiệp không?",
            "Có những nợ môn không đóng lại, em có thể tham gia Đồ án Tốt nghiệp không?",
            "Có ảnh hưởng gì đối với việc đăng ký Đồ án Tốt nghiệp nếu em còn nợ một số tín chỉ không?",
            "việc đăng ký Đồ án Tốt nghiệp có bị từ chối nếu em vẫn còn nợ môn không?",
            "Nếu em chưa đóng hết nợ môn, có thể tham gia vào Đồ án Tốt nghiệp không?",
            "Có cần phải hoàn tất việc thanh toán nợ môn trước khi đăng ký Đồ án Tốt nghiệp không?"
         ],
         "responses": [
            "Tùy theo yêu cầu của Bộ môn đối với sinh viên các khóa. Như vậy, năm học này Bộ môn sẽ tổ chức cho các bạn sinh viên khóa 2020 làm Đồ án tốt nghiệp. Nếu em đủ các điều kiện trên thì có thể đăng ký để làm đề tài tốt nghiệp"
         ]
      },
      {
         "tag": "dkthamquan",
         "patterns": [
            "Các môn thực tập tham quan và thực tập tốt nghiệp, Sinh viên có phải đăng ký qua mạng không?",
            "Có cần phải đăng ký các môn thực tập tham quan và thực tập tốt nghiệp trực tuyến không?",
            "Sinh viên có thể đăng ký các môn thực tập tham quan và thực tập tốt nghiệp trực tuyến không?",
            "Việc đăng ký các môn thực tập tham quan và thực tập tốt nghiệp có thể thực hiện qua hệ thống mạng không?",
            "Có cách nào để đăng ký các môn thực tập tham quan và thực tập tốt nghiệp không cần phải đến trường?",
            "Việc đăng ký các môn thực tập tham quan và thực tập tốt nghiệp có thể thực hiện qua internet không?",
            "Có cần phải đăng ký các môn thực tập tham quan và thực tập tốt nghiệp trên trang web của trường không?",
            "Sinh viên có thể đăng ký các môn thực tập tham quan và thực tập tốt nghiệp từ xa không?",
            "Có cách nào để đăng ký các môn thực tập tham quan và thực tập tốt nghiệp không cần phải tới trường không?",
            "Việc đăng ký các môn thực tập tham quan và thực tập tốt nghiệp có thể thực hiện trực tuyến không?"
         ],
         "responses": [
            "Đối với các môn thí nghiệm, đồ án, tham quan, thực tập…Bộ môn sẽ gửi danh sách lên phòng Đào tạo. Vì vậy các em không phải đăng ký qua mạng."
         ]
      },
      {
         "tag": "totnghieptruoc",
         "patterns": [
            "Sinh viên học vượt tiến độ so với kế hoạch, có được làm đồ án tốt nghiệp trước hạn?",
            "Nếu sinh viên hoàn thành học phần trước dự kiến,bắt đầu làm đồ án tốt nghiệp sớm hơn không?",
            "Có cơ hội nào cho sinh viên hoàn thành đồ án tốt nghiệp trước thời hạn không?",
            "Sinh viên hoàn thành các khóa học trước thời gian dự kiến,bắt đầu làm đồ án tốt nghiệp sớm hơn không?",
            "Nếu sinh viên nhanh chóng hoàn thành các môn học, bắt đầu đồ án tốt nghiệp trước hạn không?",
            "Sinh viên hoàn thành chương trình học trước dự kiến, thực hiện đồ án tốt nghiệp trước thời gian dự kiến không?",
            "Có cơ hội nào cho sinh viên hoàn thành chương trình học nhanh chóng để bắt đầu làm đồ án tốt nghiệp trước hạn không?",
            "Nếu sinh viên học nhanh hơn dự kiến,bắt đầu làm đồ án tốt nghiệp trước kế hoạch không?",
            "Nếu sinh viên hoàn thành học phần trước hạn, thực hiện đồ án tốt nghiệp trước kế hoạch không?",
            "Sinh viên nhanh chóng hoàn thành các môn học, liệu họ có thể bắt đầu làm đồ án tốt nghiệp sớm hơn không?"
         ],
         "responses": [
            "Sinh viên học vượt nếu đáp ứng đầy đủ các quy định về điều kiện thực hiện đồ án tốt nghiệp thì sinh viên làm đơn xin làm đồ án tốt nghiệp trước và nộp cho thư ký khoa."
         ]
      },
      {
         "tag": "doimamon",
         "patterns": [
            "Làm thế nào sinh viên tiếp cận các thông tin trong việc đăng ký môn học với các môn bỏ và đổi mã môn học.",
            "Sinh viên có cách nào để tìm hiểu thông tin về việc đăng ký môn học, khi muốn bỏ và đổi mã môn học không?",
            "Làm thế nào để sinh viên có thể tra cứu thông tin về việc đăng ký môn học,khi muốn bỏ và đổi mã môn học?",
            "Có cách nào giúp sinh viên tiếp cận thông tin về việc đăng ký môn học, khi muốn bỏ và đổi mã môn học không?",
            "Sinh viên có thể làm gì để nắm thông tin về việc đăng ký môn học, khi muốn bỏ và đổi mã môn học?",
            "Làm thế nào để sinh viên có thể tìm hiểu về quy trình đăng ký môn học, khi muốn bỏ và đổi mã môn học?",
            "Sinh viê tiếp cận thông tin về việc đăng ký môn học, khi muốn bỏ và đổi mã môn học không?",
            "Làm thế nào để sinh viên biết thông tin về việc đăng ký môn học, khi muốn bỏ và đổi mã môn học?",
            "Sinh viên tìm hiểu thông tin về việc đăng ký môn học ở đâu,khi muốn bỏ và đổi mã môn học?"
         ],
         "responses": [
            "Hiện nay khoa đã thực hiện công bố các môn học tương đương trên website của khoa, các em tham khảo để biết môn học tương đương thay thế giữa các chương trình đào tạo"
         ]
      },
      {
         "tag": "hotrosv1mon",
         "patterns": [
            "Có những sinh viên chỉ còn 1 môn học vẫn không đăng ký học được, Trường có phương án nào hỗ trợ?",
            "Nếu chỉ còn một môn học và không thể đăng ký được, liệu trường có giải pháp hỗ trợ nào không?",
            "Sinh viên chỉ còn một môn học để đăng ký, Trường có cung cấp các biện pháp hỗ trợ không?",
            "Nếu chỉ còn một môn học và không thể đăng ký được, liệu Trường có cung cấp giải pháp nào giúp sinh viên không?",
            "Trường có biện pháp hỗ trợ nào dành cho sinh viên chỉ còn một môn học và gặp vấn đề về đăng ký không?",
            "Nếu sinh viên chỉ còn một môn học và không thể đăng ký được, Trường có giải pháp nào để hỗ trợ không?",
            "Sinh viên gặp khó khăn khi chỉ còn một môn học để đăng ký, liệu Trường có cung cấp hỗ trợ không?",
            "Có những sinh viên chỉ còn một môn học và không đăng ký được, Trường có cung cấp phương án nào để giúp đỡ không?",
            "Nếu sinh viên chỉ còn một môn học và gặp khó khăn trong việc đăng ký, Trường có cung cấp hỗ trợ nào không?",
            "Trường có các biện pháp hỗ trợ nào dành cho sinh viên chỉ còn một môn học và không thể đăng ký được không?"
         ],
         "responses": [
            "Nếu còn duy nhất 01 môn học, các em liên hệ ban tư vấn để có hướng giải quyết phù hợp."
         ]
      },
      {
         "tag": "doantotnghiep",
         "patterns": [
            "Làm đồ án tốt nghiệp nếu không hoàn thành theo tiến độ có thể chuyển sang học kỳ tiếp theo để bảo vệ được không?",
            "Nếu không hoàn thành đồ án tốt nghiệp theo kế hoạch,tiếp tục vào học kỳ tiếp theo để hoàn tất không?",
            "Nếu gặp khó khăn trong việc hoàn thành đồ án tốt nghiệp đúng thời hạn, chuyển sang học kỳ sau để hoàn tất không?",
            "Trường có chính sách nào đối với sinh viên không hoàn thành đồ án tốt nghiệp theo kế hoạch?",
            "Nếu không đạt được tiến độ đồ án tốt nghiệp, liệu có được chuyển sang học kỳ tiếp theo để hoàn thành không?",
            "Nếu không thể hoàn thành đồ án tốt nghiệp đúng thời gian, có được chuyển sang học kỳ tiếp theo không?",
            "Nếu gặp khó khăn trong việc hoàn thành đồ án tốt nghiệp, liệu có cơ hội chuyển sang học kỳ sau để hoàn tất không?",
            "Nếu cần thêm thời gian để hoàn thành đồ án tốt nghiệp, liệu có thể chuyển sang học kỳ tiếp theo để hoàn thành không?",
            "Nếu không thể đáp ứng được yêu cầu về đồ án tốt nghiệp, liệu có cơ hội được chuyển sang học kỳ sau để hoàn tất không?",
            "Nếu không thể hoàn thành đồ án tốt nghiệp, liệu có cơ hội được đăng ký môn học vào học kỳ tiếp theo để hoàn thành không?",
            "Nếu không đủ điều kiện bảo vệ đồ án tốt nghiệp, liệu có thể chuyển sang học kỳ tiếp theo để hoàn tất không?"
         ],
         "responses": [
            "Không được bảo lưu, sinh viên phải đăng ký lại đồ án tốt nghiệp ở học kỳ kế tiếp."
         ]
      },
      {
         "tag": "ytuongdetai",
         "patterns": [
            "Sinh viên có ý tưởng về sản phẩm đề tài tốt nghiệp, em có thể nhờ các Thầy giúp đỡ không?",
            "Em có thể xin sự hỗ trợ từ các Thầy về ý tưởng sản phẩm đề tài tốt nghiệp không?",
            "Em có thể nhờ sự giúp đỡ từ các Thầy về ý tưởng cho sản phẩm đề tài tốt nghiệp không?",
            "Có thể tìm sự hỗ trợ từ các Thầy để phát triển ý tưởng sản phẩm đề tài tốt nghiệp không?",
            "Có thể xin ý kiến từ các Thầy về ý tưởng sản phẩm đề tài tốt nghiệp không?",
            "Sinh viên có được hỏi ý kiến từ các Thầy về ý tưởng sản phẩm đề tài tốt nghiệp không?",
            "Có thể nhờ sự tư vấn từ các Thầy về việc chọn ý tưởng sản phẩm đề tài tốt nghiệp không?",
            "Sinh viên có thể hỏi các Thầy để được hỗ trợ về ý tưởng sản phẩm đề tài tốt nghiệp không?"
         ],
         "responses": [
            "Sinh viên hoàn toàn có thể trao đổi với các thầy có cùng lĩnh vực nghiên cứu để hỗ trợ và hướng dẫn đồ án tốt nghiệp"
         ]
      },
      {
         "tag": "traodoitienganh",
         "patterns": [
            "Sinh viên có thể trao đổi với giáo viên bằng tiếng Anh?",
            "Sinh viên có thể tương tác với giáo viên bằng tiếng Anh không?",
            "Có thể trò chuyện với giáo viên bằng tiếng Anh được không?",
            "Sinh viên có thể đối thoại với giáo viên bằng tiếng Anh hay không?",
            "Có thể gặp gỡ và trao đổi với giáo viên bằng tiếng Anh được không?",
            "Có thể trò chuyện với giáo viên bằng tiếng Anh được không?",
            "Liệu có thể thảo luận với giáo viên bằng tiếng Anh không?"
         ],
         "responses": [
            "Các thầy sẽ sẵn long trao đổi với các em trong các lĩnh vực chuyên ngành bằng tiếng anh"
         ]
      },
      {
         "tag": "nghiepvusupham",
         "patterns": [
            "Em có thể học nghiệp vụ sư phạm ở đâu? ",
            "Làm sao để đăng ký vào các khóa học về nghiệp vụ sư phạm?",
            "Có trường nào có khóa học về nghiệp vụ sư phạm không?",
            "Làm thế nào để đăng ký vào khóa học về nghiệp vụ sư phạm?",
            "Đăng ký nghiệp vụ sinh phạm ở đâu",
            "En muốn học nghiệp vụ sư phạm thì đăng ký như thế nào"
         ],
         "responses": [
            "Đăng ký vào học kỳ hè năm 3 là tốt nhất. Đăng ký học ở Viện Sư Phạm Kỹ Thuật (trước đây là khoa SPKT)."
         ]
      },
      {
         "tag": "hotrothuctap",
         "patterns": [
            "Nếu em không xin được nơi thực tập, Khoa có thể giới thiệu cho chúng em không? ",
            "Trường hợp không xin được nơi thực tập, Khoa có thể giới thiệu cho em các cơ hội thực tập khác không?",
            "Nếu em gặp khó khăn trong việc tìm nơi thực tập, liệu Khoa có thể hỗ trợ bằng cách giới thiệu cho em không?",
            "Nếu em  gặp khó khăn trong việc xin nơi thực tập, liệu Khoa có thể giới thiệu hoặc hỗ trợ em không?",
            "Trong trường hợp không thể xin được nơi thực tập, Khoa có thể giới thiệu cho em cơ hội thực tập khác không?",
            "Nếu em không thể tìm được nơi thực tập, liệu Khoa có thể giới thiệu hoặc hỗ trợ em không?"
         ],
         "responses": [
            "Theo qui định của Khoa, GV hướng dẫn TT tốt nghiệp sẽ liên hệ nơi TT cho SV.Tuy nhiên nếu SV nào có thể tự liên hệ nơi thực tập, giáo viên sẽ xin công văn riêng cho sinh viên. Sẽ không có trường hợp Sinh viên không có nơi thực tập tốt nghiệp."
         ]
      },
      {
         "tag": "dieukiendoan",
         "patterns": [
            "Trong một lớp có giới hạn số sinh viên làm đồ án tốt nghiệp không? ",
            "Trong mỗi lớp, có sự giới hạn về số lượng sinh viên được phép thực hiện đồ án tốt nghiệp không?",
            "Có hạn chế về số lượng sinh viên được phép thực hiện đồ án tốt nghiệp trong mỗi lớp không?",
            "Trong một lớp, có quy định về số lượng sinh viên được phép tham gia vào đồ án tốt nghiệp không?",
            "Có sự hạn chế về số lượng sinh viên có thể tham gia vào đồ án tốt nghiệp trong mỗi lớp không?",
            "Trong mỗi lớp, có quy định về số lượng sinh viên được phép làm đồ án tốt nghiệp không?",
            "Có giới hạn về số lượng sinh viên được phép thực hiện đồ án tốt nghiệp trong mỗi lớp không?",
            "Trong một lớp, có hạn chế về số lượng sinh viên được phép tham gia vào đồ án tốt nghiệp không?",
            "Có quy định về số lượng sinh viên có thể thực hiện đồ án tốt nghiệp trong mỗi lớp không?",
            "Có sự giới hạn về số lượng sinh viên có thể tham gia vào đồ án tốt nghiệp trong mỗi lớp không?"
         ],
         "responses": [
            "Không giới hạn. Điểm trung bình tích lũy từ 6.5 trở lên. Sinh viên viết đơn xin làm đồ án tốt nghiệp trong đó có tên đề tài và tên Giáo viên hướng dẫn. Lớp trưởng tổng hợp danh sách gửi cho Trưởng Bộ môn các ngành: CNM (Thầy Châu), KTGĐ (Cô Kim Chi), TKTT (Cô Khanh). Sau đó, Bộ môn họp lại và xem xét có cho sv làm đồ án hay không.Sv làm đồ án đóng học phí tương đương với 7 tín chỉ"
         ]
      },
      {
         "tag": "nguyenvongthuctap",
         "patterns": [
            "Sinh viên không đủ điều kiện thực tập sớm, nhưng có nguyện vọng thực tập có thể xem xét và hỗ trợ không?",
            "Có cơ hội cho sinh viên không đáp ứng điều kiện thực tập sớm nhưng mong muốn thực tập được xem xét và hỗ trợ không?",
            "Sinh viên không đủ điều kiện thực tập sớm, nhưng nếu có nguyện vọng thực tập,có được xem xét và nhận hỗ trợ không?",
            "Có khả năng xem xét và hỗ trợ cho sinh viên không đủ điều kiện thực tập sớm nhưng mong muốn thực tập không?",
            "Trường có xem xét và hỗ trợ cho sinh viên không đủ điều kiện thực tập sớm nhưng có mong muốn thực tập không?",
            "Có cơ hội xem xét và hỗ trợ cho sinh viên không đáp ứng được điều kiện thực tập sớm nhưng muốn thực tập không?",
            "Trong trường hợp sinh viên không đủ điều kiện thực tập sớm nhưng mong muốn thực tập, liệu có được xem xét và hỗ trợ không?",
            "Có khả năng xem xét và hỗ trợ cho sinh viên không đủ điều kiện thực tập sớm nhưng muốn thực tập không?",
            "Nếu sinh viên không đáp ứng được điều kiện thực tập sớm, liệu có cơ hội được xem xét và nhận hỗ trợ để thực tập không?"
         ],
         "responses": [
            "Khi muốn thực tập sớm sinh viên phải đáp ứng theo đúng quy định của Khoa (theo thông báo đã được đăng trên website Khoa)."
         ]
      },
      {
         "tag": "kqthuctap",
         "patterns": [
            "Khi đăng ký thực tập tốt nghiệp, nếu trước đó em đã thực tập rồi thì có thể lấy kết quả đó được không?",
            "Nếu đã có kết quả từ thực tập trước đó, liệu có thể sử dụng kết quả đó khi đăng ký thực tập tốt nghiệp không?",
            "Có thể sử dụng kết quả từ kỳ thực tập trước đó khi đăng ký thực tập tốt nghiệp không?",
            "Kết quả từ thực tập trước đó có thể áp dụng cho đăng ký thực tập tốt nghiệp không?",
            "Có thể áp dụng kết quả từ kỳ thực tập trước đó cho thực tập tốt nghiệp không?",
            "Có thể sử dụng kết quả từ kỳ thực tập trước đó khi đăng ký thực tập tốt nghiệp không?",
            "Trong trường hợp đã có kết quả từ thực tập trước đó, liệu có thể áp dụng lại kết quả đó cho thực tập tốt nghiệp không?",
            "Có thể sử dụng kết quả từ kỳ thực tập trước đó khi đăng ký thực tập tốt nghiệp không?",
            "Kết quả từ thực tập trước đó có thể dùng để đăng ký thực tập tốt nghiệp không?"
         ],
         "responses": [
            "Thời gian em thực tập có được sự đồng ý của BCNK hay không. Kết quả thực tập đó có được sư đồng ý của GV hướng dẫn của em không. Thực tế việc thực tập của em nếu diễn ra như vậy thì chưa được sự cho phép của BCNK và không xác định được việc thực tập của em là có hay không nên kết quả đó sẽ không được công nhận"
         ]
      },
      {
         "tag": "diemkltn",
         "patterns": [
            "Điểm khóa luận tốt nghiệp có sự chênh lệch giữa các hội đồng?",
            "Có sự chênh lệch về điểm khóa luận tốt nghiệp giữa các hội đồng không?",
            "Có sự đồng nhất về điểm khóa luận tốt nghiệp giữa các hội đồng không?",
            "Có sự phân biệt về điểm khóa luận tốt nghiệp giữa các hội đồng không?",
            "Trong quá trình đánh giá điểm khóa luận tốt nghiệp, có sự đồng đều giữa các hội đồng không?",
            "Có sự biến đổi về điểm khóa luận tốt nghiệp giữa các hội đồng không?",
            "Có sự không đồng nhất về điểm khóa luận tốt nghiệp giữa các hội đồng không?",
            "Trong việc xét điểm khóa luận tốt nghiệp, có sự chênh lệch giữa các hội đồng không?",
            "Có sự không thống nhất về điểm khóa luận tốt nghiệp giữa các hội đồng không?"
         ],
         "responses": [
            "Việc phân công Hội đồng bảo vệ khóa luận được khoa, bộ môn xem xét một cách kỹ lưỡng dựa trên chuyên môn, chuyên ngành giảng dạy của từng giáo viên. Công tác phản biện, chấm bài cũng được quy định cụ thể theo từng thang điểm để có cơ sở đánh giá và chấm điểm một cách chính xác, công bằng nhất cho các em. Không có sự chênh lệch điểm giữa các hội đồng"
         ]
      },
      {
         "tag": "condauthuctap",
         "patterns": [
            "Có nhất thiết phải xin con dấu của đơn vị thực tập không? ",
            "Có cần thiết phải có con dấu của đơn vị thực tập không?",
            "Việc có con dấu của đơn vị thực tập là bắt buộc không?",
            "Khi xin thực tập, cần phải có sự đóng dấu của đơn vị không?",
            "Có yêu cầu nào về việc sử dụng con dấu từ đơn vị thực tập không?",
            "Việc có con dấu từ đơn vị thực tập là một phần quan trọng của quy trình xin thực tập không?",
            "Trong hồ sơ xin thực tập, cần phải bao gồm con dấu của đơn vị thực tập không?",
            "Có cần phải có sự xác nhận bằng con dấu từ đơn vị thực tập không?",
            "Liệu con dấu của đơn vị thực tập có cần thiết cho quy trình xin thực tập không?",
            "Trong quá trình xin thực tập, việc có con dấu từ đơn vị là bắt buộc hay không?"
         ],
         "responses": [
            "Con dấu của đơn vị thực tập bắt buộc phải có để minh chứng cho việc sinh viên có thực tập ở công ty đó hay không."
         ]
      },
      {
         "tag": "ttoque", 
         "patterns": [
            "Nếu sinh viên về quê thực tập thì vấn đề liên hệ với giáo viên hướng dẫn như thế nào?",
            "Cách thức liên hệ với giáo viên hướng dẫn nếu sinh viên muốn thực tập tại quê nhà là gì?",
            "Khi sinh viên muốn thực tập tại quê nhà, làm thế nào để liên hệ với giáo viên hướng dẫn?",
            "Làm thế nào để sinh viên liên hệ với giáo viên hướng dẫn nếu muốn thực tập tại quê nhà?",
            "Nếu sinh viên muốn thực tập ở quê nhà, làm sao để tiếp cận và liên hệ với giáo viên hướng dẫn?",
            "Cách tiếp cận giáo viên hướng dẫn khi sinh viên muốn thực tập tại quê nhà là gì?",
            "Nếu muốn thực tập tại quê nhà, sinh viên có thể liên hệ với giáo viên hướng dẫn như thế nào?",
            "Trong trường hợp sinh viên muốn thực tập ở quê nhà, cách liên hệ với giáo viên hướng dẫn là gì?"
         ],
         "responses": [
            "Trong thời gian đi thực tập Sinh viên chịu sự quản lý của giáo viên hướng dẫn, do đó sinh viên phải xin phép GVHD và phải thực hiện đúng kế hoạch thực tập theo lịch học vụ của Khoa và của GVHD."
         ]
      },
      {
         "tag": "khoixettuyen",
         "patterns": [
            "Khối xét tuyển công nghệ thông tin",
            "Cho em hỏi ngành CNTT thì mình xét khối nào?",
            "Ngành CNTT xét học bạ với thi khối nào ạ?",
            "Cho em hỏi CNTT thì nên thi khối nào sẽ thuận lợi hơn ạ?",
            "Cho em hỏi ngành CNTT thi đầu vào là mấy môn và môn nào vậy Thầy và Cô",
            "Khối xét tuyển là khối nào v ạ",
            "khối xét tuyển ngành cntt",
            "Ngành cntt  thi khối nào ạ",
            "thi khối nào sẽ được xét ngành cntt",
            "khối để xét tuyển ngành cntt",
            "cntt thì theo tổ hợp khối nào vậy ạ",
            "khối cntt là khối A đúng không",
            "tổ hợp xét tuyển của ngành cntt",
            "ngành này xét tuyển khối nào v",
            "cho hoi ngành kỹ thuật dữ liệu thi minh xét khoi nao?",
            "nganh ky thuat du lieu xet hoc ba voi thi khoi nao a?",
            "cho hoi ky thuat du lieu thi nen thi khoi nao se thuan loi hon a? ",
            "cho hoi nganh ky thuat du lieu thi dau vao la may mon va mon nao ",
            "khoi xet tuyen nganh kỹ thuật dữ liệu",
            "nganh kỹ thuật dữ liệu thi khoi nao ",
            "thi khoi nao se duoc xet nganh kỹ thuật dữ liệu",
            "khoi de xet tuyen nganh kỹ thuật dữ liệu",
            "kỹ thuật dữ liệu thi theo to hop khoi nao",
            "khoi kỹ thuật dữ liệu la khoi a dung khong",
            "to hop xet tuyen cua nganh kỹ thuật dữ liệu",
            "cho  hoi ngành an toan thong tin thi minh xét khoi nao?",
            "nganh an toan thong tin xet hoc ba voi thi khoi nao a?",
            "cho  hoi an toan thong tin thi nen thi khoi nao se thuan loi hon a?",
            "cho  hoi nganh an toan thong tin thi dau vao la may mon va mon nao ",
            "khoi xet tuyen nganh an toan thong tin",
            "nganh an toan thong tin thi khoi nao",
            "thi khoi nao se duoc xet nganh an toan thong tin",
            "khoi de xet tuyen nganh an toan thong tin",
            "an toan thong tin thi theo to hop khoi nao",
            "khoi an toan thong tin la khoi a dung khong",
            "to hop xet tuyen cua nganh kan toan thong tin"
         ],
         "responses": [
            "Khối A bao gồm A00 (Toán, Lý, Hóa), A01 (Toán, Lý, Anh), D01 (Toán, Văn, Anh), D90(Toán, Anh, Khoa học tự nhiên)"
         ]
      },
      {
         "tag": "cosotruong",
         "patterns": [
            "Trường có bao nhiêu cơ sở?",
            "Số lượng cơ sở của trường là bao nhiêu?",
            "Trường có tổng cộng bao nhiêu cơ sở?",
            "Có bao nhiêu cơ sở của trường?",
            "Tổng số cơ sở của trường là bao nhiêu?",
            "Số lượng cơ sở học tập của trường là bao nhiêu?",
            "Có mấy địa điểm học của trường?",
            "Trường có cả mấy chi nhánh?",
            "Có bao nhiêu địa điểm trực thuộc của trường?",
            "Số lượng cơ sở đào tạo của trường là bao nhiêu?",
            "Trường có tổng cộng bao nhiêu địa chỉ học tập?"
            
         ],
         "responses": [
            "Trường có 2 cơ sở trong đó cơ sở chính tại số 01 Võ Văn Ngân, Phường Linh Chiểu, Thành Phố Thủ Đức, TP.Hồ Chí Minh, trụ sở phụ 484 Lê Văn Việt, Tăng Nhơn Phú A, Quận 9, Thành phố Hồ Chí Minh"
         ]
      },
      {
         "tag": "thaytu",
         "patterns": [
            "Thầy Tú khóa Công nghệ thông tin phụ trách giảng dạy những môn gì ",
            "Thầy Tú dạy những môn gì trong ngành Công nghệ thông tin?",
            "Môn học nào Thầy Tú phụ trách trong ngành Công nghệ thông tin?",
            "Thầy Tú giảng dạy các khóa học nào liên quan đến Công nghệ thông tin?",
            "Thầy Tú có phụ trách những môn học nào trong ngành Công nghệ thông tin?",
            "Trong lĩnh vực Công nghệ thông tin, Thầy Tú dạy những môn gì?",
            "Các môn học do Thầy Tú phụ trách trong lĩnh vực Công nghệ thông tin là gì?"
         ],
         "responses": [
            "Như Nhập môn lập trình , kĩ thuật lập trình ..."
         ]
      },
      {
         "tag": "khoacntt",
         "patterns": [
            "Khoa công nghệ thông thông tin có bao nhiêu ngành",
            "Khoa Công nghệ thông tin có bao nhiêu ngành?",
            "Trong Khoa Công nghệ thông tin, có bao nhiêu ngành?",
            "Có những ngành gì trong Khoa Công nghệ thông tin?",
            "Có những ngành nào được đào tạo trong Khoa Công nghệ thông tin?",
            "Khoa Công nghệ thông tin có những chương trình đào tạo ngành nào?",
            "Trong Khoa Công nghệ thông tin, có những ngành gì?",
            "Em muốn biết về số lượng ngành học trong Khoa Công nghệ thông tin."
         ],
         "responses": [
            "Có 3 ngành trong đó là công nghệ thông tin, an toàn thông tin, kĩ thuật dữ liệu "
         ]
      },
      {
         "tag": "xemkltn",
         "patterns": [
            "Sinh viên năm 2, 3 có được phép xem buổi bảo vệ khóa luận tốt nghiệp không?",
            "Có cho phép sinh viên năm 2, 3 tham dự buổi bảo vệ khóa luận tốt nghiệp không?",
            "Em có thể tham dự các buổi bảo vệ khóa luận tốt nghiệp dù đang học năm 2 không?",
            "Có cho phép sinh viên năm 2 xem các buổi bảo vệ khóa luận tốt nghiệp không?",
            "Có quy định nào cấm sinh viên năm 2, 3 tham dự buổi bảo vệ khóa luận tốt nghiệp không?",
            "Có phải sinh viên năm 2, 3 được phép xem buổi bảo vệ khóa luận tốt nghiệp không?",
            "Em có thể tham gia xem các buổi bảo vệ khóa luận tốt nghiệp dù đang học năm 2, 3 phải không?",
            "Em nghe nói rằng buổi bảo vệ khóa luận tốt nghiệp có thể được xem sinh viên năm 2, 3. Điều đó có đúng không?"

         ],
         "responses": [
            "Có, các bạn chú ý trang website khoa để xem thông báo và địa điểm của buổi bảo vệ khóa luận"
         ]
      },
      {
         "tag": "chuyendedoanhnghiep",
         "patterns": [
            "Làm cách nào đế lấy điểm chuyên đề doanh nghiệp?",
            "Em muốn đăng ký chuyên đề doanh nghiệp phải làm sao?",
            "Có những cách nào để tôi kiếm điểm trong chuyên đề Doanh nghiệp?",
            "Để kiếm điểm cao cho chuyên đề Doanh nghiệp, em cần thực hiện những gì?",
            "Trong chuyên đề Doanh nghiệp, em phải làm gì để kiếm điểm?",
            "Có những gợi ý nào để tăng điểm trong chuyên đề Doanh nghiệp?"
         ],
         "responses": [
            "Bạn hãy chú ý trang facebook Khoa CNTT và khoa quan hệ doanh nghiệp để đăng kí và đi dự hội thảo và làm bài thu hoạch để dược cộng điểm"
         ]
      },
      {
         "tag": "tacdungcddn",
         "patterns": [
            "Điểm chuyên đề doanh nghiệp để làm gì ",
            "Mục đích của việc có điểm chuyên đề Doanh nghiệp là gì?",
            "Vì sao chúng ta phải đạt được điểm chuyên đề Doanh nghiệp?",
            "Sau khi nhận được điểm chuyên đề Doanh nghiệp, chúng ta có thể sử dụng nó vào việc gì?",
            "Điểm chuyên đề Doanh nghiệp có giá trị gì?",
            "Tác dụng điểm chuyên đề doanh nghiệp là gì",
            "Những lợi ích khi tham gia chuyên đề doanh nghiệp"
            
         ],
         "responses": [
            "Để bạn đủ điều kiện ra trường với 8 buổi/10đ. Tham gia các buổi chuyên đề doanh nghiệp giúp bạn hiểu rõ hơn về doanh nghiệp và các buổi hội thảo về những công nghệ mới."
         ]
      },
      {
         "tag": "bangkysu",
         "patterns": [
            "Ngành CNTT có đào tạo bằng kĩ sư hay chỉ bằng cử nhân",
            "Ngành CNTT có cấp bằng cử nhân không?",
            "Em nhận được bằng gì sau khi học ngành CNTT không?",
            "Trong lĩnh vực Công nghệ Thông tin, học xong nhận được cấp bằng gì?",
            "Sau khi hoàn thành CNTT, thì em sẽ nhận bằng gì",
            "Bằng em nhận sau khi học xong CNTT là gì"
            
         ],
         "responses": [
            "Bằng cử nhân dành cho khối kinh tế , và bằng kĩ sử dành cho khối kỹ thuật "
         ]
      }
   ]
}